elytron=Elytron \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
elytron.add=\u64CD\u4F5C\u306F Elytron \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u8FFD\u52A0\u3057\u307E\u3059
elytron.remove=\u64CD\u4F5C\u306F Elytron \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u524A\u9664\u3057\u307E\u3059
elytron.default-authentication-context=\u3059\u3079\u3066\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u8A8D\u8A3C\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3002
elytron.initial-providers=\u3059\u3079\u3066\u306E\u65E2\u5B58\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u524D\u306B\u767B\u9332\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.final-providers=\u3059\u3079\u3066\u306E\u65E2\u5B58\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u5F8C\u306B\u767B\u9332\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.disallowed-providers=\u8A31\u53EF\u3055\u308C\u305A\u3001\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30EA\u30B9\u30C8\u304B\u3089\u524A\u9664\u3055\u308C\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u4E00\u89A7\u3002
elytron.security-properties=\u8A2D\u5B9A\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
elytron.authentication-configuration=\u500B\u5225\u306E\u8A8D\u8A3C\u8A2D\u5B9A\u5B9A\u7FA9\u3002
elytron.authentication-configuration.add=\u65B0\u3057\u3044\u8A8D\u8A3C\u8A2D\u5B9A\u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.authentication-configuration.remove=\u8A8D\u8A3C\u8A2D\u5B9A\u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.authentication-configuration.extends=\u62E1\u5F35\u3059\u308B\u4EE5\u524D\u5B9A\u7FA9\u3055\u308C\u305F\u8A8D\u8A3C\u8A2D\u5B9A\u3002
elytron.authentication-configuration.anonymous=\u533F\u540D\u306E\u8A8D\u8A3C\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
elytron.authentication-configuration.authentication-name=\u4F7F\u7528\u3059\u308B\u8A8D\u8A3C\u540D\u3002
elytron.authentication-configuration.authorization-name=\u4F7F\u7528\u3059\u308B\u627F\u8A8D\u540D\u3002
elytron.authentication-configuration.host=\u4F7F\u7528\u3059\u308B\u30DB\u30B9\u30C8\u3002
elytron.authentication-configuration.port=\u4F7F\u7528\u3059\u308B\u30DD\u30FC\u30C8\u3002
elytron.authentication-configuration.protocol=\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.authentication-configuration.realm=\u4F7F\u7528\u3059\u308B\u30EC\u30EB\u30E0\u3002
elytron.authentication-configuration.security-domain=\u8EE2\u9001\u3055\u308C\u305F\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u3078\u306E\u53C2\u7167\u3002
elytron.authentication-configuration.forwarding-mode=\u4F7F\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u8EE2\u9001\u306E\u578B\u3002\u8A8D\u8A3C (authentication) \u8EE2\u9001\u306E\u30E2\u30FC\u30C9\u306F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3068\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u8EE2\u9001\u3057\u307E\u3059\u3002\u627F\u8A8D (authorization) \u306E\u30E2\u30FC\u30C9\u306F\u627F\u8A8D ID \u3092\u8EE2\u9001\u3057\u3001\u7570\u306A\u308B\u8A8D\u8A3C\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u8A31\u53EF\u3057\u307E\u3059\u3002
elytron.authentication-configuration.sasl-mechanism-selector=SASL \u30E1\u30AB\u30CB\u30BA\u30E0\u30BB\u30EC\u30AF\u30BF\u30FC\u6587\u5B57\u5217\u3002
elytron.authentication-configuration.mechanism-properties=SASL \u8A8D\u8A3C\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC
elytron.authentication-configuration.mechanism-properties.name=\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3002
elytron.authentication-configuration.mechanism-properties.value=\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u5024\u3002
elytron.authentication-configuration.credential-reference=\u5B9A\u7FA9\u3055\u308C\u305F\u30A8\u30A4\u30EA\u30A2\u30B9\u307E\u305F\u306F\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u4E0B\u306E CredentialStore \u306B\u4FDD\u5B58\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u53C2\u7167\u3002
elytron.authentication-configuration.credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D\u3002
elytron.authentication-configuration.credential-reference.alias=\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30B9\u30C8\u30A2\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.authentication-configuration.credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7\u3002
elytron.authentication-configuration.credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6\u3002\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044\u3002
elytron.authentication-configuration.kerberos-security-factory=GSS Kerberos \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u53D6\u5F97\u306B\u4F7F\u7528\u3055\u308C\u308B Kerberos \u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.authentication-context=\u500B\u5225\u306E\u8A8D\u8A3C\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5B9A\u7FA9\u3002
elytron.authentication-context.add=\u65B0\u3057\u3044\u8A8D\u8A3C\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.authentication-context.remove=\u8A8D\u8A3C\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.authentication-context.extends=\u62E1\u5F35\u3059\u308B\u4EE5\u524D\u5B9A\u7FA9\u3055\u308C\u305F\u8A8D\u8A3C\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3002
elytron.authentication-context.match-rules=\u3053\u306E\u8A8D\u8A3C\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u4E00\u81F4\u30EB\u30FC\u30EB\u3002
elytron.authentication-context.match-rules.match-abstract-type=\u4E00\u81F4\u3092\u7167\u5408\u3059\u308B\u62BD\u8C61\u578B\u3002
elytron.authentication-context.match-rules.match-abstract-type-authority=\u4E00\u81F4\u3092\u7167\u5408\u3059\u308B\u62BD\u8C61\u578B\u30AA\u30FC\u30BD\u30EA\u30C6\u30A3\u30FC\u3002
elytron.authentication-context.match-rules.match-host=\u4E00\u81F4\u3092\u7167\u5408\u3059\u308B\u30DB\u30B9\u30C8\u3002
elytron.authentication-context.match-rules.match-local-security-domain=\u4E00\u81F4\u3092\u7167\u5408\u3059\u308B\u30ED\u30FC\u30AB\u30EB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u3002
elytron.authentication-context.match-rules.match-no-user=\u30E6\u30FC\u30B6\u30FC\u306B\u5BFE\u3057\u3066\u4E00\u81F4\u7167\u5408\u3057\u307E\u305B\u3093\u3002
elytron.authentication-context.match-rules.match-path=\u4E00\u81F4\u3092\u7167\u5408\u3059\u308B\u30D1\u30C3\u30C1\u3002
elytron.authentication-context.match-rules.match-port=\u4E00\u81F4\u3092\u7167\u5408\u3059\u308B\u30DD\u30FC\u30C8\u3002
elytron.authentication-context.match-rules.match-protocol=\u4E00\u81F4\u3092\u7167\u5408\u3059\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.authentication-context.match-rules.match-urn=\u4E00\u81F4\u3092\u7167\u5408\u3059\u308B URN\u3002
elytron.authentication-context.match-rules.match-user=\u4E00\u81F4\u3057\u305F\u3082\u306E\u306B\u4F7F\u7528\u3059\u308B\u8A8D\u8A3C\u8A2D\u5B9A\u3002
elytron.authentication-context.match-rules.authentication-configuration=\u4E00\u81F4\u3057\u305F\u3082\u306E\u306B\u4F7F\u7528\u3059\u308B\u8A8D\u8A3C\u8A2D\u5B9A\u3002
elytron.authentication-context.match-rules.ssl-context=\u4E00\u81F4\u3057\u305F\u3082\u306E\u306B\u4F7F\u7528\u3059\u308B SSLContext\u3002
elytron.aggregate-providers=2 \u3064\u4EE5\u4E0A\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC []  \u30EA\u30BD\u30FC\u30B9\u306E\u96C6\u7D04\u3002
elytron.aggregate-providers.add=\u96C6\u7D04\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30EA\u30BD\u30FC\u30B9\u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.aggregate-providers.remove=\u96C6\u7D04\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30EA\u30BD\u30FC\u30B9\u306E\u524A\u9664\u64CD\u4F5C
elytron.aggregate-providers.providers=\u96C6\u7D04\u3059\u308B\u53C2\u7167\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC []  \u30EA\u30BD\u30FC\u30B9\u3002
elytron.provider-loader=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30ED\u30FC\u30C0\u30FC\u306E\u5B9A\u7FA9\u3002
elytron.provider-loader.add=\u65B0\u3057\u3044\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30ED\u30FC\u30C0\u30FC\u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.provider-loader.remove=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30ED\u30FC\u30C0\u30FC\u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.provider-loader.module=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30ED\u30FC\u30C9\u5143\u3068\u306A\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D\u3002
elytron.provider-loader.class-names=\u30ED\u30FC\u30C9\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D\u3002\u30B5\u30FC\u30D3\u30B9\u30ED\u30FC\u30C0\u30FC\u304C\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u691C\u51FA\u3057\u305F\u5F8C\u306B\u30ED\u30FC\u30C9\u3055\u308C\u3001\u8907\u88FD\u306F\u30B9\u30AD\u30C3\u30D7\u3055\u308C\u307E\u3059\u3002
elytron.provider-loader.path=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u521D\u671F\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9\u3002
elytron.provider-loader.relative-to=\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u306E\u30D9\u30FC\u30B9\u30D1\u30B9\u3002
elytron.provider-loader.argument=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u306B\u3088\u308A\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u30FC\u306B\u6E21\u3055\u308C\u308B\u5F15\u6570\u3002
elytron.provider-loader.configuration=\u521D\u671F\u5316\u306E\u305F\u3081\u306B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3078\u6E21\u3055\u308C\u308B\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A\u3002
elytron.provider-loader.loaded-providers=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30ED\u30FC\u30C0\u30FC\u306B\u3088\u3063\u3066\u30ED\u30FC\u30C9\u3055\u308C\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30EA\u30B9\u30C8\u3002
elytron.provider-loader.loaded-providers.name=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u308B\u540D\u524D\u3002
elytron.provider-loader.loaded-providers.info=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u308B\u60C5\u5831\u3002
elytron.provider-loader.loaded-providers.version=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u308B\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.provider-loader.loaded-providers.services=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A\u30B5\u30FC\u30D3\u30B9\u306E\u30EA\u30B9\u30C8\u3002
elytron.provider-loader.loaded-providers.type=\u30B5\u30FC\u30D3\u30B9\u30BF\u30A4\u30D7\u3002
elytron.provider-loader.loaded-providers.algorithm=\u30B5\u30FC\u30D3\u30B9\u306B\u3088\u3063\u3066\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.provider-loader.loaded-providers.class-name=\u30B5\u30FC\u30D3\u30B9 SPI \u306E\u5B9F\u88C5\u306E\u30AF\u30E9\u30B9\u540D\u3002
elytron.aggregate-security-event-listener=2 \u3064\u4EE5\u4E0A\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30A4\u30D9\u30F3\u30C8\u30EA\u30B9\u30CA\u30FC\u30EA\u30BD\u30FC\u30B9\u306E\u96C6\u7D04\u3002
elytron.aggregate-security-event-listener.add=\u96C6\u7D04\u3055\u308C\u305F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30A4\u30D9\u30F3\u30C8\u30EA\u30B9\u30CA\u30FC\u30EA\u30BD\u30FC\u30B9\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.aggregate-security-event-listener.remove=\u96C6\u7D04\u3055\u308C\u305F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30A4\u30D9\u30F3\u30C8\u30EA\u30B9\u30CA\u30FC\u30EA\u30BD\u30FC\u30B9\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.aggregate-security-event-listener.security-event-listeners=\u96C6\u7D04\u3059\u308B\u53C2\u7167\u3055\u308C\u305F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30A4\u30D9\u30F3\u30C8\u30EA\u30B9\u30CA\u30FC\u30EA\u30BD\u30FC\u30B9\u3002
elytron.file-audit-log=\u30ED\u30FC\u30AB\u30EB\u30D5\u30A1\u30A4\u30EB\u306B\u30ED\u30B0\u3092\u8A18\u9332\u3059\u308B\u76E3\u67FB\u30ED\u30AC\u30FC\u3002
elytron.file-audit-log.add=\u76E3\u67FB\u30ED\u30AC\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.file-audit-log.remove=\u76E3\u67FB\u30ED\u30AC\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.file-audit-log.path=\u66F8\u304D\u8FBC\u3080\u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9\u3002
elytron.file-audit-log.relative-to=\u76E3\u67FB\u30ED\u30B0\u3078\u306E\u76F8\u5BFE\u30D1\u30B9\u3002
elytron.file-audit-log.synchronized=\u3059\u3079\u3066\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u5373\u6642\u306B\u30C7\u30A3\u30B9\u30AF\u3078\u540C\u671F\u5316\u3055\u308C\u308B\u304B\u3069\u3046\u304B\u3002
elytron.file-audit-log.format=\u76E3\u67FB\u30A4\u30D9\u30F3\u30C8\u306E\u8A18\u9332\u306B\u4F7F\u7528\u3059\u308B\u5F62\u5F0F\u3002
elytron.periodic-rotating-file-audit-log=\u6307\u5B9A\u306E\u63A5\u5C3E\u8F9E\u6587\u5B57\u5217\u304B\u3089\u6D3E\u751F\u3059\u308B\u671F\u9593\u306E\u7D4C\u904E\u5F8C\u3001\u30ED\u30B0\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u308B\u30ED\u30FC\u30AB\u30EB\u30D5\u30A1\u30A4\u30EB\u3078\u76E3\u67FB\u30ED\u30B0\u3092\u6C38\u7D9A\u5316\u3059\u308B\u305F\u3081\u306E\u76E3\u67FB\u30ED\u30B0\u5B9A\u7FA9\u3002java.time.format.DateTimeFormatter \u304C\u8A8D\u8B58\u3067\u304D\u308B\u5F62\u5F0F\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
elytron.periodic-rotating-file-audit-log.add=\u76E3\u67FB\u30ED\u30AC\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.periodic-rotating-file-audit-log.remove=\u76E3\u67FB\u30ED\u30AC\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.periodic-rotating-file-audit-log.path=\u66F8\u304D\u8FBC\u3080\u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9\u3002
elytron.periodic-rotating-file-audit-log.relative-to=\u76E3\u67FB\u30ED\u30B0\u3078\u306E\u76F8\u5BFE\u30D1\u30B9\u3002
elytron.periodic-rotating-file-audit-log.synchronized=\u3059\u3079\u3066\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u5373\u6642\u306B\u30C7\u30A3\u30B9\u30AF\u3078\u540C\u671F\u5316\u3055\u308C\u308B\u304B\u3069\u3046\u304B\u3002
elytron.periodic-rotating-file-audit-log.format=\u76E3\u67FB\u30A4\u30D9\u30F3\u30C8\u306E\u8A18\u9332\u306B\u4F7F\u7528\u3059\u308B\u5F62\u5F0F\u3002
elytron.periodic-rotating-file-audit-log.suffix=\ java.time.format.DateTimeFormatter \u304C\u8A8D\u8B58\u3067\u304D\u308B\u5F62\u5F0F\u306E\u63A5\u5C3E\u8F9E\u6587\u5B57\u5217\u3002\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u306E\u671F\u9593\u306F\u63A5\u5C3E\u8F9E\u3092\u57FA\u306B\u81EA\u52D5\u7684\u306B\u8A08\u7B97\u3055\u308C\u307E\u3059\u3002
elytron.size-rotating-file-audit-log=\u30D5\u30A1\u30A4\u30EB\u304C\u7279\u5B9A\u306E\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5927\u304D\u304F\u306A\u3063\u305F\u5F8C\u306B\u30ED\u30B0\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u308B\u30ED\u30FC\u30AB\u30EB\u30D5\u30A1\u30A4\u30EB\u3078\u76E3\u67FB\u30ED\u30B0\u3092\u6C38\u7D9A\u5316\u3057\u3001\u56FA\u5B9A\u6570\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3092\u4FDD\u6301\u3059\u308B\u305F\u3081\u306E\u76E3\u67FB\u30ED\u30B0\u5B9A\u7FA9\u3002
elytron.size-rotating-file-audit-log.add=\u76E3\u67FB\u30ED\u30AC\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.size-rotating-file-audit-log.remove=\u76E3\u67FB\u30ED\u30AC\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.size-rotating-file-audit-log.path=\u66F8\u304D\u8FBC\u3080\u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9\u3002
elytron.size-rotating-file-audit-log.relative-to=\u76E3\u67FB\u30ED\u30B0\u3078\u306E\u76F8\u5BFE\u30D1\u30B9\u3002
elytron.size-rotating-file-audit-log.synchronized=\u3059\u3079\u3066\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u5373\u6642\u306B\u30C7\u30A3\u30B9\u30AF\u3078\u540C\u671F\u5316\u3055\u308C\u308B\u304B\u3069\u3046\u304B\u3002
elytron.size-rotating-file-audit-log.format=\u76E3\u67FB\u30A4\u30D9\u30F3\u30C8\u306E\u8A18\u9332\u306B\u4F7F\u7528\u3059\u308B\u5F62\u5F0F\u3002
elytron.size-rotating-file-audit-log.max-backup-index=\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u6642\u306B\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u306E\u6700\u5927\u6570\u3002
elytron.size-rotating-file-audit-log.rotate-size=\u30D5\u30A1\u30A4\u30EB\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u308B\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u30B5\u30A4\u30BA\u3002
elytron.size-rotating-file-audit-log.rotate-on-boot=\u65B0\u3057\u3044\u30D5\u30A1\u30A4\u30EB\u304C\u8A2D\u5B9A\u3055\u308C\u308B\u524D\u306B\u30D5\u30A1\u30A4\u30EB\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3002
elytron.size-rotating-file-audit-log.suffix=java.time.format.DateTimeFormatter \u306E\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u540D\u306E\u63A5\u5C3E\u8F9E\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u308B\u65E5\u4ED8\u5F62\u5F0F\u3002\u30D5\u30A1\u30A4\u30EB\u304C\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3055\u308C\u308B\u30BF\u30A4\u30DF\u30F3\u30B0\u306F\u63A5\u982D\u8F9E\u306B\u3088\u3063\u3066\u6C7A\u5B9A\u3055\u308C\u307E\u305B\u3093\u3002
elytron.syslog-audit-log=\u76E3\u67FB\u30A4\u30D9\u30F3\u30C8\u3092\u30EA\u30E2\u30FC\u30C8syslog \u30B5\u30FC\u30D0\u30FC\u306B\u9001\u4FE1\u3059\u308B\u76E3\u67FB\u30ED\u30AC\u30FC\u3002
elytron.syslog-audit-log.add=\u76E3\u67FB\u30ED\u30AC\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.syslog-audit-log.remove=\u76E3\u67FB\u30ED\u30AC\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.syslog-audit-log.server-address=\u30A4\u30D9\u30F3\u30C8\u304C\u9001\u4FE1\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308B syslog \u30B5\u30FC\u30D0\u30FC\u306E\u30B5\u30FC\u30D0\u30FC\u30A2\u30C9\u30EC\u30B9\u3002
elytron.syslog-audit-log.port=syslog \u30B5\u30FC\u30D0\u30FC\u306E\u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30DD\u30FC\u30C8\u3002
elytron.syslog-audit-log.transport=syslog \u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306B\u4F7F\u7528\u3059\u308B\u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u3002
elytron.syslog-audit-log.format=\u76E3\u67FB\u30A4\u30D9\u30F3\u30C8\u306E\u8A18\u9332\u306B\u4F7F\u7528\u3059\u308B\u5F62\u5F0F\u3002
elytron.syslog-audit-log.host-name=\u30EA\u30E2\u30FC\u30C8 syslog \u30B5\u30FC\u30D0\u30FC\u3078\u9001\u4FE1\u3055\u308C\u305F\u3059\u3079\u3066\u306E\u30A4\u30D9\u30F3\u30C8\u5185\u306B\u57CB\u3081\u8FBC\u3080\u30DB\u30B9\u30C8\u540D\u3002
elytron.syslog-audit-log.ssl-context=SSL_TCP \u30C8\u30E9\u30F3\u30B9\u30DD\u30FC\u30C8\u306E\u4F7F\u7528\u6642\u306B syslog \u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306B\u4F7F\u7528\u3055\u308C\u308B SSLContext\u3002
elytron.http-authentication-factory=SecurityDomain \u3068 HttpServerAuthenticationMechanismFactory \u3068\u306E\u95A2\u9023\u304C\u542B\u307E\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u3002
elytron.http-authentication-factory.add=\u65B0\u3057\u3044 http-authentication-factory \u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.http-authentication-factory.remove=http-authentication-factory \u30EA\u30BD\u30FC\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.http-authentication-factory.security-domain=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u3068\u95A2\u9023\u3059\u308B SecurityDomain
elytron.http-authentication-factory.http-server-mechanism-factory=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u3068\u95A2\u9023\u3059\u308B HttpServerAuthenticationMechanismFactory 
elytron.http-authentication-factory.mechanism-configurations=\u30E1\u30AB\u30CB\u30BA\u30E0\u56FA\u6709\u306E\u8A2D\u5B9A
elytron.http-authentication-factory.mechanism-configurations.mechanism-name=\u3053\u306E\u8A2D\u5B9A\u306F\u3001\u6307\u5B9A\u306E\u540D\u524D\u3092\u6301\u3064\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u4F7F\u7528\u3055\u308C\u305F\u5834\u5408\u306E\u307F\u9069\u7528\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u3092\u7701\u7565\u3059\u308B\u3068\u3001\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u540D\u524D\u306E\u3044\u305A\u308C\u304B\u306B\u5408\u308F\u305B\u307E\u3059\u3002
elytron.http-authentication-factory.mechanism-configurations.host-name=\u3053\u306E\u8A2D\u5B9A\u304C\u9069\u7528\u3055\u308C\u308B\u30DB\u30B9\u30C8\u540D\u3002
elytron.http-authentication-factory.mechanism-configurations.protocol=\u3053\u306E\u8A2D\u5B9A\u304C\u9069\u7528\u3055\u308C\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.http-authentication-factory.mechanism-configurations.pre-realm-principal-transformer=\u30EC\u30EB\u30E0\u304C\u9078\u629E\u3055\u308C\u308B\u524D\u306B\u9069\u7528\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC
elytron.http-authentication-factory.mechanism-configurations.post-realm-principal-transformer=\u30EC\u30EB\u30E0\u304C\u9078\u629E\u3055\u308C\u305F\u5F8C\u306B\u9069\u7528\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC
elytron.http-authentication-factory.mechanism-configurations.final-principal-transformer=\u3053\u306E\u30E1\u30AB\u30CB\u30BA\u30E0\u30EC\u30EB\u30E0\u306B\u9069\u7528\u3059\u308B\u6700\u7D42\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC
elytron.http-authentication-factory.mechanism-configurations.realm-mapper=\u30E1\u30AB\u30CB\u30BA\u30E0\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30EC\u30EB\u30E0\u30DE\u30C3\u30D1\u30FC
elytron.http-authentication-factory.mechanism-configurations.credential-security-factory=\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u5FC5\u8981\u306A\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u53D6\u5F97\u306B\u4F7F\u7528\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC
elytron.http-authentication-factory.mechanism-configurations.mechanism-realm-configurations=\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u8A8D\u8B58\u3059\u308B\u30EC\u30EB\u30E0\u540D\u306E\u5B9A\u7FA9
elytron.http-authentication-factory.mechanism-configurations.realm-name=\u30E1\u30AB\u30CB\u30BA\u30E0\u306B\u3088\u3063\u3066\u8868\u3055\u308C\u308B\u30EC\u30EB\u30E0\u306E\u540D\u524D
elytron.http-authentication-factory.available-mechanisms=\u3059\u3079\u3066\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u9069\u7528\u5F8C\u306B\u3053\u306E\u8A2D\u5B9A\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A HTTP \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.sasl-authentication-factory=SecurityDomain \u3068 SaslServerFactory \u3068\u306E\u95A2\u9023\u304C\u542B\u307E\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u3002
elytron.sasl-authentication-factory.add=\u65B0\u3057\u3044 sasl-authentication-factory \u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.sasl-authentication-factory.remove=sasl-authentication-factory \u30EA\u30BD\u30FC\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.sasl-authentication-factory.security-domain=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u3068\u95A2\u9023\u3059\u308B SecurityDomain
elytron.sasl-authentication-factory.sasl-server-factory=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u3068\u95A2\u9023\u3059\u308B SaslServerFactory
elytron.sasl-authentication-factory.mechanism-configurations=\u30E1\u30AB\u30CB\u30BA\u30E0\u56FA\u6709\u306E\u8A2D\u5B9A
elytron.sasl-authentication-factory.mechanism-configurations.mechanism-name=\u3053\u306E\u8A2D\u5B9A\u306F\u3001\u6307\u5B9A\u306E\u540D\u524D\u3092\u6301\u3064\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u4F7F\u7528\u3055\u308C\u305F\u5834\u5408\u306E\u307F\u9069\u7528\u3055\u308C\u307E\u3059\u3002\u5C5E\u6027\u304C\u7701\u7565\u3055\u308C\u308B\u3068\u3001\u30E1\u30AB\u30CB\u30BA\u30E0\u540D\u306E\u3044\u305A\u308C\u304B\u306B\u5408\u308F\u305B\u307E\u3059\u3002
elytron.sasl-authentication-factory.mechanism-configurations.host-name=\u3053\u306E\u8A2D\u5B9A\u304C\u9069\u7528\u3055\u308C\u308B\u30DB\u30B9\u30C8\u540D\u3002
elytron.sasl-authentication-factory.mechanism-configurations.protocol=\u3053\u306E\u8A2D\u5B9A\u304C\u9069\u7528\u3055\u308C\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.sasl-authentication-factory.mechanism-configurations.pre-realm-principal-transformer=\u30EC\u30EB\u30E0\u304C\u9078\u629E\u3055\u308C\u308B\u524D\u306B\u9069\u7528\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC
elytron.sasl-authentication-factory.mechanism-configurations.post-realm-principal-transformer=\u30EC\u30EB\u30E0\u304C\u9078\u629E\u3055\u308C\u305F\u5F8C\u306B\u9069\u7528\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC
elytron.sasl-authentication-factory.mechanism-configurations.final-principal-transformer=\u3053\u306E\u30E1\u30AB\u30CB\u30BA\u30E0\u30EC\u30EB\u30E0\u306B\u9069\u7528\u3059\u308B\u6700\u7D42\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC
elytron.sasl-authentication-factory.mechanism-configurations.realm-mapper=\u30E1\u30AB\u30CB\u30BA\u30E0\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30EC\u30EB\u30E0\u30DE\u30C3\u30D1\u30FC
elytron.sasl-authentication-factory.mechanism-configurations.credential-security-factory=\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u5FC5\u8981\u306A\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u53D6\u5F97\u306B\u4F7F\u7528\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC
elytron.sasl-authentication-factory.mechanism-configurations.mechanism-realm-configurations=\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u8A8D\u8B58\u3059\u308B\u30EC\u30EB\u30E0\u540D\u306E\u5B9A\u7FA9
elytron.sasl-authentication-factory.mechanism-configurations.realm-name=\u30E1\u30AB\u30CB\u30BA\u30E0\u306B\u3088\u3063\u3066\u8868\u3055\u308C\u308B\u30EC\u30EB\u30E0\u306E\u540D\u524D
elytron.sasl-authentication-factory.available-mechanisms=\u3059\u3079\u3066\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u9069\u7528\u5F8C\u306B\u3053\u306E\u8A2D\u5B9A\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A SASL \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.security-domain=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u5B9A\u7FA9\u3002
elytron.security-domain.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u5B9A\u7FA9\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.security-domain.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u5B9A\u7FA9\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.security-domain.read-identity=\u5B58\u5728\u3059\u308B\u5834\u5408\u306B\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u304B\u3089\u8AAD\u307F\u53D6\u308A\u307E\u3059\u3002
elytron.security-domain.read-identity.name=\u8AAD\u307F\u53D6\u308B\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3002
elytron.security-domain.authenticate=\u8A8D\u8A3C\u306E\u30C6\u30B9\u30C8\u306B\u4F7F\u7528\u3059\u308B\u4E00\u6642\u7684\u306A\u64CD\u4F5C\u3002
elytron.security-domain.authenticate.username=\u8A8D\u8A3C\u3067\u7528\u3044\u308B\u30E6\u30FC\u30B6\u30FC\u540D\u3002
elytron.security-domain.authenticate.password=\u6307\u5B9A\u30E6\u30FC\u30B6\u30FC\u540D\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.security-domain.pre-realm-principal-transformer=\u30EC\u30EB\u30E0\u3092\u9078\u629E\u3059\u308B\u524D\u306B\u9069\u7528\u3055\u308C\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.security-domain.post-realm-principal-transformer=\u6307\u5B9A\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u540D\u3067\u30EC\u30EB\u30E0\u304C\u64CD\u4F5C\u3055\u308C\u305F\u5F8C\u306B\u9069\u7528\u3055\u308C\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.security-domain.permission-mapper=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B PermissionMapper \u3078\u306E\u53C2\u7167\u3002
elytron.security-domain.principal-decoder=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B PrincipalDecoder \u3078\u306E\u53C2\u7167\u3002
elytron.security-domain.realm-mapper=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B RealmMapper \u3078\u306E\u53C2\u7167\u3002
elytron.security-domain.role-mapper=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B RoleMapper \u3078\u306E\u53C2\u7167\u3002
elytron.security-domain.security-event-listener=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30A4\u30D9\u30F3\u30C8\u306E\u30EA\u30B9\u30CA\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.security-domain.default-realm=\u3053\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u306B\u3088\u3063\u3066\u542B\u307E\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30EC\u30EB\u30E0\u3002
elytron.security-domain.realms=\u3053\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u306B\u3088\u3063\u3066\u542B\u307E\u308C\u308B\u30EC\u30EB\u30E0\u306E\u30EA\u30B9\u30C8\u3002
elytron.security-domain.realms.realm=\u500B\u5225\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u3078\u306E\u53C2\u7167\u3002
elytron.security-domain.realms.principal-transformer=\u30EC\u30EB\u30E0\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3002
elytron.security-domain.realms.role-decoder=\u30EC\u30EB\u30E0\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B RoleDecoder \u53C2\u7167\u3002
elytron.security-domain.realms.role-mapper=\u30EC\u30EB\u30E0\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B RoleMapper \u53C2\u7167\u3002
elytron.security-domain.trusted-security-domains=\u3053\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u304C\u4FE1\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u306E\u30EA\u30B9\u30C8\u3002
elytron.security-domain.outflow-security-domains=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u304C\u81EA\u52D5\u7684\u306B\u30A2\u30A6\u30C8\u30D5\u30ED\u30FC\u3059\u3079\u304D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u306E\u30EA\u30B9\u30C8\u3002
elytron.security-domain.outflow-anonymous=\u30A2\u30A6\u30C8\u30D5\u30ED\u30FC\u304C\u53EF\u80FD\u3067\u306A\u3044\u5834\u5408\u3001\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u3078\u306E\u30A2\u30A6\u30C8\u30D5\u30ED\u30FC\u3067\u533F\u540D\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u4F7F\u7528\u3057\u307E\u3059\u304B? \u533F\u540D\u3092\u30A2\u30A6\u30C8\u30D5\u30ED\u30FC\u3059\u308B\u3068\u3001\u305D\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u3059\u3067\u306B\u78BA\u7ACB\u3055\u308C\u3066\u3044\u308B\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u3059\u3079\u3066\u6D88\u53BB\u3059\u308B\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002
elytron.aggregate-http-server-mechanism-factory=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304C\u4ED6\u306E http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u96C6\u7D04\u3067\u3042\u308B\u3001http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u5B9A\u7FA9\u3002
elytron.aggregate-http-server-mechanism-factory.add=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.aggregate-http-server-mechanism-factory.remove=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.aggregate-http-server-mechanism-factory.http-server-mechanism-factories=\u96C6\u7D04\u3059\u308B\u53C2\u7167\u3055\u308C\u305F http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3002
elytron.aggregate-http-server-mechanism-factory.available-mechanisms=\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A HTTP \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.configurable-http-server-mechanism-factory=\u5225\u306E HTTP \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u30E9\u30C3\u30D4\u30F3\u30B0\u3057\u3001\u6307\u5B9A\u306E\u8A2D\u5B9A\u3068\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u3092\u9069\u7528\u3059\u308B HTTP \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u5B9A\u7FA9\u3002
elytron.configurable-http-server-mechanism-factory.add=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.configurable-http-server-mechanism-factory.remove=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.configurable-http-server-mechanism-factory.http-server-mechanism-factory=\u30E9\u30C3\u30D4\u30F3\u30B0\u3059\u308B http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3002
elytron.configurable-http-server-mechanism-factory.properties=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u30B3\u30FC\u30EB\u3078\u6E21\u3055\u308C\u308B\u30AB\u30B9\u30BF\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
elytron.configurable-http-server-mechanism-factory.filters=\u540D\u524D\u3092\u57FA\u306B\u3057\u305F\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u6709\u52B9\u5316/\u7121\u52B9\u5316\u306B\u9069\u7528\u3055\u308C\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
elytron.configurable-http-server-mechanism-factory.filters.pattern-filter=\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u57FA\u306B\u3057\u305F\u6B63\u898F\u8868\u73FE\u30D1\u30BF\u30FC\u30F3\u3002
elytron.configurable-http-server-mechanism-factory.filters.enabling=\u4E00\u81F4\u3059\u308B\u5834\u5408\u306B\u3053\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u304C\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u6709\u52B9\u307E\u305F\u306F\u7121\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B\u3002
elytron.configurable-http-server-mechanism-factory.available-mechanisms=\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A HTTP \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.provider-http-server-mechanism-factory=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304C\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC [] \u304B\u3089\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u96C6\u7D04\u3067\u3042\u308B http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u5B9A\u7FA9
elytron.provider-http-server-mechanism-factory.add=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.provider-http-server-mechanism-factory.remove=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.provider-http-server-mechanism-factory.providers=\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u5834\u6240\u3092\u898B\u3064\u3051\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u306F\u30B0\u30ED\u30FC\u30D0\u30EB\u306B\u767B\u9332\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30EA\u30B9\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.provider-http-server-mechanism-factory.available-mechanisms=\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A HTTP \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.service-loader-http-server-mechanism-factory=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304C ServiceLoader \u3092\u4F7F\u7528\u3057\u3066\u7279\u5B9A\u3055\u308C\u308B\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u96C6\u7D04\u3067\u3042\u308B http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u5B9A\u7FA9
elytron.service-loader-http-server-mechanism-factory.add=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.service-loader-http-server-mechanism-factory.remove=http \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.service-loader-http-server-mechanism-factory.module=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u3092\u53D6\u5F97\u3057\u3001\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u3092\u30ED\u30FC\u30C9\u3059\u308B\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u304C\u4EE3\u308F\u308A\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.service-loader-http-server-mechanism-factory.available-mechanisms=\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A HTTP \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.custom-credential-security-factory=\u30AB\u30B9\u30BF\u30E0\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E SecurityFactory \u5B9A\u7FA9\u3002
elytron.custom-credential-security-factory.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.custom-credential-security-factory.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.custom-credential-security-factory.module=\u30AB\u30B9\u30BF\u30E0\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
elytron.custom-credential-security-factory.class-name=\u30AB\u30B9\u30BF\u30E0\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u5B9F\u88C5\u306E\u30AF\u30E9\u30B9\u540D\u3002
elytron.custom-credential-security-factory.configuration=\u30AB\u30B9\u30BF\u30E0\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A\u3002
elytron.kerberos-security-factory=\u8A8D\u8A3C\u4E2D\u306B\u4F7F\u7528\u3059\u308B GSSCredential \u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3002
elytron.kerberos-security-factory.add=Kerberos SecurityFactory \u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.kerberos-security-factory.remove=Kerberos SecurityFactory \u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.kerberos-security-factory.principal=KeyTab \u306B\u3088\u3063\u3066\u8868\u3055\u308C\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB
elytron.kerberos-security-factory.path=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306B\u30ED\u30FC\u30C9\u3059\u308B KeyTab \u306E\u30D1\u30B9\u3002
elytron.kerberos-security-factory.relative-to=\u4ED6\u306E\u4EE5\u524D\u547D\u540D\u3055\u308C\u305F\u30D1\u30B9\u306E\u540D\u524D\u3001\u307E\u305F\u306F\u30B7\u30B9\u30C6\u30E0\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u305F\u6A19\u6E96\u30D1\u30B9\u306E 1 \u3064\u306E\u540D\u524D\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u308B\u3068\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u306B\u3088\u3063\u3066\u6307\u5B9A\u3055\u308C\u308B\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
elytron.kerberos-security-factory.minimum-remaining-lifetime=\u30AD\u30E3\u30C3\u30B7\u30E5\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u6B8B\u308A\u306E\u5B58\u7D9A\u671F\u9593 (\u79D2\u5358\u4F4D)\u3002\u3053\u306E\u5B58\u7D9A\u6642\u9593\u3092\u904E\u304E\u308B\u3068\u30AD\u30E3\u30C3\u30B7\u30E5\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306F\u518D\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002
elytron.kerberos-security-factory.request-lifetime=\u65B0\u898F\u4F5C\u6210\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306B\u8981\u6C42\u3059\u308B\u5B58\u7D9A\u671F\u9593 (\u79D2\u5358\u4F4D)\u3002
elytron.kerberos-security-factory.server=\u30B5\u30FC\u30D0\u30FC\u5074\u307E\u305F\u306F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5074\u3092\u4F7F\u7528\u3059\u308B\u304B\u3002
elytron.kerberos-security-factory.obtain-kerberos-ticket=KerberosTicket \u3082\u53D6\u5F97\u3055\u308C\u3001\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B\u304B\u3069\u3046\u304B\u3002\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u304C\u30B5\u30FC\u30D0\u30FC\u306B\u59D4\u8B72\u3055\u308C\u308B\u5834\u5408\u3001true \u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
elytron.kerberos-security-factory.debug=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u53D6\u5F97\u3059\u308B JAAS \u30B9\u30C6\u30C3\u30D7\u306B\u30C7\u30D0\u30C3\u30B0\u30ED\u30AE\u30F3\u30B0\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u3002
elytron.kerberos-security-factory.wrap-gss-credential=\u4E0D\u9069\u5207\u306A\u5EC3\u68C4\u3092\u9632\u3050\u305F\u3081\u751F\u6210\u3055\u308C\u305F GSS \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u304C\u30E9\u30C3\u30D7\u3055\u308C\u308B\u304B\u3069\u3046\u304B\u3002
elytron.kerberos-security-factory.required=\u30B5\u30FC\u30D3\u30B9\u306E\u958B\u59CB\u6642\u306B\u5341\u5206\u306A\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3092\u6301\u3064 keytab \u30D5\u30A1\u30A4\u30EB\u304C\u5B58\u5728\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u304B\u3069\u3046\u304B\u3002
elytron.kerberos-security-factory.mechanism-names=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u304C\u4F7F\u7528\u53EF\u80FD\u306A\u30E1\u30AB\u30CB\u30BA\u30E0\u540D\u3002\u540D\u524D\u306F OID \u306B\u5909\u63DB\u3055\u308C\u3001mechanism-oids \u5C5E\u6027\u306E OID \u3068\u3068\u3082\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.kerberos-security-factory.mechanism-oids=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u304C\u4F7F\u7528\u53EF\u80FD\u306A\u30E1\u30AB\u30CB\u30BA\u30E0 OID\u3002mechanism-names \u5C5E\u6027\u306E\u540D\u524D\u304B\u3089\u6D3E\u751F\u3057\u305F OID \u3068\u3068\u3082\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.kerberos-security-factory.options=Krb5LoginModule \u306E\u8FFD\u52A0\u30AA\u30D7\u30B7\u30E7\u30F3\u3002
elytron.custom-permission-mapper=\u30AB\u30B9\u30BF\u30E0\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u5B9A\u7FA9\u3002
elytron.custom-permission-mapper.add=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.custom-permission-mapper.remove=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C
elytron.custom-permission-mapper.module=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D
elytron.custom-permission-mapper.class-name=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D
elytron.custom-permission-mapper.configuration=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A
elytron.logical-permission-mapper=\u8AD6\u7406\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u5B9A\u7FA9\u3002
elytron.logical-permission-mapper.add=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.logical-permission-mapper.remove=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.logical-permission-mapper.logical-operation=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u7D44\u307F\u5408\u308F\u305B\u306B\u4F7F\u7528\u3059\u308B\u8AD6\u7406\u64CD\u4F5C\u3002
elytron.logical-permission-mapper.left=\u64CD\u4F5C\u306E\u5DE6\u306B\u4F7F\u7528\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.logical-permission-mapper.right=\u64CD\u4F5C\u306E\u53F3\u306B\u4F7F\u7528\u3059\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.simple-permission-mapper=\u7C21\u5358\u306B\u8A2D\u5B9A\u3055\u308C\u305F\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u5B9A\u7FA9\u3002
elytron.simple-permission-mapper.add=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.simple-permission-mapper.remove=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C
elytron.simple-permission-mapper.mapping-mode=\u8907\u6570\u4E00\u81F4\u3057\u305F\u5834\u5408\u306B\u4F7F\u7528\u3055\u308C\u308B\u30DE\u30C3\u30D4\u30F3\u30B0\u30E2\u30FC\u30C9\u3002
elytron.simple-permission-mapper.permission-mappings=\u5B9A\u7FA9\u3055\u308C\u305F\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D4\u30F3\u30B0\u3002
elytron.simple-permission-mapper.permission-mappings.match-all=\u3059\u3079\u3066\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306B\u9069\u7528\u3055\u308C\u308B\u30DE\u30C3\u30D4\u30F3\u30B0\u3002
elytron.simple-permission-mapper.permission-mappings.principals=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30DE\u30C3\u30D4\u30F3\u30B0\u3059\u308B\u3068\u304D\u306B\u6BD4\u8F03\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3002\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u304C\u30EA\u30B9\u30C8\u306E\u3044\u305A\u308C\u304B\u3068\u4E00\u81F4\u3059\u308B\u5834\u5408\u306B\u4E00\u81F4\u3068\u307F\u306A\u3055\u308C\u307E\u3059\u3002
elytron.simple-permission-mapper.permission-mappings.roles=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3092\u30DE\u30C3\u30D4\u30F3\u30B0\u3059\u308B\u3068\u304D\u306B\u6BD4\u8F03\u3059\u308B\u30EB\u30FC\u30EB\u3002\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u304C\u30EA\u30B9\u30C8\u306E\u3044\u305A\u308C\u304B\u306E\u30E1\u30F3\u30D0\u30FC\u3067\u3042\u308B\u5834\u5408\u306B\u4E00\u81F4\u3068\u307F\u306A\u3055\u308C\u307E\u3059\u3002
elytron.simple-permission-mapper.permission-mappings.permissions=\u4E00\u81F4\u306E\u5834\u5408\u306B\u5272\u308A\u5F53\u3066\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3002
elytron.simple-permission-mapper.permission-mappings.class-name=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D\u3002
elytron.simple-permission-mapper.permission-mappings.module=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
elytron.simple-permission-mapper.permission-mappings.target-name=\u69CB\u7BC9\u6642\u306B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306B\u6E21\u3059\u30BF\u30FC\u30B2\u30C3\u30C8\u540D\u3002
elytron.simple-permission-mapper.permission-mappings.action=\u69CB\u7BC9\u6642\u306B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306B\u6E21\u3059\u30A2\u30AF\u30B7\u30E7\u30F3\u3002
elytron.constant-permission-mapper=\u540C\u3058\u5B9A\u6570\u3092\u5E38\u306B\u8FD4\u3059\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u5B9A\u7FA9\u3002
elytron.constant-permission-mapper.add=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.constant-permission-mapper.remove=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C
elytron.constant-permission-mapper.permissions=\u5272\u308A\u5F53\u3066\u308B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u3002
elytron.constant-permission-mapper.permissions.class-name=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D\u3002
elytron.constant-permission-mapper.permissions.module=\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
elytron.constant-permission-mapper.permissions.target-name=\u69CB\u7BC9\u6642\u306B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306B\u6E21\u3059\u30BF\u30FC\u30B2\u30C3\u30C8\u540D\u3002
elytron.constant-permission-mapper.permissions.action=\u69CB\u7BC9\u6642\u306B\u30D1\u30FC\u30DF\u30C3\u30B7\u30E7\u30F3\u306B\u6E21\u3059\u30A2\u30AF\u30B7\u30E7\u30F3\u3002
elytron.aggregate-principal-decoder=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u304C\u4ED6\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u96C6\u7D04\u3067\u3042\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u5B9A\u7FA9\u3002
elytron.aggregate-principal-decoder.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.aggregate-principal-decoder.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.aggregate-principal-decoder.principal-decoders=\u96C6\u7D04\u3059\u308B\u53C2\u7167\u3055\u308C\u305F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u3002
elytron.concatenating-principal-decoder=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u304C\u4ED6\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u9023\u7D50\u3067\u3042\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u5B9A\u7FA9\u3002
elytron.concatenating-principal-decoder.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.concatenating-principal-decoder.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.concatenating-principal-decoder.joiner=\u53C2\u7167\u3055\u308C\u305F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u7D50\u679C\u3092\u7D50\u5408\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3059\u308B\u6587\u5B57\u5217\u3002
elytron.concatenating-principal-decoder.principal-decoders=\u9023\u7D50\u3059\u308B\u53C2\u7167\u3055\u308C\u305F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u3002
elytron.constant-principal-decoder=\u5E38\u306B\u540C\u3058\u5B9A\u6570\u3092\u8FD4\u3059\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u5B9A\u7FA9\u3002
elytron.constant-principal-decoder.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.constant-principal-decoder.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.constant-principal-decoder.constant=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u304C\u5E38\u306B\u8FD4\u3059\u5B9A\u6570\u5024\u3002
elytron.custom-principal-decoder=\u30AB\u30B9\u30BF\u30E0\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u5B9A\u7FA9
elytron.custom-principal-decoder.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.custom-principal-decoder.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u524A\u9664\u64CD\u4F5C
elytron.custom-principal-decoder.module=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D
elytron.custom-principal-decoder.class-name=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D
elytron.custom-principal-decoder.configuration=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A
elytron.x500-attribute-principal-decoder=X.500 \u5C5E\u6027\u30D9\u30FC\u30B9\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u5B9A\u7FA9
elytron.x500-attribute-principal-decoder.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.x500-attribute-principal-decoder.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C7\u30B3\u30FC\u30C0\u30FC\u306E\u524A\u9664\u64CD\u4F5C
elytron.x500-attribute-principal-decoder.oid=\u30DE\u30C3\u30D7\u3059\u308B X.500 \u5C5E\u6027\u306E OID (\u4EE3\u308F\u308A\u306B\u5C5E\u6027\u540D\u3092\u4F7F\u7528\u3057\u3066\u5B9A\u7FA9\u3067\u304D\u307E\u3059)
elytron.x500-attribute-principal-decoder.attribute-name=\u30DE\u30C3\u30D7\u3059\u308B X.500 \u5C5E\u6027\u306E\u540D\u524D (\u4EE3\u308F\u308A\u306B OID \u3092\u4F7F\u7528\u3057\u3066\u5B9A\u7FA9\u3067\u304D\u307E\u3059)
elytron.x500-attribute-principal-decoder.joiner=\u7D50\u5408\u3059\u308B\u6587\u5B57\u5217
elytron.x500-attribute-principal-decoder.start-segment=\u30DE\u30C3\u30D7\u3059\u308B\u5C5E\u6027\u306E 0 \u30D9\u30FC\u30B9\u958B\u59CB\u306E\u767A\u751F
elytron.x500-attribute-principal-decoder.maximum-segments=\u30DE\u30C3\u30D7\u3059\u308B\u5C5E\u6027\u306E\u6700\u5927\u767A\u751F\u56DE\u6570
elytron.x500-attribute-principal-decoder.reverse='true' \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u5C5E\u6027\u306E\u5024\u304C\u51E6\u7406\u3055\u308C\u3066\u9006\u9806\u3067\u8FD4\u3055\u308C\u307E\u3059
elytron.x500-attribute-principal-decoder.convert='true' \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u304C X500Principal \u3067\u306A\u3044\u5834\u5408\u306B\u5909\u63DB\u304C\u8A66\u884C\u3055\u308C\u307E\u3059
elytron.x500-attribute-principal-decoder.required-oids=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306B\u5B58\u5728\u3057\u306A\u3051\u308C\u3070\u306A\u3089\u306A\u3044\u5C5E\u6027\u306E OID
elytron.x500-attribute-principal-decoder.required-attributes=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306B\u5B58\u5728\u3057\u306A\u3051\u308C\u3070\u306A\u3089\u306A\u3044\u5C5E\u6027\u306E\u5C5E\u6027\u540D
elytron.aggregate-principal-transformer=\u3055\u3089\u306A\u308B\u30D7\u30EA\u30F3\u30B7\u30D7\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3092\u96C6\u7D04\u3057\u3066\u3044\u308B\u30D7\u30EA\u30F3\u30B7\u30D7\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3002\u3042\u308B\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u304C null \u3067\u306A\u3044\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3092\u8FD4\u3059\u307E\u3067\u5143\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306F\u500B\u5225\u306E\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306B\u3088\u308B\u5909\u63DB\u3092\u8A66\u307F\u307E\u3059\u3002
elytron.aggregate-principal-transformer.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.aggregate-principal-transformer.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.aggregate-principal-transformer.principal-transformers=\u96C6\u7D04\u3059\u308B\u53C2\u7167\u3055\u308C\u305F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3002
elytron.chained-principal-transformer=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u304C\u4ED6\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3092\u30C1\u30A7\u30FC\u30F3\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u5B9A\u7FA9\u3002
elytron.chained-principal-transformer.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.chained-principal-transformer.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.chained-principal-transformer.principal-transformers=\u30C1\u30A7\u30FC\u30F3\u3059\u308B\u53C2\u7167\u3055\u308C\u305F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3002
elytron.constant-principal-transformer=\u5E38\u306B\u540C\u3058\u5B9A\u6570\u3092\u8FD4\u3059 PrincipalTransformer \u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u5B9A\u7FA9\u3002
elytron.constant-principal-transformer.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.constant-principal-transformer.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.constant-principal-transformer.constant=PrincipalTransformer \u304C\u5E38\u306B\u8FD4\u3059\u5B9A\u6570\u5024\u3002
elytron.custom-principal-transformer=\u30AB\u30B9\u30BF\u30E0\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u5B9A\u7FA9\u3002
elytron.custom-principal-transformer.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.custom-principal-transformer.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.custom-principal-transformer.module=\u30AB\u30B9\u30BF\u30E0\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
elytron.custom-principal-transformer.class-name=\u30AB\u30B9\u30BF\u30E0\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u5B9F\u88C5\u306E\u30AF\u30E9\u30B9\u540D\u3002
elytron.custom-principal-transformer.configuration=\u30AB\u30B9\u30BF\u30E0\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A\u3002
elytron.regex-principal-transformer=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3092\u57FA\u306B\u3057\u305F\u6B63\u898F\u8868\u73FE
elytron.regex-principal-transformer.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.regex-principal-transformer.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.regex-principal-transformer.pattern=\u7F6E\u304D\u63DB\u3048\u308B\u540D\u524D\u306E\u4E00\u90E8\u306E\u5834\u6240\u3092\u7279\u5B9A\u3059\u308B\u306E\u306B\u4F7F\u7528\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002
elytron.regex-principal-transformer.replacement=\u4EE3\u66FF\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u308B\u5024\u3002
elytron.regex-principal-transformer.replace-all=\u4E00\u81F4\u3057\u305F\u30D1\u30BF\u30FC\u30F3\u3092\u3059\u3079\u3066\u7F6E\u304D\u63DB\u3048\u308B\u304B\u3001\u307E\u305F\u306F\u6700\u521D\u306B\u767A\u751F\u3057\u305F\u30D1\u30BF\u30FC\u30F3\u306E\u307F\u3092\u7F6E\u304D\u63DB\u3048\u308B\u304B\u3002
elytron.regex-validating-principal-transformer=\u6B63\u898F\u8868\u73FE\u3092\u4F7F\u7528\u3057\u3066\u540D\u524D\u3092\u691C\u8A3C\u3059\u308B\u3001\u6B63\u898F\u8868\u73FE\u3092\u30D9\u30FC\u30B9\u3068\u3057\u305F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3002
elytron.regex-validating-principal-transformer.add=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.regex-validating-principal-transformer.remove=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.regex-validating-principal-transformer.pattern=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u306B\u4F7F\u7528\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002
elytron.regex-validating-principal-transformer.match=true \u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u3001\u540D\u524D\u304C\u6307\u5B9A\u306E\u30D1\u30BF\u30FC\u30F3\u306B\u4E00\u81F4\u3057\u306A\u3044\u3068\u691C\u8A3C\u306B\u6210\u529F\u3057\u307E\u305B\u3093\u3002false \u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u3001\u540D\u524D\u304C\u6307\u5B9A\u306E\u30D1\u30BF\u30FC\u30F3\u306B\u4E00\u81F4\u3057\u306A\u3044\u3068\u304D\u306E\u307F\u691C\u8A3C\u306B\u6210\u529F\u3057\u307E\u3059\u3002
elytron.constant-realm-mapper=\u5E38\u306B\u540C\u3058\u5024\u3092\u8FD4\u3059\u5B9A\u6570 RealmMapper \u306E\u5B9A\u7FA9\u3002
elytron.constant-realm-mapper.add=RealmMapper \u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.constant-realm-mapper.remove=RealmMapper \u524A\u9664\u64CD\u4F5C
elytron.constant-realm-mapper.realm-name=\u8FD4\u3059\u5B9A\u6570\u30EC\u30EB\u30E0\u306E\u540D\u524D\u3002
elytron.custom-realm-mapper=\u30AB\u30B9\u30BF\u30E0 RealmMapper \u306E\u5B9A\u7FA9
elytron.custom-realm-mapper.add=RealmMapper \u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.custom-realm-mapper.remove=RealmMapper \u524A\u9664\u64CD\u4F5C
elytron.custom-realm-mapper.module=RealmMapper \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D
elytron.custom-realm-mapper.class-name=RealmMapper \u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D
elytron.custom-realm-mapper.configuration=RealmMapper \u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A
elytron.simple-regex-realm-mapper=\u6B63\u898F\u8868\u73FE\u304B\u3089\u306E\u30AD\u30E3\u30D7\u30C1\u30E3\u30FC\u30B0\u30EB\u30FC\u30D7\u3092\u4F7F\u7528\u3057\u3066\u30EC\u30EB\u30E0\u540D\u306E\u62BD\u51FA\u3092\u8A66\u307F\u308B\u7C21\u5358\u306A RealmMapper \u306E\u5B9A\u7FA9\u3002\u4E00\u81F4\u3059\u308B\u3082\u306E\u3092\u63D0\u4F9B\u3057\u306A\u3044\u5834\u5408\u3001\u4EE3\u308F\u308A\u306B\u59D4\u8B72 RealmMapper \u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.simple-regex-realm-mapper.add=RealmMapper \u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.simple-regex-realm-mapper.remove=RealmMapper \u524A\u9664\u64CD\u4F5C
elytron.simple-regex-realm-mapper.pattern=\u540D\u524D\u304B\u3089\u30EC\u30EB\u30E0\u3092\u62BD\u51FA\u3059\u308B\u305F\u3081\u306B 1 \u3064\u4EE5\u4E0A\u306E\u30AD\u30E3\u30D7\u30C1\u30E3\u30FC\u30B0\u30EB\u30FC\u30D7\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u5FC5\u8981\u306E\u3042\u308B\u6B63\u898F\u8868\u73FE\u3002\u6B63\u898F\u8868\u73FE\u304C\u8907\u6570\u306E\u30AD\u30E3\u30D7\u30C1\u30E3\u30FC\u30B0\u30EB\u30FC\u30D7\u3068\u4E00\u81F4\u3059\u308B\u5834\u5408\u3001\u6700\u521D\u306E\u30AD\u30E3\u30D7\u30C1\u30E3\u30FC\u30B0\u30EB\u30FC\u30D7\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.simple-regex-realm-mapper.delegate-realm-mapper=\u30D1\u30BF\u30FC\u30F3\u3092\u4F7F\u7528\u3057\u3066\u4E00\u81F4\u3057\u306A\u3044\u5834\u5408\u306B\u59D4\u8B72\u3059\u308B RealmMapper \u3002
elytron.mapped-regex-realm-mapper=\u6700\u521D\u306B\u6B63\u898F\u8868\u73FE\u3092\u4F7F\u7528\u3057\u3066\u30EC\u30EB\u30E0\u540D\u3092\u62BD\u51FA\u3057\u305F\u5F8C\u306B\u30EC\u30EB\u30E0\u540D\u306E\u8A2D\u5B9A\u6E08\u307F\u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u4F7F\u7528\u3057\u3066\u5909\u63DB\u3055\u308C\u308B RealmMapper \u5B9F\u88C5\u306E\u5B9A\u7FA9\u3002
elytron.mapped-regex-realm-mapper.add=RealmMapper \u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.mapped-regex-realm-mapper.remove=RealmMapper \u524A\u9664\u64CD\u4F5C
elytron.mapped-regex-realm-mapper.pattern=\u540D\u524D\u304B\u3089\u30EC\u30EB\u30E0\u3092\u62BD\u51FA\u3059\u308B\u305F\u3081\u306B 1 \u3064\u4EE5\u4E0A\u306E\u30AD\u30E3\u30D7\u30C1\u30E3\u30FC\u30B0\u30EB\u30FC\u30D7\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u5FC5\u8981\u306E\u3042\u308B\u6B63\u898F\u8868\u73FE\u3002\u6B63\u898F\u8868\u73FE\u304C\u8907\u6570\u306E\u30AD\u30E3\u30D7\u30C1\u30E3\u30FC\u30B0\u30EB\u30FC\u30D7\u3068\u4E00\u81F4\u3059\u308B\u5834\u5408\u3001\u6700\u521D\u306E\u30AD\u30E3\u30D7\u30C1\u30E3\u30FC\u30B0\u30EB\u30FC\u30D7\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.mapped-regex-realm-mapper.delegate-realm-mapper=\u30D1\u30BF\u30FC\u30F3\u306B\u4E00\u81F4\u3057\u306A\u3044\u5834\u5408\u306B\u59D4\u8B72\u3059\u308B RealmMapper\u3002\u59D4\u8B72\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u4EE3\u308F\u308A\u306B\u30C9\u30E1\u30A4\u30F3\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u30EC\u30EB\u30E0\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u30E6\u30FC\u30B6\u30FC\u540D\u304C\u30D1\u30BF\u30FC\u30F3\u3068\u4E00\u81F4\u305B\u305A\u3001\u59D4\u8B72\u306E realm-mapper \u304C\u5B58\u5728\u3059\u308B\u5834\u5408\u3001delegate-realm-mapper \u306E\u7D50\u679C\u306F realm-mapper \u3092\u7D4C\u7531\u3057\u3066\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u307E\u3059\u3002
elytron.mapped-regex-realm-mapper.realm-map=\u6B63\u898F\u8868\u73FE\u3092\u4F7F\u7528\u3057\u3066\u62BD\u51FA\u3055\u308C\u305F\u30EC\u30EB\u30E0\u540D\u304B\u3089\u5B9A\u7FA9\u3055\u308C\u305F\u30EC\u30EB\u30E0\u540D\u3078\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3002\u30DE\u30C3\u30D4\u30F3\u30B0\u306E\u5024\u304C\u30DE\u30C3\u30D7\u306B\u306A\u3044\u5834\u5408\u3084\u540D\u524D\u304C\u30DE\u30C3\u30D4\u30F3\u30B0\u306E\u7D50\u679C\u3067\u3042\u308B\u30EC\u30EB\u30E0\u304C\u6307\u5B9A\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u306B\u5B58\u5728\u3057\u306A\u3044\u5834\u5408\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30EC\u30EB\u30E0\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.custom-role-decoder=\u30AB\u30B9\u30BF\u30E0 RoleDecoder \u306E\u5B9A\u7FA9
elytron.custom-role-decoder.add=RoleDecoder \u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.custom-role-decoder.remove=RoleDecoder \u306E\u524A\u9664\u64CD\u4F5C
elytron.custom-role-decoder.module=RoleDecoder \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D
elytron.custom-role-decoder.class-name=RoleDecoder \u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D
elytron.custom-role-decoder.configuration=RoleDecoder \u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A
elytron.empty-role-decoder=\u30EB\u30FC\u30EB\u3092\u5168\u304F\u8FD4\u3055\u306A\u3044\u7A7A\u306E RoleDecoder \u306E\u5B9A\u7FA9\u3002
elytron.empty-role-decoder.add=RoleDecoder \u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.empty-role-decoder.remove=RoleDecoder \u306E\u524A\u9664\u64CD\u4F5C
elytron.simple-role-decoder=\u5358\u4E00\u306E\u5C5E\u6027\u3092\u53D6\u308A\u3001\u305D\u308C\u3092\u76F4\u63A5\u30ED\u30FC\u30EB\u3078\u30DE\u30C3\u30D7\u3059\u308B\u7C21\u5358\u306A RoleDecoder \u306E\u5B9A\u7FA9\u3002
elytron.simple-role-decoder.add=RoleDecoder \u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.simple-role-decoder.remove=RoleDecoder \u306E\u524A\u9664\u64CD\u4F5C
elytron.simple-role-decoder.attribute=\u76F4\u63A5\u30ED\u30FC\u30EB\u3078\u30DE\u30C3\u30D7\u3059\u308B\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u304B\u3089\u306E\u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.add-prefix-role-mapper=\u63A5\u982D\u8F9E\u3092\u8FFD\u52A0\u3059\u308B\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u5B9A\u7FA9\u3002
elytron.add-prefix-role-mapper.add=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.add-prefix-role-mapper.remove=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.add-prefix-role-mapper.prefix=\u5404\u30ED\u30FC\u30EB\u306B\u8FFD\u52A0\u3059\u308B\u63A5\u982D\u8F9E\u3002
elytron.add-suffix-role-mapper=\u63A5\u5C3E\u8F9E\u3092\u8FFD\u52A0\u3059\u308B\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u5B9A\u7FA9\u3002
elytron.add-suffix-role-mapper.add=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.add-suffix-role-mapper.remove=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.add-suffix-role-mapper.suffix=\u5404\u30ED\u30FC\u30EB\u306B\u8FFD\u52A0\u3059\u308B\u63A5\u5C3E\u8F9E\u3002
elytron.aggregate-role-mapper=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u304C\u4ED6\u306E\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u96C6\u7D04\u3067\u3042\u308B\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u5B9A\u7FA9\u3002
elytron.aggregate-role-mapper.add=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.aggregate-role-mapper.remove=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.aggregate-role-mapper.role-mappers=\u96C6\u7D04\u3059\u308B\u53C2\u7167\u3055\u308C\u305F\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u3002
elytron.constant-role-mapper=\u30ED\u30FC\u30EB\u306E\u5B9A\u6570\u30BB\u30C3\u30C8\u304C\u5E38\u306B\u8FD4\u3055\u308C\u308B\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u5B9A\u7FA9\u3002
elytron.constant-role-mapper.add=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.constant-role-mapper.remove=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.constant-role-mapper.roles=\u3053\u306E\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306B\u3088\u3063\u3066\u8FD4\u3055\u308C\u308B\u5B9A\u6570\u30ED\u30FC\u30EB\u3002
elytron.custom-role-mapper=\u30AB\u30B9\u30BF\u30E0 RoleMapper \u306E\u5B9A\u7FA9
elytron.custom-role-mapper.add=RoleMapper \u306E\u8FFD\u52A0\u64CD\u4F5C
elytron.custom-role-mapper.remove=RoleMapper \u306E\u524A\u9664\u64CD\u4F5C
elytron.custom-role-mapper.module=RoleMapper \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D
elytron.custom-role-mapper.class-name=RoleMapper \u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D
elytron.custom-role-mapper.configuration=RoleMapper \u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A
elytron.logical-role-mapper=\u53C2\u7167\u3055\u308C\u305F 2 \u3064\u306E RoleMapper \u3092\u4F7F\u7528\u3057\u3066\u8AD6\u7406\u64CD\u4F5C\u3092\u5B9F\u884C\u3059\u308B RoleMapper \u306E RoleMapper \u5B9A\u7FA9\u3002
elytron.logical-role-mapper.add=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.logical-role-mapper.remove=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.logical-role-mapper.logical-operation=\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u30DE\u30C3\u30D4\u30F3\u30B0\u4E0A\u3067\u5B9F\u884C\u3055\u308C\u308B\u8AD6\u7406\u64CD\u4F5C\u3002
elytron.logical-role-mapper.left=\u64CD\u4F5C\u306E\u5DE6\u5074\u3067\u4F7F\u7528\u3055\u308C\u308B\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.logical-role-mapper.right=\u64CD\u4F5C\u306E\u53F3\u5074\u3067\u4F7F\u7528\u3055\u308C\u308B\u30ED\u30FC\u30EB\u30DE\u30C3\u30D1\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.aggregate-realm=2 \u3064\u306E\u30EC\u30EB\u30E0 (\u8A8D\u8A3C\u30B9\u30C6\u30C3\u30D7\u306E\u30EC\u30EB\u30E0\u304A\u3088\u3073\u627F\u8A8D\u30B9\u30C6\u30C3\u30D7\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u30ED\u30FC\u30C9\u3059\u308B\u30EC\u30EB\u30E0) \u306E\u96C6\u7D04\u3067\u3042\u308B\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002
elytron.aggregate-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.aggregate-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.aggregate-realm.authentication-realm=\u8A8D\u8A3C\u30B9\u30C6\u30C3\u30D7 (\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u53D6\u5F97\u307E\u305F\u306F\u691C\u8A3C) \u306B\u4F7F\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u3078\u306E\u53C2\u7167\u3002
elytron.aggregate-realm.authorization-realm=\u627F\u8A8D\u30B9\u30C6\u30C3\u30D7 (\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u30ED\u30FC\u30C9) \u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u3078\u306E\u53C2\u7167\u3002
elytron.custom-modifiable-realm=\u5909\u66F4\u53EF\u80FD\u3068\u3057\u3066\u8A2D\u5B9A\u3055\u308C\u305F\u30AB\u30B9\u30BF\u30E0\u30EC\u30EB\u30E0\u306F\u3001ModifiableSecurityRealm \u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3059\u308B\u3053\u3068\u304C\u60F3\u5B9A\u3055\u308C\u307E\u3059\u3002\u30EC\u30EB\u30E0\u3092\u5909\u66F4\u53EF\u80FD\u3068\u3057\u3066\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u7BA1\u7406\u64CD\u4F5C\u3092\u5229\u7528\u3057\u3066\u30EC\u30EB\u30E0\u3092\u64CD\u4F5C\u3067\u304D\u307E\u3059\u3002
elytron.custom-modifiable-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.custom-modifiable-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.custom-modifiable-realm.class-name=\u30AB\u30B9\u30BF\u30E0\u30EC\u30EB\u30E0\u306E\u5B9F\u88C5\u306E\u30AF\u30E9\u30B9\u540D\u3002
elytron.custom-modifiable-realm.configuration=\u30AB\u30B9\u30BF\u30E0\u30EC\u30EB\u30E0\u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A\u3002
elytron.custom-modifiable-realm.identity=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306B\u3088\u308B\u7BA1\u7406\u304C\u53EF\u80FD\u306A\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3002
elytron.custom-modifiable-realm.module=\u30AB\u30B9\u30BF\u30E0\u30EC\u30EB\u30E0\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
elytron.custom-realm=\u30AB\u30B9\u30BF\u30E0\u30EC\u30EB\u30E0\u5B9A\u7FA9\u306F SecurityRealm \u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u307E\u305F\u306F ModifiableSecurityRealm \u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3067\u304D\u307E\u3059\u3002\u3069\u3061\u3089\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u5B9F\u88C5\u3055\u308C\u305F\u304B\u306B\u95A2\u308F\u3089\u305A\u3001\u30EC\u30EB\u30E0\u306E\u7BA1\u7406\u306B\u7BA1\u7406\u64CD\u4F5C\u306F\u516C\u958B\u3055\u308C\u307E\u305B\u3093\u3002\u3057\u304B\u3057\u3001\u30EC\u30EB\u30E0\u306B\u4F9D\u5B58\u3059\u308B\u305D\u306E\u4ED6\u306E\u30B5\u30FC\u30D3\u30B9\u306F\u578B\u30C1\u30A7\u30C3\u30AF\u3084\u30AD\u30E3\u30B9\u30C8\u3092\u5B9F\u884C\u3057\u3066\u5909\u66F4 API \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u3059\u3002
elytron.custom-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.custom-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.custom-realm.module=\u30AB\u30B9\u30BF\u30E0\u30EC\u30EB\u30E0\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
elytron.custom-realm.class-name=\u30AB\u30B9\u30BF\u30E0\u30EC\u30EB\u30E0\u306E\u5B9F\u88C5\u306E\u30AF\u30E9\u30B9\u540D\u3002
elytron.custom-realm.configuration=\u30AB\u30B9\u30BF\u30E0\u30EC\u30EB\u30E0\u306E\u4EFB\u610F\u306E\u30AD\u30FC\u30D0\u30EA\u30E5\u30FC\u8A2D\u5B9A\u3002
elytron.jdbc-realm=JDBC \u3092\u4F7F\u7528\u3057\u3066\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u3088\u3063\u3066\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002
elytron.jdbc-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.jdbc-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.jdbc-realm.principal-query=\u7279\u5B9A\u306E\u30AD\u30FC\u578B\u3092\u57FA\u306B\u30E6\u30FC\u30B6\u30FC\u306B\u8A8D\u8A3C\u306B\u4F7F\u7528\u3055\u308C\u305F\u8A8D\u8A3C\u30AF\u30A8\u30EA\u30FC\u3002
elytron.jdbc-realm.principal-query.sql=\u7279\u5B9A\u30E6\u30FC\u30B6\u30FC\u306E\u30AD\u30FC (\u8868\u306E\u5217\u3068\u3057\u3066) \u3092\u53D6\u5F97\u3057\u3001\u305D\u308C\u3089\u306E\u578B\u306B\u5FDC\u3058\u3066\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B SQL \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3002
elytron.jdbc-realm.principal-query.data-source=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3078\u306E\u63A5\u7D9A\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306E\u540D\u524D\u3002
elytron.jdbc-realm.principal-query.algorithm=\u7279\u5B9A\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u30AD\u30FC\u30DE\u30C3\u30D1\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.jdbc-realm.principal-query.password-index=\u30E6\u30FC\u30B6\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u8868\u3059\u8A8D\u8A3C\u30AF\u30A8\u30EA\u30FC\u306E\u5217\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u3002
elytron.jdbc-realm.principal-query.salt-index=\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u5834\u5408\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u306E salt \u3092\u8868\u3059\u8A8D\u8A3C\u30AF\u30A8\u30EA\u30FC\u304B\u3089\u306E\u5217\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u3002
elytron.jdbc-realm.principal-query.iteration-count-index=\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u5834\u5408\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u30A4\u30C6\u30EC\u30FC\u30B7\u30E7\u30F3\u6570\u3092\u8868\u3059\u8A8D\u8A3C\u30AF\u30A8\u30EA\u30FC\u304B\u3089\u306E\u5217\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u3002
elytron.jdbc-realm.principal-query.clear-password-mapper=SQL \u30AF\u30A8\u30EA\u30FC\u304B\u3089\u8FD4\u3055\u308C\u305F\u5217\u3092 Clear Password \u30AD\u30FC\u578B\u306B\u30DE\u30C3\u30D7\u3059\u308B\u30AD\u30FC\u30DE\u30C3\u30D1\u30FC\u3002
elytron.jdbc-realm.principal-query.bcrypt-mapper=SQL \u30AF\u30A8\u30EA\u30FC\u304B\u3089\u8FD4\u3055\u308C\u305F\u5217\u3092 Bcrypt \u30AD\u30FC\u578B\u306B\u30DE\u30C3\u30D7\u3059\u308B\u30AD\u30FC\u30DE\u30C3\u30D1\u30FC\u3002
elytron.jdbc-realm.principal-query.salted-simple-digest-mapper=SQL \u30AF\u30A8\u30EA\u30FC\u304B\u3089\u8FD4\u3055\u308C\u305F\u5217\u3092 Salted Simple Digest \u30AD\u30FC\u578B\u306B\u30DE\u30C3\u30D7\u3059\u308B\u30AD\u30FC\u30DE\u30C3\u30D1\u30FC\u3002
elytron.jdbc-realm.principal-query.simple-digest-mapper=SQL \u30AF\u30A8\u30EA\u30FC\u304B\u3089\u8FD4\u3055\u308C\u305F\u5217\u3092 Simple Digest \u30AD\u30FC\u578B\u306B\u30DE\u30C3\u30D7\u3059\u308B\u30AD\u30FC\u30DE\u30C3\u30D1\u30FC\u3002
elytron.jdbc-realm.principal-query.scram-mapper=SQL \u30AF\u30A8\u30EA\u30FC\u304B\u3089\u8FD4\u3055\u308C\u305F\u5217\u3092 Scram \u30AD\u30FC\u578B\u306B\u30DE\u30C3\u30D7\u3059\u308B\u30AD\u30FC\u30DE\u30C3\u30D1\u30FC\u3002
elytron.jdbc-realm.principal-query.attribute-mapping=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u5B9A\u7FA9\u3055\u308C\u305F\u5C5E\u6027\u30DE\u30C3\u30D4\u30F3\u30B0\u3002
elytron.jdbc-realm.principal-query.index=\u30DE\u30C3\u30D7\u3055\u308C\u305F\u5C5E\u6027\u3092\u8868\u3059\u30AF\u30A8\u30EA\u30FC\u304B\u3089\u306E\u5217\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u3002
elytron.jdbc-realm.principal-query.to=SQL \u30AF\u30A8\u30EA\u30FC\u304B\u3089\u8FD4\u3055\u308C\u305F\u5217\u304B\u3089\u30DE\u30C3\u30D7\u3055\u308C\u305F\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.identity-realm=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u304C\u7BA1\u7406\u30E2\u30C7\u30EB\u3067\u8868\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002
elytron.identity-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.identity-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.identity-realm.identity=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u304B\u3089\u5229\u7528\u3067\u304D\u308B\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3002
elytron.identity-realm.attribute-name=\u3053\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3068\u95A2\u9023\u3059\u308B\u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.identity-realm.attribute-values=identities \u5C5E\u6027\u3068\u95A2\u9023\u3059\u308B\u5024\u3002
elytron.key-store-realm=\u30AD\u30FC\u30B9\u30C8\u30A2\u306B\u3088\u3063\u3066\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002
elytron.key-store-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.key-store-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.key-store-realm.key-store=\u3053\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u3092\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B KeyStore \u3078\u306E\u53C2\u7167\u3002
elytron.properties-realm=\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30D5\u30A1\u30A4\u30EB\u306B\u3088\u3063\u3066\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002
elytron.properties-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.properties-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.properties-realm.load=\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30D5\u30A1\u30A4\u30EB\u3092\u30EA\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
elytron.properties-realm.users-properties=\u30E6\u30FC\u30B6\u30FC\u3068\u30E6\u30FC\u30B6\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30D5\u30A1\u30A4\u30EB\u3002
elytron.properties-realm.users-properties.path=\u30E6\u30FC\u30B6\u30FC\u3068\u30E6\u30FC\u30B6\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u308B\u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30D1\u30B9\u3002\u30D5\u30A1\u30A4\u30EB\u306B\u306F\u30EC\u30EB\u30E0\u540D\u306E\u5BA3\u8A00\u304C\u542B\u307E\u308C\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
elytron.properties-realm.users-properties.relative-to=\u76F8\u5BFE\u30D1\u30B9\u306E\u8D77\u70B9\u3068\u306A\u308B\u4E8B\u524D\u5B9A\u7FA9\u3055\u308C\u305F\u30D1\u30B9\u3002
elytron.properties-realm.users-properties.digest-realm-name=\u30EC\u30EB\u30E0\u540D\u304C\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30D5\u30A1\u30A4\u30EB\u3067\u898B\u3064\u304B\u3089\u306A\u304B\u3063\u305F\u5834\u5408\u306B\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u5316\u3055\u308C\u305F\u30D1\u30B9\u30EF\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30EC\u30EB\u30E0\u540D\u3002
elytron.properties-realm.users-properties.plain-text=\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u30D7\u30EC\u30FC\u30F3\u30C6\u30AD\u30B9\u30C8\u3067\u4FDD\u5B58\u3055\u308C\u308B\u304B\u307E\u305F\u306F\u4E8B\u524D\u306B\u30CF\u30C3\u30B7\u30E5\u5316\u3055\u308C\u308B\u304B\u3002\u4E8B\u524D\u30CF\u30C3\u30B7\u30E5\u5316\u306E\u5F62\u5F0F\: HEX( MD5( username "\:" realm "\:" password ) ) 
elytron.properties-realm.groups-properties=\u30E6\u30FC\u30B6\u30FC\u3068\u30E6\u30FC\u30B6\u30FC\u306E\u30B0\u30EB\u30FC\u30D7\u304C\u542B\u307E\u308C\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30D5\u30A1\u30A4\u30EB\u3002
elytron.properties-realm.groups-properties.path=\u30E6\u30FC\u30B6\u30FC\u3068\u30E6\u30FC\u30B6\u30FC\u306E\u30B0\u30EB\u30FC\u30D7\u304C\u542B\u307E\u308C\u308B\u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30D1\u30B9\u3002
elytron.properties-realm.groups-properties.relative-to=\u76F8\u5BFE\u30D1\u30B9\u306E\u8D77\u70B9\u3068\u306A\u308B\u4E8B\u524D\u5B9A\u7FA9\u3055\u308C\u305F\u30D1\u30B9\u3002
elytron.properties-realm.groups-attribute=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u30B0\u30EB\u30FC\u30D7\u30E1\u30F3\u30D0\u30FC\u30B7\u30C3\u30D7\u60C5\u5831\u304C\u542B\u307E\u308C\u308B\u8FD4\u3055\u308C\u305F AuthorizationIdentity \u306E\u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.properties-realm.synchronized=\u3053\u306E\u30EC\u30EB\u30E0\u3092\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u30D5\u30A1\u30A4\u30EB\u304C\u6700\u5F8C\u306B\u30ED\u30FC\u30C9\u3055\u308C\u305F\u6642\u9593\u3002
elytron.ldap-realm=LDAP \u306B\u3088\u3063\u3066\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002
elytron.ldap-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.ldap-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.ldap-realm.dir-context=LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306E\u8A2D\u5B9A\u3002
elytron.ldap-realm.dir-context.url=\u63A5\u7D9A URL\u3002
elytron.ldap-realm.dir-context.authentication-level=\u8A8D\u8A3C\u30EC\u30D9\u30EB\u3002
elytron.ldap-realm.dir-context.principal=LDAP \u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3057\u3066\u8A8D\u8A3C\u304A\u3088\u3073\u63A5\u7D9A\u3092\u884C\u3046\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3002
elytron.ldap-realm.dir-context.credential=LDAP \u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3057\u3066\u8A8D\u8A3C\u304A\u3088\u3073\u63A5\u7D9A\u3092\u884C\u3046\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3002
elytron.ldap-realm.dir-context.enable-connection-pooling=\u63A5\u7D9A\u30D7\u30FC\u30EB\u304C\u6709\u52B9\u3067\u3042\u308B\u304B\u3092\u793A\u3057\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping=\u57FA\u76E4\u306E LDAP \u30B5\u30FC\u30D0\u30FC\u3067\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u304C\u5BFE\u5FDC\u3059\u308B\u30A8\u30F3\u30C8\u30EA\u30FC\u3078\u30DE\u30C3\u30D7\u3055\u308C\u308B\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3059\u308B\u8A2D\u5B9A\u30AA\u30D7\u30B7\u30E7\u30F3\u3002
elytron.ldap-realm.identity-mapping.rdn-identifier=LDAP \u30A8\u30F3\u30C8\u30EA\u30FC\u304B\u3089\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u540D\u524D\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E DN \u306E RDN \u90E8\u5206\u3002\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u65B0\u898F\u4F5C\u6210\u6642\u306B\u3082\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.search-base-dn=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u691C\u7D22\u3059\u308B\u305F\u3081\u306E\u30D9\u30FC\u30B9 DN\u3002
elytron.ldap-realm.identity-mapping.use-recursive-search=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u691C\u7D22\u30AF\u30A8\u30EA\u30FC\u304C\u518D\u5E30\u7684\u3067\u3042\u308B\u304B\u3092\u793A\u3057\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.attribute-mapping=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u5B9A\u7FA9\u3055\u308C\u305F\u5C5E\u6027\u30DE\u30C3\u30D4\u30F3\u30B0\u3002
elytron.ldap-realm.identity-mapping.attribute-mapping.attribute=\u7279\u5B9A\u306E LDAP \u5C5E\u6027\u3092\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u5C5E\u6027\u3068\u3057\u3066\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u5C5E\u6027\u3002
elytron.ldap-realm.identity-mapping.from=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u5C5E\u6027\u3078\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002\u5B9A\u7FA9\u306E\u306A\u3044\u5834\u5408\u306F\u30A8\u30F3\u30C8\u30EA\u30FC\u306E DN \u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.to=\u7279\u5B9A\u306E LDAP \u5C5E\u6027\u304B\u3089\u30DE\u30C3\u30D7\u3055\u308C\u305F\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u5C5E\u6027\u306E\u540D\u524D\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u3001\u5C5E\u6027\u306E\u540D\u524D\u306F 'from' \u3067\u5B9A\u7FA9\u3055\u308C\u305F\u3082\u306E\u3068\u540C\u3058\u306B\u306A\u308A\u307E\u3059\u3002'from' \u3082\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u5024 'dn' \u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.reference=\u5024\u3092\u53D6\u5F97\u3059\u308B\u30A8\u30F3\u30C8\u30EA\u30FC\u306E DN \u304C\u542B\u307E\u308C\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-realm.identity-mapping.filter=\u7279\u5B9A\u306E\u5C5E\u6027\u306E\u5024\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u6587\u5B57\u5217  "{0}" \u306F\u30E6\u30FC\u30B6\u30FC\u540D\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u3001"{1}" \u306F\u30E6\u30FC\u30B6\u30FC\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC DN \u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.filter-base-dn=\u30D5\u30A3\u30EB\u30BF\u30FC\u304C\u5B9F\u884C\u3055\u308C\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u540D\u524D\u3002
elytron.ldap-realm.identity-mapping.search-recursive=\u5C5E\u6027 LDAP \u691C\u7D22\u30AF\u30A8\u30EA\u30FC\u304C\u518D\u5E30\u7684\u3067\u3042\u308B\u304B\u3092\u793A\u3057\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.role-recursion=\u518D\u5E30\u7684\u30ED\u30FC\u30EB\u5272\u308A\u5F53\u3066\u3092\u8A2D\u5B9A\u3057\u307E\u3059 - \u5024\u306F\u518D\u5E30\u306E\u6700\u5927\u306E\u6DF1\u3055\u3092\u6C7A\u5B9A\u3057\u307E\u3059 (0 \u306F\u518D\u5E30\u306A\u3057)\u3002
elytron.ldap-realm.identity-mapping.role-recursion-name=\u30ED\u30FC\u30EB\u306E\u30ED\u30FC\u30EB\u691C\u7D22\u6642\u306B\u30D5\u30A3\u30EB\u30BF\u30FC\u540D\u3067 "{0}" \u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u308B\u30ED\u30FC\u30EB\u30A8\u30F3\u30C8\u30EA\u30FC\u306E LDAP \u5C5E\u6027\u3092\u5224\u65AD\u3057\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.extract-rdn=raw \u5F62\u5F0F\u306E\u5024\u304C X.500 \u5F62\u5F0F \u3067\u3042\u308B\u5834\u5408\u306B\u3001\u5C5E\u6027\u306E\u5024\u3068\u3057\u3066\u4F7F\u7528\u3059\u308B RDN \u30AD\u30FC\u3002
elytron.ldap-realm.identity-mapping.filter-name=\u540D\u524D\u3067\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306E LDAP \u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u5024\u306F (rdn_identifier\={0}) \u306B\u306A\u308A\u307E\u3059\u3002\u6587\u5B57\u5217 '{0}' \u306F\u691C\u7D22\u3057\u305F\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u540D\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u3001'rdn_identifier' \u306F\u5C5E\u6027 'rdn-identifier' \u306E\u5024\u306B\u306A\u308A\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.iterator-filter=\u30EC\u30EB\u30E0\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3067\u7E70\u308A\u8FD4\u3059\u305F\u3081\u306E LDAP \u30D5\u30A3\u30EB\u30BF\u30FC\u3002
elytron.ldap-realm.identity-mapping.new-identity-parent-dn=\u65B0\u898F\u4F5C\u6210\u3055\u308C\u305F\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u89AA\u306E DN\u3002\u30EC\u30EB\u30E0\u306E\u66F4\u65B0\u6027\u306B\u5FC5\u8981\u3067\u3059\u3002
elytron.ldap-realm.identity-mapping.new-identity-attributes=\u65B0\u898F\u4F5C\u6210\u3055\u308C\u305F\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u5C5E\u6027\u3002\u30EC\u30EB\u30E0\u306E\u66F4\u65B0\u6027\u306B\u5FC5\u8981\u3067\u3059\u3002
elytron.ldap-realm.identity-mapping.name=\u5C5E\u6027\u540D\u3002
elytron.ldap-realm.identity-mapping.value=\u5C5E\u6027\u5024\u3002
elytron.ldap-realm.identity-mapping.credential-mapping=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u5B9A\u7FA9\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30DE\u30C3\u30D4\u30F3\u30B0\u3002
elytron.ldap-realm.identity-mapping.credential-mapping.credential=\u7279\u5B9A\u306E LDAP \u5C5E\u6027\u3092\u30E6\u30FC\u30B6\u30FC\u30D1\u30B9\u30EF\u30FC\u30C9\u5C5E\u6027\u3068\u3057\u3066\u30DE\u30C3\u30D7\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u5C5E\u6027\u3002
elytron.ldap-realm.identity-mapping.user-password-mapper=userPassword \u306B\u4F3C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u5C5E\u6027\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30DE\u30C3\u30D4\u30F3\u30B0\u3002
elytron.ldap-realm.identity-mapping.otp-credential-mapper=OTP \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30DE\u30C3\u30D4\u30F3\u30B0\u3002
elytron.ldap-realm.identity-mapping.algorithm-from=OTP \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3078\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-realm.identity-mapping.hash-from=Base64 \u30A8\u30F3\u30B3\u30FC\u30C9\u306E OTP \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30CF\u30C3\u30B7\u30E5\u3078\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-realm.identity-mapping.seed-from=OTP \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B7\u30FC\u30C9\u3078\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-realm.identity-mapping.sequence-from=OTP \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B7\u30FC\u30B1\u30F3\u30B9\u756A\u53F7\u3078\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-realm.identity-mapping.writable=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u5909\u66F4\u304C\u53EF\u80FD\u3067\u3042\u308B\u304B\u3092\u793A\u3057\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.verifiable=\u30E6\u30FC\u30B6\u30FC\u306E\u691C\u8A3C\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u4F7F\u7528\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.x509-credential-mapper=LDAP \u3092 X509 \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30B9\u30C8\u30EC\u30FC\u30B8\u3068\u3057\u3066\u4F7F\u7528\u3067\u304D\u308B\u8A2D\u5B9A\u3002X509 \u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306F\u8B58\u5225\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u8A3C\u660E\u66F8\u307E\u305F\u306F\u60C5\u5831\u3067\u3059\u3002*-from \u5C5E\u6027\u3092\u6307\u5B9A\u3057\u306A\u3044\u3068\u3053\u306E\u5B9A\u7FA9\u306F\u7121\u8996\u3055\u308C\u308B\u305F\u3081\u3001 \u6700\u4F4E\u3067\u3082 *-from \u5C5E\u6027 \u3092 1 \u3064\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u8907\u6570\u306E *-from \u5C5E\u6027\u304C\u5B9A\u7FA9\u3055\u308C\u305F\u5834\u5408\u3001\u30E6\u30FC\u30B6\u30FC\u8A3C\u660E\u66F8\u306F\u5B9A\u7FA9\u3055\u308C\u305F\u3059\u3079\u3066\u306E\u57FA\u6E96\u3068\u4E00\u81F4\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.digest-from=\u30E6\u30FC\u30B6\u30FC\u8A3C\u660E\u66F8\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u306B\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u3001\u8A3C\u660E\u66F8\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u306F\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093\u3002
elytron.ldap-realm.identity-mapping.digest-algorithm=\u30E6\u30FC\u30B6\u30FC\u8A3C\u660E\u66F8\u306E\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u306E\u7B97\u51FA\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0 (\u30CF\u30C3\u30B7\u30E5\u95A2\u6570)\u3002digest-from \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.ldap-realm.identity-mapping.certificate-from=\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30E6\u30FC\u30B6\u30FC\u8A3C\u660E\u66F8\u3078\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u3001\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u8A3C\u660E\u66F8\u306F\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093\u3002
elytron.ldap-realm.identity-mapping.serial-number-from=\u30E6\u30FC\u30B6\u30FC\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u306B\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u3001\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u306F\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093\u3002
elytron.ldap-realm.identity-mapping.subject-dn-from=\u30E6\u30FC\u30B6\u30FC\u8A3C\u660E\u66F8\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8 DN \u306B\u30DE\u30C3\u30D7\u3059\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u3001\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8 DN \u306F\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093\u3002
elytron.ldap-realm.direct-verification=\u3053\u306E\u30EC\u30EB\u30E0\u306F\u3001\u8A8D\u8A3C\u4E2D\u306E\u30A2\u30AB\u30A6\u30F3\u30C8\u3068\u3057\u3066\u76F4\u63A5 LDAP \u306B\u63A5\u7D9A\u3057\u3066\u884C\u3046\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u691C\u8A3C\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u307E\u3059\u304B?
elytron.ldap-realm.allow-blank-password=\u3053\u306E\u30EC\u30EB\u30E0\u306F\u7A7A\u767D\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u76F4\u63A5\u691C\u8A3C\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u307E\u3059\u304B? \u30B5\u30DD\u30FC\u30C8\u3057\u306A\u3044\u5834\u5408\u3001\u7A7A\u767D\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u8A66\u884C\u306F\u62D2\u5426\u3055\u308C\u307E\u3059\u3002
elytron.ldap-realm.identity=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306B\u3088\u308B\u7BA1\u7406\u304C\u53EF\u80FD\u306A\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3002
elytron.filesystem-realm=\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u306B\u3088\u3063\u3066\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3055\u308C\u308B\u7C21\u5358\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002
elytron.filesystem-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.filesystem-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.filesystem-realm.path=\u30EC\u30EB\u30E0\u304C\u542B\u307E\u308C\u308B\u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30D1\u30B9\u3002
elytron.filesystem-realm.relative-to=\u76F8\u5BFE\u30D1\u30B9\u306E\u8D77\u70B9\u3068\u306A\u308B\u4E8B\u524D\u5B9A\u7FA9\u3055\u308C\u305F\u30D1\u30B9\u3002
elytron.filesystem-realm.levels=\u9069\u7528\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC\u30CF\u30C3\u30B7\u30E5\u5316\u306E\u30EC\u30D9\u30EB\u6570\u3002
elytron.filesystem-realm.encoded=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u540D\u304C\u30D5\u30A1\u30A4\u30EB\u540D\u306B\u30A8\u30F3\u30B3\u30FC\u30C9 (Base32) \u3055\u308C\u305F\u72B6\u614B\u3067\u4FDD\u5B58\u3055\u308C\u308B\u3079\u304D\u304B\u3069\u3046\u304B\u3002
elytron.filesystem-realm.identity=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306B\u3088\u308B\u7BA1\u7406\u304C\u53EF\u80FD\u306A\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3002
elytron.token-realm=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C8\u30FC\u30AF\u30F3\u304B\u3089\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u691C\u8A3C\u304A\u3088\u3073\u62BD\u51FA\u3067\u304D\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002
elytron.token-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.token-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.token-realm.principal-claim=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u540D\u524D\u306E\u53D6\u5F97\u306B\u4F7F\u7528\u3055\u308C\u308B\u30AF\u30EC\u30FC\u30E0\u306E\u540D\u524D\u3002
elytron.token-realm.jwt=JWT/JWS \u6A19\u6E96\u3092\u57FA\u306B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C8\u30FC\u30AF\u30F3\u3092\u51E6\u7406\u3059\u308B\u30C8\u30FC\u30AF\u30F3\u30D9\u30FC\u30B9\u306E\u30EC\u30EB\u30E0\u3068\u3068\u3082\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C8\u30FC\u30AF\u30F3\u30D0\u30EA\u30C7\u30FC\u30BF\u30FC\u3002
elytron.token-realm.jwt.issuer=\u3053\u306E\u8A2D\u5B9A\u306B\u3088\u3063\u3066\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u767A\u884C\u5143\u3092\u8868\u3059\u6587\u5B57\u5217\u306E\u30EA\u30B9\u30C8\u3002\u691C\u8A3C\u4E2D\u3001\u3053\u3053\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u5024\u306E 1 \u3064\u304C\u542B\u307E\u308C\u308B "iss" \u30AF\u30EC\u30FC\u30E0\u304C JWT \u30C8\u30FC\u30AF\u30F3\u306B\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
elytron.token-realm.jwt.audience=\u3053\u306E\u8A2D\u5B9A\u306B\u3088\u3063\u3066\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u30AA\u30FC\u30C7\u30A3\u30A8\u30F3\u30B9\u3092\u8868\u3059\u6587\u5B57\u5217\u306E\u30EA\u30B9\u30C8\u3002\u691C\u8A3C\u4E2D\u3001\u3053\u3053\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u5024\u306E 1 \u3064\u304C\u542B\u307E\u308C\u308B "aud" \u30AF\u30EC\u30FC\u30E0\u304C JWT \u30C8\u30FC\u30AF\u30F3\u306B\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
elytron.token-realm.jwt.public-key=PEM \u5F62\u5F0F\u306E\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002\u691C\u8A3C\u4E2D\u3001\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u304C\u63D0\u4F9B\u3055\u308C\u308B\u5834\u5408\u306F\u3053\u3053\u3067\u63D0\u4F9B\u3055\u308C\u308B\u30AD\u30FC\u3092\u57FA\u306B\u66F8\u540D\u304C\u691C\u8A3C\u3055\u308C\u307E\u3059\u3002
elytron.token-realm.jwt.key-store=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3092\u6301\u3064\u8A3C\u660E\u66F8\u306E\u30ED\u30FC\u30C9\u5143\u3068\u306A\u308B\u30AD\u30FC\u30B9\u30C8\u30A2\u3002
elytron.token-realm.jwt.certificate=\u30AD\u30FC\u30B9\u30C8\u30A2\u304B\u3089\u30ED\u30FC\u30C9\u3059\u308B\u3001\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3092\u6301\u3064\u8A3C\u660E\u66F8\u306E\u540D\u524D\u3002
elytron.token-realm.oauth2-introspection=OAuth2 Token Introspection \u4ED5\u69D8 (RFC-7662) \u306B\u6E96\u62E0\u3059\u308B\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u4F7F\u7528\u3057\u3066 OAuth2 \u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u3092\u51E6\u7406\u3057\u691C\u8A3C\u3059\u308B\u30C8\u30FC\u30AF\u30F3\u30D9\u30FC\u30B9\u306E\u30EC\u30EB\u30E0\u3068\u4F75\u7528\u3055\u308C\u308B\u30C8\u30FC\u30AF\u30F3\u30D0\u30EA\u30C7\u30FC\u30BF\u30FC\u3002
elytron.token-realm.oauth2-introspection.client-id=OAuth2 \u627F\u8A8D\u30B5\u30FC\u30D0\u30FC\u4E0A\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u8B58\u5225\u5B50\u3002
elytron.token-realm.oauth2-introspection.client-secret=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u79D8\u5BC6\u3002
elytron.token-realm.oauth2-introspection.introspection-url=Token Introspection \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E URL\u3002
elytron.token-realm.oauth2-introspection.client-ssl-context=Introspection \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u304C HTTPS \u3092\u4F7F\u7528\u3059\u308B\u5834\u5408\u306B\u4F7F\u7528\u3055\u308C\u308B SSL \u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3002
elytron.token-realm.oauth2-introspection.host-name-verification-policy=HTTPS \u306E\u4F7F\u7528\u6642\u306B\u304A\u3051\u308B\u30DB\u30B9\u30C8\u540D\u306E\u691C\u8A3C\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3059\u308B\u30DD\u30EA\u30B7\u30FC\u3002\u8A31\u53EF\u3055\u308C\u308B\u5024\u306F "ANY" \u3067\u3059\u3002
elytron.modifiable-security-realm.add-identity=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.modifiable-security-realm.add-identity.identity=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3002
elytron.modifiable-security-realm.remove-identity=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
elytron.modifiable-security-realm.remove-identity.identity=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3002
elytron.modifiable-security-realm.read-identity=\u5B58\u5728\u3059\u308B\u5834\u5408\u306B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u304B\u3089\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u3092\u8AAD\u307F\u53D6\u308A\u307E\u3059\u3002
elytron.modifiable-security-realm.read-identity.identity=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3002
elytron.modifiable-security-realm.add-identity-attribute=\u5C5E\u6027\u3092\u65E2\u5B58\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.modifiable-security-realm.add-identity-attribute.identity=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3002
elytron.modifiable-security-realm.add-identity-attribute.name=\u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.modifiable-security-realm.add-identity-attribute.value=\u5C5E\u6027\u306E\u5024\u3002
elytron.modifiable-security-realm.remove-identity-attribute=\u5C5E\u6027\u3092\u65E2\u5B58\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
elytron.modifiable-security-realm.remove-identity-attribute.identity=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3002
elytron.modifiable-security-realm.remove-identity-attribute.name=\u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.modifiable-security-realm.remove-identity-attribute.value=\u5C5E\u6027\u306E\u5024\u3002
elytron.modifiable-security-realm.set-password=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u65E2\u5B58\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.modifiable-security-realm.set-password.identity=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3002
elytron.modifiable-security-realm.set-password.bcrypt=Bcrypt \u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u4F7F\u7528\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.bcrypt.iteration-count=\u30D1\u30B9\u30EF\u30FC\u30C9\u306B\u9069\u7528\u3059\u308B\u30A4\u30C6\u30EC\u30FC\u30B7\u30E7\u30F3\u6570\u307E\u305F\u306F\u30B3\u30B9\u30C8\u3002
elytron.modifiable-security-realm.set-password.bcrypt.salt=\u30D1\u30B9\u30EF\u30FC\u30C9\u306B\u9069\u7528\u3059\u308B salt\u3002\n
elytron.modifiable-security-realm.set-password.bcrypt.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.bcrypt=Bcrypt \u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u4F7F\u7528\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.bcrypt.name=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u540D\u3002
elytron.modifiable-security-realm.bcrypt.iteration-count=\u30D1\u30B9\u30EF\u30FC\u30C9\u306B\u9069\u7528\u3059\u308B\u30A4\u30C6\u30EC\u30FC\u30B7\u30E7\u30F3\u6570\u307E\u305F\u306F\u30B3\u30B9\u30C8\u3002
elytron.modifiable-security-realm.bcrypt.salt=\u30D1\u30B9\u30EF\u30FC\u30C9\u306B\u9069\u7528\u3059\u308B salt\u3002\n
elytron.modifiable-security-realm.bcrypt.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.bcrypt.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.set-password.clear=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.clear.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.clear=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.clear.name=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u540D\u3002
elytron.modifiable-security-realm.clear.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.simple-digest=\u7C21\u5358\u306A\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.simple-digest.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.set-password.simple-digest.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.simple-digest=\u7C21\u5358\u306A\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.simple-digest.name=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u540D\u3002
elytron.modifiable-security-realm.simple-digest.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.simple-digest.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.salted-simple-digest=salt \u304C\u4F7F\u7528\u3055\u308C\u308B\u7C21\u5358\u306A\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.salted-simple-digest.name=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u540D\u3002
elytron.modifiable-security-realm.set-password.salted-simple-digest.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.set-password.salted-simple-digest.salt=\u30D1\u30B9\u30EF\u30FC\u30C9\u306B\u9069\u7528\u3059\u308B salt\u3002
elytron.modifiable-security-realm.set-password.salted-simple-digest.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.salted-simple-digest=salt \u304C\u4F7F\u7528\u3055\u308C\u308B\u7C21\u5358\u306A\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.salted-simple-digest.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.salted-simple-digest.salt=\u30D1\u30B9\u30EF\u30FC\u30C9\u306B\u9069\u7528\u3059\u308B salt\u3002
elytron.modifiable-security-realm.salted-simple-digest.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.digest=\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.digest.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.set-password.digest.realm=\u30EC\u30EB\u30E0\u3002
elytron.modifiable-security-realm.set-password.digest.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.digest=\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.digest.name=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u540D\u3002
elytron.modifiable-security-realm.digest.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.digest.realm=\u30EC\u30EB\u30E0\u3002
elytron.modifiable-security-realm.digest.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.otp=OTP SASL \u30E1\u30AB\u30CB\u30BA\u30E0\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30EF\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.otp.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.otp.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.otp.seed=\u30CF\u30C3\u30B7\u30E5\u306E\u751F\u6210\u306B\u4F7F\u7528\u3055\u308C\u305F seed\u3002
elytron.modifiable-security-realm.otp.sequence=\u30CF\u30C3\u30B7\u30E5\u306E\u751F\u6210\u306B\u4F7F\u7528\u3055\u308C\u305F\u30B7\u30FC\u30B1\u30F3\u30B9\u756A\u53F7\u3002
elytron.modifiable-security-realm.set-password.otp=OTP SASL \u30E1\u30AB\u30CB\u30BA\u30E0\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u30EF\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.algorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u6697\u53F7\u5316\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.modifiable-security-realm.set-password.otp.password=\u8A2D\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
elytron.modifiable-security-realm.set-password.otp.seed=\u30CF\u30C3\u30B7\u30E5\u306E\u751F\u6210\u306B\u4F7F\u7528\u3055\u308C\u305F seed\u3002
elytron.modifiable-security-realm.set-password.otp.sequence=\u30CF\u30C3\u30B7\u30E5\u306E\u751F\u6210\u306B\u4F7F\u7528\u3055\u308C\u305F\u30B7\u30FC\u30B1\u30F3\u30B9\u756A\u53F7\u3002
elytron.caching-realm=\u4ED6\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u3078\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u53EF\u80FD\u306B\u3059\u308B\u30EC\u30EB\u30E0\u5B9A\u7FA9\u3002\u30AD\u30E3\u30C3\u30B7\u30E5\u30B9\u30C8\u30E9\u30C6\u30B8\u30FC\u306F LRU \u3067\u3001\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u6700\u5927\u6570\u306B\u9054\u3057\u305F\u3068\u304D\u306B\u30A2\u30AF\u30BB\u30B9\u304C\u6700\u3082\u5C11\u306A\u3044\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u7834\u68C4\u3055\u308C\u307E\u3059\u3002
elytron.caching-realm.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.caching-realm.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.caching-realm.realm=\u30AD\u30E3\u30C3\u30B7\u30E5\u53EF\u80FD\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30EB\u30E0\u3078\u306E\u53C2\u7167\u3002
elytron.caching-realm.maximum-entries=\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u4FDD\u6301\u3059\u308B\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u6700\u5927\u6570\u3002
elytron.caching-realm.maximum-age=\u30A2\u30A4\u30C6\u30E0\u304C\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u5B58\u5728\u3067\u304D\u308B\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
elytron.caching-realm.clear-cache=\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u3059\u3079\u3066\u306E\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.aggregate-sasl-server-factory=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304C\u5225\u306E sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u96C6\u7D04\u3067\u3042\u308B sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u5B9A\u7FA9\u3002
elytron.aggregate-sasl-server-factory.add=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.aggregate-sasl-server-factory.remove=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.aggregate-sasl-server-factory.sasl-server-factories=\u96C6\u7D04\u3059\u308B\u53C2\u7167\u3055\u308C\u305F sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3002
elytron.aggregate-sasl-server-factory.available-mechanisms=\u3059\u3079\u3066\u306E\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u306E\u9069\u7528\u5F8C\u306B\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A sasl \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.configurable-sasl-server-factory=\u5225\u306E SaslServerFactory \u3092\u30E9\u30C3\u30D7\u3057\u3001\u6307\u5B9A\u306E\u8A2D\u5B9A\u3068\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u3092\u9069\u7528\u3059\u308B SaslServerFactory \u5B9A\u7FA9\u3002
elytron.configurable-sasl-server-factory.add=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.configurable-sasl-server-factory.remove=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.configurable-sasl-server-factory.sasl-server-factory=\u30E9\u30C3\u30D7\u3055\u308C\u308B sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3002
elytron.configurable-sasl-server-factory.protocol=\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u4F5C\u6210\u6642\u306B\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3078\u6E21\u3055\u308C\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.configurable-sasl-server-factory.server-name=\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u4F5C\u6210\u6642\u306B\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3078\u6E21\u3055\u308C\u308B\u30B5\u30FC\u30D0\u30FC\u540D\u3002
elytron.configurable-sasl-server-factory.properties=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u30B3\u30FC\u30EB\u3078\u6E21\u3055\u308C\u308B\u30AB\u30B9\u30BF\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
elytron.configurable-sasl-server-factory.filters='or' \u3092\u4F7F\u7528\u3057\u3066\u7D50\u679C\u3092\u7D44\u307F\u5408\u308F\u305B\u3001\u9806\u756A\u306B\u8A55\u4FA1\u3055\u308C\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u30EA\u30B9\u30C8\u3002
elytron.configurable-sasl-server-factory.filters.predefined-filter=\u30E1\u30AB\u30CB\u30BA\u30E0\u540D\u3092\u30D5\u30A3\u30EB\u30BF\u30FC\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3059\u308B\u4E8B\u524D\u5B9A\u7FA9\u3055\u308C\u305F\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
elytron.configurable-sasl-server-factory.filters.pattern-filter=\u30E1\u30AB\u30CB\u30BA\u30E0\u540D\u306E\u6B63\u898F\u8868\u73FE\u30D9\u30FC\u30B9\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
elytron.configurable-sasl-server-factory.filters.enabling=\u3053\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u4E00\u81F4\u3057\u305F\u540D\u524D\u3092\u6709\u52B9\u307E\u305F\u306F\u7121\u52B9\u306B\u3059\u308B\u304B\u3002
elytron.configurable-sasl-server-factory.available-mechanisms=\u3059\u3079\u3066\u306E\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u306E\u9069\u7528\u5F8C\u306B\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A sasl \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.mechanism-provider-filtering-sasl-server-factory=\u5225\u306E SaslServerFactory \u3092\u30E9\u30C3\u30D7\u3057\u3001\u30E1\u30AB\u30CB\u30BA\u30E0\u540D\u3001Provider \u540D\u3001\u304A\u3088\u3073\u30D0\u30FC\u30B8\u30E7\u30F3\u3092\u57FA\u306B\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u6709\u52B9\u306B\u3059\u308B SaslServerFactory \u5B9A\u7FA9\u3002Provider \u3092\u4F7F\u7528\u3057\u3066\u3082\u898B\u3064\u304B\u3089\u306A\u3044\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306B\u3088\u3063\u3066\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30E1\u30AB\u30CB\u30BA\u30E0\u306F\u3001\u3053\u306E\u5B9A\u7FA9\u306B\u3088\u3063\u3066\u30D5\u30A3\u30EB\u30BF\u30FC\u3055\u308C\u307E\u305B\u3093\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.add=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.remove=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.sasl-server-factory=\u3053\u306E\u5B9A\u7FA9\u306B\u3088\u3063\u3066\u30E9\u30C3\u30D7\u3055\u308C\u308B sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.enabling='true' \u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u3001\u30D5\u30A3\u30EB\u30BF\u30FC\u306E 1 \u3064\u3068\u4E00\u81F4\u3057\u306A\u3044\u3068\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u3088\u3063\u3066\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30E1\u30AB\u30CB\u30BA\u30E0\u306F\u6709\u52B9\u306B\u306A\u308A\u307E\u305B\u3093\u3002'false' \u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u306F\u305D\u306E\u9006\u306B\u306A\u308A\u307E\u3059\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.filters=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304B\u3089\u306E\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u6BD4\u8F03\u3059\u308B\u3068\u304D\u306B\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u6307\u5B9A\u3057\u305F\u3059\u3079\u3066\u306E\u5024\u304C\u30E1\u30AB\u30CB\u30BA\u30E0\u3068\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30DA\u30A2\u3068\u4E00\u81F4\u3059\u308B\u5834\u5408\u306B\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u4E00\u81F4\u3057\u307E\u3059\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.filters.mechanism-name=\u3053\u306E\u8A2D\u5B9A\u306F\u3001\u540D\u524D\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u4F7F\u7528\u3055\u308C\u305F\u5834\u5408\u306E\u307F\u9069\u7528\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u3092\u7701\u7565\u3059\u308B\u3068\u3001\u3069\u306E\u30E1\u30AB\u30CB\u30BA\u30E0\u540D\u3068\u3082\u4E00\u81F4\u3057\u307E\u3059\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.filters.provider-name=\u4E00\u81F4\u3055\u305B\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.filters.provider-version=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D0\u30FC\u30B8\u30E7\u30F3\u306B\u5BFE\u3057\u3066\u6BD4\u8F03\u3059\u308B\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.filters.version-comparison='less-than' \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u304C\u3053\u3053\u3067\u6307\u5B9A\u3055\u308C\u305F\u30D0\u30FC\u30B8\u30E7\u30F3\u672A\u6E80\u3067\u3042\u308B\u5834\u5408\u306B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306F\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u5BFE\u3057\u3066\u4E00\u81F4\u3057\u307E\u3059\u3002'greater-than' \u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u306F\u3053\u306E\u9006\u306B\u306A\u308A\u307E\u3059\u3002\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306E\u5F71\u97FF\u306F\u3042\u308A\u307E\u305B\u3093\u3002
elytron.mechanism-provider-filtering-sasl-server-factory.available-mechanisms=\u3059\u3079\u3066\u306E\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u306E\u9069\u7528\u5F8C\u306B\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A sasl \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.provider-sasl-server-factory=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304C\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC [] \u304B\u3089\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u96C6\u7D04\u3067\u3042\u308B sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u5B9A\u7FA9
elytron.provider-sasl-server-factory.add=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.provider-sasl-server-factory.remove=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.provider-sasl-server-factory.providers=\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u5834\u6240\u3092\u898B\u3064\u3051\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u306F\u30B0\u30ED\u30FC\u30D0\u30EB\u306B\u767B\u9332\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30EA\u30B9\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.provider-sasl-server-factory.available-mechanisms=\u3059\u3079\u3066\u306E\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u306E\u9069\u7528\u5F8C\u306B\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A sasl \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.service-loader-sasl-server-factory=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304C ServiceLoader \u3092\u4F7F\u7528\u3057\u3066\u7279\u5B9A\u3055\u308C\u308B\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u96C6\u7D04\u3067\u3042\u308B sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u5B9A\u7FA9
elytron.service-loader-sasl-server-factory.add=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.service-loader-sasl-server-factory.remove=sasl \u30B5\u30FC\u30D0\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.service-loader-sasl-server-factory.module=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u3092\u53D6\u5F97\u3057\u3001\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u3092\u30ED\u30FC\u30C9\u3059\u308B\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u304C\u4EE3\u308F\u308A\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.service-loader-sasl-server-factory.available-mechanisms=\u3059\u3079\u3066\u306E\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u306E\u9069\u7528\u5F8C\u306B\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u304B\u3089\u5229\u7528\u53EF\u80FD\u306A sasl \u30E1\u30AB\u30CB\u30BA\u30E0\u3002
elytron.key-store=KeyStore \u5B9A\u7FA9\u3002
elytron.key-store.add=\u65B0\u3057\u3044 KeyStore \u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.key-store.remove=KeyStore \u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.key-store.load=KeyStore \u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002KeyStore \u304C\u30D5\u30A1\u30A4\u30EB\u306B\u3088\u3063\u3066\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3055\u308C\u308B\u5834\u5408\u306F\u30D5\u30A1\u30A4\u30EB\u306E\u5185\u5BB9\u3092\u518D\u8AAD\u307F\u53D6\u308A\u3057\u307E\u3059\u3002
elytron.key-store.store=KeyStore \u3092\u30D5\u30A1\u30A4\u30EB\u306B\u4FDD\u5B58\u3057\u307E\u3059\u3002KeyStore \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u30D5\u30A1\u30A4\u30EB\u306B\u3088\u3063\u3066\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3053\u306E\u64CD\u4F5C\u306B\u5931\u6557\u3057\u307E\u3059\u3002\u30D5\u30A1\u30A4\u30EB\u304C\u5B58\u5728\u305B\u305A\u5FC5\u8981\u3067\u3042\u308B\u3068\u30D5\u30E9\u30B0\u4ED8\u3051\u3055\u308C\u3066\u3044\u306A\u304B\u3063\u305F\u5834\u5408\u306F\u3001\u30D5\u30A1\u30A4\u30EB\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002
elytron.key-store.type=KeyStore \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u7528\u3055\u308C\u308B KeyStore \u306E\u578B\u3002
elytron.key-store.provider-name=KeyStore \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002\u6307\u5B9A\u306E\u578B\u306E KeyStore \u3092\u4F5C\u6210\u3067\u304D\u308B\u6700\u521D\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u691C\u7D22\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
elytron.key-store.credential-reference=\u5B9A\u7FA9\u3055\u308C\u305F\u30A8\u30A4\u30EA\u30A2\u30B9\u307E\u305F\u306F\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u30D1\u30B9\u30EF\u30FC\u30C9\u4E0B\u306E CredentialStore \u306B\u4FDD\u5B58\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u53C2\u7167\u3002
elytron.key-store.credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3078\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D\u3002
elytron.key-store.credential-reference.alias=\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30B9\u30C8\u30A2\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.key-store.credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u578B\u3002
elytron.key-store.credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6\u3002\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044\u3002
elytron.key-store.relative-to=\u3053\u306E\u76F8\u5BFE\u30D1\u30B9\u306E\u8D77\u70B9\u3068\u306A\u308B\u30D9\u30FC\u30B9\u30D1\u30B9\u3002
elytron.key-store.path=KeyStore \u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30D1\u30B9\u3002
elytron.key-store.required=KeyStore \u30B5\u30FC\u30D3\u30B9\u306E\u8D77\u52D5\u6642\u306B\u30D5\u30A1\u30A4\u30EB\u304C\u5B58\u5728\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u304B?
elytron.key-store.providers=\u691C\u7D22\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EA\u30B9\u30C8\u306E\u53D6\u5F97\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3078\u306E\u53C2\u7167\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u306F\u4EE3\u308F\u308A\u306B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u30EA\u30B9\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.key-store.alias-filter=KeyStore \u304B\u3089\u8FD4\u3055\u308C\u305F\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u8FD4\u3059\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u307E\u305F\u306F\u6B21\u306E\u5F62\u5F0F\u306E 1 \u3064\u306B\u306A\u308A\u307E\u3059 ALL\:-alias1\:-alias2\u3001NONE\:+alias1\:+alias2
elytron.key-store.state=\u8D77\u52D5\u6642\u306B\u3053\u306E KeyStore \u3092\u8868\u3059\u57FA\u76E4\u306E\u30B5\u30FC\u30D3\u30B9\u306E\u72B6\u614B\u3002UP \u4EE5\u5916\u306E\u5834\u5408\u306F\u30E9\u30F3\u30BF\u30A4\u30E0\u64CD\u4F5C\u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
elytron.key-store.synchronized=\u3053\u306E KeyStore \u304C\u6700\u5F8C\u306B\u30ED\u30FC\u30C9\u307E\u305F\u306F\u4FDD\u5B58\u3055\u308C\u305F\u6642\u9593\u3002\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u4E00\u90E8\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30B5\u30FC\u30D0\u30FC\u5185\u3067 KeyStore \u304C\u30ED\u30FC\u30C9\u3055\u308C\u305F\u5F8C\u3082\u7D99\u7D9A\u3057\u3066\u66F4\u65B0\u3092\u9069\u7528\u3059\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
elytron.key-store.modified=KeyStore \u304C\u6700\u5F8C\u306B\u30ED\u30FC\u30C9\u307E\u305F\u306F\u4FDD\u5B58\u3055\u308C\u305F\u5F8C\u306B KeyStore \u304C\u5909\u66F4\u3055\u308C\u305F\u3053\u3068\u3092\u30E1\u30E2\u30EA\u30FC\u5185\u3067\u8868\u3057\u307E\u3059\u3002\u6CE8\u610F\: \u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u66F4\u65B0\u306B\u3088\u3063\u3066\u306F\u3001\u3055\u3089\u306A\u308B\u30ED\u30FC\u30C9\u3084\u30B9\u30C8\u30A2\u30B3\u30FC\u30EB\u306A\u3057\u3067\u5373\u5EA7\u306B\u5B9F\u884C\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
elytron.key-store.loaded-provider=\u3053\u306E\u30AD\u30FC\u30B9\u30C8\u30A2\u306B\u4F7F\u7528\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u3059\u308B\u60C5\u5831\u3002
elytron.key-store.loaded-provider.name=KeyStore \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002
elytron.key-store.loaded-provider.info=KeyStore \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u3059\u308B\u60C5\u5831\u6587\u5B57\u5217\u3002
elytron.key-store.loaded-provider.version=KeyStore \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.key-store.size=KeyStore \u306E\u30A8\u30F3\u30C8\u30EA\u30FC\u6570\u3002
elytron.key-store.alias=KeyStore \u5185\u306E\u500B\u5225\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.key-store.alias.remove=KeyStore \u304B\u3089\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u5373\u5EA7\u306B\u524A\u9664\u3057\u307E\u3059\u3002\u3053\u306E\u64CD\u4F5C\u304C\u9069\u5207\u306B\u5B9F\u884C\u3055\u308C\u308B\u304B\u3069\u3046\u304B\u306F\u3001\u524A\u9664\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u57FA\u76E4\u306E KeyStore \u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u3088\u308A\u307E\u3059\u3002
elytron.key-store.alias.creation-date=\u3053\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u3088\u3063\u3066\u8868\u3055\u308C\u308B\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u4F5C\u6210\u65E5\u3002
elytron.key-store.alias.entry-type=\u3053\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u578B\u3002\u8A8D\u8B58\u3067\u304D\u306A\u3044\u578B\u306F 'Other' \u3068\u3057\u3066\u5831\u544A\u3055\u308C\u307E\u3059\u3002
elytron.key-store.alias.certificate=\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u95A2\u9023\u3059\u308B\u8A3C\u660E\u66F8 (\u6CE8\u8A18\: \u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u8A3C\u660E\u66F8\u30C1\u30A7\u30FC\u30F3\u304C\u3042\u308B\u5834\u5408\u306F\u5E38\u306B\u672A\u5B9A\u7FA9\u306B\u306A\u308A\u307E\u3059)\u3002
elytron.key-store.alias.certificate-chain=\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u95A2\u9023\u3059\u308B\u8A3C\u660E\u66F8\u30C1\u30A7\u30FC\u30F3\u3002
elytron.key-store.alias.certificate.type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.key-store.alias.certificate.algorithm=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.key-store.alias.certificate.format=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u5F62\u5F0F\u3002
elytron.key-store.alias.certificate.public-key=\u8A3C\u660E\u66F8\u306B\u95A2\u9023\u3059\u308B\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002
elytron.key-store.alias.certificate.sha-1-digest=\u8A3C\u660E\u66F8\u306E SHA-1 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8 (\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.key-store.alias.certificate.sha-256-digest=\u8A3C\u660E\u66F8\u306E SHA-256 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8(\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.key-store.alias.certificate.encoded=\u8A3C\u660E\u66F8\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u5024\u3002
elytron.key-store.alias.certificate.subject=\u8A3C\u660E\u66F8\u304B\u3089\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3002
elytron.key-store.alias.certificate.issuer=\u8A3C\u660E\u66F8\u306E\u767A\u884C\u5143\u3002
elytron.key-store.alias.certificate.not-before=\u8A3C\u660E\u66F8\u304C\u6709\u52B9\u306B\u306A\u308B\u958B\u59CB\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.key-store.alias.certificate.not-after=\u8A3C\u660E\u66F8\u306E\u5931\u52B9\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.key-store.alias.certificate.serial-number=\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u3002
elytron.key-store.alias.certificate.signature-algorithm=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.key-store.alias.certificate.signature=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3002
elytron.key-store.alias.certificate.version=\u8A3C\u660E\u66F8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.key-store.alias.certificate-chain.type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.key-store.alias.certificate-chain.algorithm=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.key-store.alias.certificate-chain.format=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u5F62\u5F0F\u3002
elytron.key-store.alias.certificate-chain.public-key=\u8A3C\u660E\u66F8\u306B\u95A2\u9023\u3059\u308B\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002
elytron.key-store.alias.certificate-chain.sha-1-digest=\u8A3C\u660E\u66F8\u306E SHA-1 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8 (\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.key-store.alias.certificate-chain.sha-256-digest=\u8A3C\u660E\u66F8\u306E SHA-256 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8(\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.key-store.alias.certificate-chain.encoded=\u8A3C\u660E\u66F8\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u5024\u3002
elytron.key-store.alias.certificate-chain.subject=\u8A3C\u660E\u66F8\u304B\u3089\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3002
elytron.key-store.alias.certificate-chain.issuer=\u8A3C\u660E\u66F8\u306E\u767A\u884C\u5143\u3002
elytron.key-store.alias.certificate-chain.not-before=\u8A3C\u660E\u66F8\u304C\u6709\u52B9\u306B\u306A\u308B\u958B\u59CB\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.key-store.alias.certificate-chain.not-after=\u8A3C\u660E\u66F8\u306E\u5931\u52B9\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.key-store.alias.certificate-chain.serial-number=\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u3002
elytron.key-store.alias.certificate-chain.signature-algorithm=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.key-store.alias.certificate-chain.signature=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3002
elytron.key-store.alias.certificate-chain.version=\u8A3C\u660E\u66F8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.modifiable-key-store.read-alias=KeyStore\u304B\u3089\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u8AAD\u307F\u53D6\u308A\u307E\u3059\u3002
elytron.modifiable-key-store.read-alias.alias=\u8AAD\u307F\u53D6\u308B KeyStore \u30A2\u30A4\u30C6\u30E0\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.modifiable-key-store.read-aliases=KeyStore \u304B\u3089\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u8AAD\u307F\u53D6\u308A\u307E\u3059\u3002
elytron.modifiable-key-store.remove-alias=KeyStore \u304B\u3089\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.modifiable-key-store.remove-alias.alias=\u524A\u9664\u3059\u308B KeyStore \u30A2\u30A4\u30C6\u30E0\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.ldap-key-store=LdapKeyStore \u5B9A\u7FA9\u3002
elytron.ldap-key-store.add=\u65B0\u3057\u3044 LDAP KeyStore \u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.ldap-key-store.remove=LDAP KeyStore \u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.ldap-key-store.size=\u30A2\u30A4\u30C6\u30E0/\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u91CF\u3067\u8868\u3059 LDAP KeyStore \u306E\u30B5\u30A4\u30BA\u3002
elytron.ldap-key-store.state=\u8D77\u52D5\u6642\u306B\u3053\u306E KeyStore \u3092\u8868\u3059\u57FA\u76E4\u306E\u30B5\u30FC\u30D3\u30B9\u306E\u72B6\u614B\u3002UP \u4EE5\u5916\u306E\u5834\u5408\u306F\u30E9\u30F3\u30BF\u30A4\u30E0\u64CD\u4F5C\u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
elytron.ldap-key-store.dir-context=LDAP \u30B5\u30FC\u30D0\u30FC\u3068\u306E\u901A\u4FE1\u306B\u4F7F\u7528\u3055\u308C\u308B DirContext \u306E\u540D\u524D\u3002
elytron.ldap-key-store.search-path=KeyStore \u30A2\u30A4\u30C6\u30E0\u304C\u691C\u7D22\u3055\u308C\u308B LDAP \u306E\u30D1\u30B9\u3002
elytron.ldap-key-store.search-recursive=LDAP \u691C\u7D22\u304C\u518D\u5E30\u7684\u3067\u3042\u308B\u304B\u3002
elytron.ldap-key-store.search-time-limit=LDAP \u304B\u3089 KeyStore \u30A2\u30A4\u30C6\u30E0\u3092\u53D6\u5F97\u3059\u308B\u3068\u304D\u306E\u30BF\u30A4\u30E0\u30EA\u30DF\u30C3\u30C8\u3002
elytron.ldap-key-store.filter-alias=KeyStore \u306E\u30A2\u30A4\u30C6\u30E0\u3092\u30A8\u30A4\u30EA\u30A2\u30B9\u3067\u53D6\u5F97\u3059\u308B\u305F\u3081\u306E LDAP \u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u5024\u306F  (alias_attribute\={0}) \u306B\u306A\u308A\u307E\u3059\u3002\u6587\u5B57\u5217 '{0}' \u306F\u691C\u7D22\u3057\u305F\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u3001'alias_attribute' \u306E\u5024\u306F\u5C5E\u6027 'alias-attribute' \u306E\u5024\u306B\u306A\u308A\u307E\u3059\u3002
elytron.ldap-key-store.filter-certificate=KeyStore \u306E\u30A2\u30A4\u30C6\u30E0\u3092\u8A3C\u660E\u66F8\u3067\u53D6\u5F97\u3059\u308B\u305F\u3081\u306E LDAP \u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u5024\u306F (certificate_attribute\={0}) \u306B\u306A\u308A\u307E\u3059\u3002\u6587\u5B57\u5217 '{0}' \u691C\u7D22\u3057\u305F\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u8A3C\u660E\u66F8\u306B\u7F6E\u304D\u63DB\u3048\u3089\u308C\u3001'certificate_attribute' \u306F\u5C5E\u6027 'certificate-attribute' \u306E\u5024\u306B\u306A\u308A\u307E\u3059\u3002
elytron.ldap-key-store.filter-iterate=KeyStore \u306E\u3059\u3079\u3066\u306E\u30A2\u30A4\u30C6\u30E0\u3092\u7E70\u308A\u8FD4\u3059\u305F\u3081\u306E LDAP \u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u5024\u306F (alias_attribute\=*) \u306B\u306A\u308A\u307E\u3059\u3002'alias_attribute' \u306F\u5C5E\u6027 'alias-attribute' \u306E\u5024\u306B\u306A\u308A\u307E\u3059\u3002
elytron.ldap-key-store.new-item-template=\u30A2\u30A4\u30C6\u30E0\u4F5C\u6210\u306E\u8A2D\u5B9A\u3002\u65B0\u898F\u4F5C\u6210\u3055\u308C\u305F\u30AD\u30FC\u30B9\u30C8\u30A2\u30A2\u30A4\u30C6\u30E0\u306E LDAP \u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u3069\u306E\u3088\u3046\u306B\u8868\u793A\u3059\u308B\u304B\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
elytron.ldap-key-store.new-item-template.new-item-path=\u65B0\u898F\u4F5C\u6210\u3055\u308C\u305F KeyStore \u30A2\u30A4\u30C6\u30E0\u304C\u4FDD\u5B58\u3055\u308C\u308B LDAP \u306E\u30D1\u30B9\u3002
elytron.ldap-key-store.new-item-template.new-item-rdn=\u65B0\u898F\u4F5C\u6210\u3055\u308C\u305F\u30A2\u30A4\u30C6\u30E0\u306E RDN \u3067\u4F7F\u7528\u3055\u308C\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-key-store.new-item-template.new-item-attributes=\u65B0\u898F\u4F5C\u6210\u3055\u308C\u305F\u30A2\u30A4\u30C6\u30E0\u306B\u8A2D\u5B9A\u3055\u308C\u308B LDAP \u5C5E\u6027\u3002
elytron.ldap-key-store.new-item-template.name=LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-key-store.new-item-template.value=LDAP \u5C5E\u6027\u306E\u5024\u3002
elytron.ldap-key-store.alias-attribute=\u30A2\u30A4\u30C6\u30E0\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u304C\u4FDD\u5B58\u3055\u308C\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-key-store.certificate-attribute=\u8A3C\u660E\u66F8\u304C\u4FDD\u5B58\u3055\u308C\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-key-store.certificate-type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.ldap-key-store.certificate-chain-attribute=\u8A3C\u660E\u66F8\u30C1\u30A7\u30FC\u30F3\u304C\u4FDD\u5B58\u3055\u308C\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-key-store.certificate-chain-type=\u8A3C\u660E\u66F8\u30C1\u30A7\u30FC\u30F3\u306E\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.ldap-key-store.certificate-chain-encoding=\u8A3C\u660E\u66F8\u30C1\u30A7\u30FC\u30F3\u306E\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0\u3002
elytron.ldap-key-store.key-attribute=\u30AD\u30FC\u304C\u4FDD\u5B58\u3055\u308C\u308B LDAP \u5C5E\u6027\u306E\u540D\u524D\u3002
elytron.ldap-key-store.key-type=\u30AD\u30FC\u304C LDAP \u5C5E\u6027\u306B\u30B7\u30EA\u30A2\u30EB\u5316\u3055\u308C\u308B KeyStore \u306E\u578B\u3002
elytron.ldap-key-store.alias=KeyStore \u5185\u306E\u500B\u5225\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.ldap-key-store.alias.remove=KeyStore \u304B\u3089\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u5373\u5EA7\u306B\u524A\u9664\u3057\u307E\u3059\u3002\u3053\u306E\u64CD\u4F5C\u304C\u9069\u5207\u306B\u5B9F\u884C\u3055\u308C\u308B\u304B\u3069\u3046\u304B\u306F\u3001\u524A\u9664\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u57FA\u76E4\u306E KeyStore \u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u3088\u308A\u307E\u3059\u3002
elytron.ldap-key-store.alias.creation-date=\u3053\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u3088\u3063\u3066\u8868\u3055\u308C\u308B\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u4F5C\u6210\u65E5\u3002
elytron.ldap-key-store.alias.entry-type=\u3053\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u30A8\u30F3\u30C8\u30EA\u30FC\u306E\u578B\u3002\u8A8D\u8B58\u3067\u304D\u306A\u3044\u578B\u306F 'Other' \u3068\u3057\u3066\u5831\u544A\u3055\u308C\u307E\u3059\u3002
elytron.ldap-key-store.alias.certificate=\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u95A2\u9023\u3059\u308B\u8A3C\u660E\u66F8 (\u6CE8\u8A18\: \u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u8A3C\u660E\u66F8\u30C1\u30A7\u30FC\u30F3\u304C\u3042\u308B\u5834\u5408\u306F\u5E38\u306B\u672A\u5B9A\u7FA9\u306B\u306A\u308A\u307E\u3059)\u3002
elytron.ldap-key-store.alias.certificate-chain=\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u95A2\u9023\u3059\u308B\u8A3C\u660E\u66F8\u30C1\u30A7\u30FC\u30F3\u3002
elytron.ldap-key-store.alias.certificate.type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.ldap-key-store.alias.certificate.algorithm=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.ldap-key-store.alias.certificate.format=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u5F62\u5F0F\u3002
elytron.ldap-key-store.alias.certificate.public-key=\u8A3C\u660E\u66F8\u306B\u95A2\u9023\u3059\u308B\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002
elytron.ldap-key-store.alias.certificate.sha-1-digest=\u8A3C\u660E\u66F8\u306E SHA-1 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8 (\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.ldap-key-store.alias.certificate.sha-256-digest=\u8A3C\u660E\u66F8\u306E SHA-256 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8(\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.ldap-key-store.alias.certificate.encoded=\u8A3C\u660E\u66F8\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u5024\u3002
elytron.ldap-key-store.alias.certificate.subject=\u8A3C\u660E\u66F8\u304B\u3089\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3002
elytron.ldap-key-store.alias.certificate.issuer=\u8A3C\u660E\u66F8\u306E\u767A\u884C\u5143\u3002
elytron.ldap-key-store.alias.certificate.not-before=\u8A3C\u660E\u66F8\u304C\u6709\u52B9\u306B\u306A\u308B\u958B\u59CB\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.ldap-key-store.alias.certificate.not-after=\u8A3C\u660E\u66F8\u306E\u5931\u52B9\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.ldap-key-store.alias.certificate.serial-number=\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u3002
elytron.ldap-key-store.alias.certificate.signature-algorithm=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.ldap-key-store.alias.certificate.signature=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3002
elytron.ldap-key-store.alias.certificate.version=\u8A3C\u660E\u66F8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.ldap-key-store.alias.certificate-chain.type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.ldap-key-store.alias.certificate-chain.algorithm=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.ldap-key-store.alias.certificate-chain.format=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u5F62\u5F0F\u3002
elytron.ldap-key-store.alias.certificate-chain.public-key=\u8A3C\u660E\u66F8\u306B\u95A2\u9023\u3059\u308B\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002
elytron.ldap-key-store.alias.certificate-chain.sha-1-digest=\u8A3C\u660E\u66F8\u306E SHA-1 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8 (\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.ldap-key-store.alias.certificate-chain.sha-256-digest=\u8A3C\u660E\u66F8\u306E SHA-256 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8(\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.ldap-key-store.alias.certificate-chain.encoded=\u8A3C\u660E\u66F8\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u5024\u3002
elytron.ldap-key-store.alias.certificate-chain.subject=\u8A3C\u660E\u66F8\u304B\u3089\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3002
elytron.ldap-key-store.alias.certificate-chain.issuer=\u8A3C\u660E\u66F8\u306E\u767A\u884C\u5143\u3002
elytron.ldap-key-store.alias.certificate-chain.not-before=\u8A3C\u660E\u66F8\u304C\u6709\u52B9\u306B\u306A\u308B\u958B\u59CB\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.ldap-key-store.alias.certificate-chain.not-after=\u8A3C\u660E\u66F8\u306E\u5931\u52B9\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.ldap-key-store.alias.certificate-chain.serial-number=\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u3002
elytron.ldap-key-store.alias.certificate-chain.signature-algorithm=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.ldap-key-store.alias.certificate-chain.signature=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3002
elytron.ldap-key-store.alias.certificate-chain.version=\u8A3C\u660E\u66F8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.filtering-key-store=\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u306E KeyStore \u5B9A\u7FA9\u3002
elytron.filtering-key-store.add=\u65B0\u3057\u3044 KeyStore \u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.filtering-key-store.remove=KeyStore \u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.filtering-key-store.alias-filter=KeyStore \u304B\u3089\u8FD4\u3055\u308C\u305F\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u8FD4\u3059\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u307E\u305F\u306F\u6B21\u306E\u5F62\u5F0F\u306E 1 \u3064\u306B\u306A\u308A\u307E\u3059 ALL\:-alias1\:-alias2\u3001NONE\:+alias1\:+alias2
elytron.filtering-key-store.key-store=\u30D5\u30A3\u30EB\u30BF\u30FC\u3055\u308C\u305F KeyStore \u306E\u540D\u524D\u3002
elytron.filtering-key-store.state=\u8D77\u52D5\u6642\u306B\u3053\u306E KeyStore \u3092\u8868\u3059\u57FA\u76E4\u306E\u30B5\u30FC\u30D3\u30B9\u306E\u72B6\u614B\u3002UP \u4EE5\u5916\u306E\u5834\u5408\u306F\u30E9\u30F3\u30BF\u30A4\u30E0\u64CD\u4F5C\u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
elytron.filtering-key-store.alias=\u30D5\u30A3\u30EB\u30BF\u30FC\u3059\u308B KeyStore \u5185\u306E\u500B\u5225\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.key-manager=SSLContext \u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3055\u308C\u308B KeyManager \u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u306E\u30AD\u30FC\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u5B9A\u7FA9\u3002
elytron.key-manager.add=\u65B0\u3057\u3044\u30AD\u30FC\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.key-manager.remove=\u30AD\u30FC\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.key-manager.init=\u30AD\u30FC\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3092\u518D\u5EA6\u521D\u671F\u5316\u3057\u307E\u3059\u3002
elytron.key-manager.algorithm=\u57FA\u76E4\u306E KeyManagerFactory \u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3059\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306E\u540D\u524D\u3002
elytron.key-manager.providers=\u57FA\u76E4\u306E KeyManagerFactory \u306E\u4F5C\u6210\u6642\u306B\u4F7F\u7528\u3059\u308B Provider [] \u3092\u53D6\u5F97\u3059\u308B\u53C2\u7167\u3002
elytron.key-manager.provider-name=\u57FA\u76E4\u306E KeyManagerFactory \u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002
elytron.key-manager.credential-reference=KeyStore \u30A2\u30A4\u30C6\u30E0\u3092\u5FA9\u53F7\u5316\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u53C2\u7167 (KeyStore \u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3067\u306F\u3042\u308A\u307E\u305B\u3093)\u3002
elytron.key-manager.credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D\u3002
elytron.key-manager.credential-reference.alias=\u30B9\u30C8\u30A2\u306B\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.key-manager.credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7\u3002
elytron.key-manager.credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6\u3002\u30B5\u30FC\u30D3\u30B9\u3078\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/\u79D8\u5BC6\u306E\u63D0\u4F9B\u306B\u3064\u3044\u3066\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u307E\u3059\u3002
elytron.key-manager.key-store=\u57FA\u76E4\u306E KeyManagerFactory \u306E\u521D\u671F\u5316\u306B\u4F7F\u7528\u3059\u308B KeyStore \u3078\u306E\u53C2\u7167\u3002
elytron.key-manager.alias-filter=KeyStore \u304B\u3089\u8FD4\u3055\u308C\u305F\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u8FD4\u3059\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u307E\u305F\u306F\u6B21\u306E\u5F62\u5F0F\u306E 1 \u3064\u306B\u306A\u308A\u307E\u3059 ALL\:-alias1\:-alias2\u3001NONE\:+alias1\:+alias2
elytron.trust-manager=SSLContext \u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3055\u308C\u308B TrustManager [] \u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u306E\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u5B9A\u7FA9\u3002
elytron.trust-manager.add=\u65B0\u3057\u3044\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.trust-manager.remove=\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.trust-manager.algorithm=\u57FA\u76E4\u306E TrustManagerFactory \u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3059\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u306E\u540D\u524D\u3002
elytron.trust-manager.providers=\u57FA\u76E4\u306E TrustManagerFactory \u306E\u4F5C\u6210\u6642\u306B\u4F7F\u7528\u3059\u308B Provider [] \u3092\u53D6\u5F97\u3059\u308B\u53C2\u7167\u3002
elytron.trust-manager.provider-name=\u57FA\u76E4\u306E TrustManagerFactory \u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002
elytron.trust-manager.key-store=\u57FA\u76E4\u306E TrustManagerFactory \u306E\u521D\u671F\u5316\u306B\u4F7F\u7528\u3059\u308B KeyStore \u3078\u306E\u53C2\u7167\u3002
elytron.trust-manager.alias-filter=KeyStore \u304B\u3089\u8FD4\u3055\u308C\u305F\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u8FD4\u3059\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u307E\u305F\u306F\u6B21\u306E\u5F62\u5F0F\u306E 1 \u3064\u306B\u306A\u308A\u307E\u3059 ALL\:-alias1\:-alias2\u3001NONE\:+alias1\:+alias2
elytron.trust-manager.certificate-revocation-list=\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3078\u306E\u8A3C\u660E\u66F8\u5931\u52B9\u30EA\u30B9\u30C8\u30C1\u30A7\u30C3\u30AF\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
elytron.trust-manager.certificate-revocation-list.path=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u521D\u671F\u5316\u306B\u4F7F\u7528\u3059\u308B\u8A2D\u5B9A\u3078\u306E\u30D1\u30B9\u3002
elytron.trust-manager.certificate-revocation-list.relative-to=\u8A3C\u660E\u66F8\u5931\u52B9\u30EA\u30B9\u30C8\u30D5\u30A1\u30A4\u30EB\u306E\u30D9\u30FC\u30B9\u30D1\u30B9\u3002
elytron.trust-manager.certificate-revocation-list.maximum-cert-path=\u8A3C\u660E\u30D1\u30B9\u306B\u5B58\u5728\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308B\u81EA\u5DF1\u767A\u884C\u3055\u308C\u3066\u3044\u306A\u3044\u4E2D\u9593\u8A3C\u660E\u66F8\u306E\u6700\u5927\u6570\u3002
elytron.trust-manager.reload-certificate-revocation-list=\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u8A3C\u660E\u66F8\u5931\u52B9\u30EA\u30B9\u30C8\u3092\u30EA\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306B\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306B\u901A\u77E5\u3057\u307E\u3059\u3002
elytron.client-ssl-context=\u63A5\u7D9A\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5074\u3067\u4F7F\u7528\u3059\u308B SSLContext\u3002
elytron.client-ssl-context.add=SSLContext \u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.client-ssl-context.remove=SSLContext \u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.client-ssl-context.cipher-suite-filter=\u6709\u52B9\u5316\u3055\u308C\u305F\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u3092\u6307\u5B9A\u3059\u308B\u305F\u3081\u306B\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
elytron.client-ssl-context.protocols=\u6709\u52B9\u5316\u3055\u308C\u305F\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.client-ssl-context.use-cipher-suites-order=\u30ED\u30FC\u30AB\u30EB\u306E\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u8A2D\u5B9A\u3092\u5C0A\u91CD\u3059\u308B\u3002
elytron.client-ssl-context.maximum-session-cache-size=\u30AD\u30E3\u30C3\u30B7\u30E5\u3067\u306E SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6700\u5927\u6570\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F -1 \u3067\u3001JVM \u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002\u5024\u3092 0 \u306B\u3059\u308B\u3068\u7121\u5236\u9650\u306B\u306A\u308A\u307E\u3059\u3002
elytron.client-ssl-context.session-timeout=SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F -1 \u3067\u3001JVM \u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002\u5024\u3092 0 \u306B\u3059\u308B\u3068\u7121\u5236\u9650\u306B\u306A\u308A\u307E\u3059\u3002
elytron.client-ssl-context.key-manager=SSLContext \u5185\u3067\u4F7F\u7528\u3059\u308B\u30AD\u30FC\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.client-ssl-context.key-refresh=SSLContext \u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B KeyManager \u3092\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
elytron.client-ssl-context.trust-manager=SSLContext \u5185\u3067\u4F7F\u7528\u3059\u308B\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.client-ssl-context.provider-name=\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u306F\u3001\u3059\u3079\u3066\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C SSLContext \u3078\u6E21\u3055\u308C\u307E\u3059\u3002
elytron.client-ssl-context.providers=SSLContext \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B Provider [] \u3092\u53D6\u5F97\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002
elytron.client-ssl-context.active-session-count=\u73FE\u5728\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6570\u3002
elytron.client-ssl-context.ssl-session=\u73FE\u5728\u78BA\u7ACB\u3055\u308C\u3066\u3044\u308B SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u3002
elytron.client-ssl-context.ssl-session.application-buffer-size=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA\u3002
elytron.client-ssl-context.ssl-session.cipher-suite=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u9078\u629E\u6E08\u307F\u306E\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u3002
elytron.client-ssl-context.ssl-session.creation-time=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u4F5C\u6210\u6642\u9593\u3002
elytron.client-ssl-context.ssl-session.last-accessed-time=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u6700\u7D42\u30A2\u30AF\u30BB\u30B9\u6642\u3002
elytron.client-ssl-context.ssl-session.local-principal=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30ED\u30FC\u30AB\u30EB\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3002
elytron.client-ssl-context.ssl-session.packet-buffer-size=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D1\u30B1\u30C3\u30C8\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA\u3002
elytron.client-ssl-context.ssl-session.peer-host=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D4\u30A2\u30DB\u30B9\u30C8\u3002
elytron.client-ssl-context.ssl-session.peer-port=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D4\u30A2\u30DD\u30FC\u30C8\u3002
elytron.client-ssl-context.ssl-session.peer-principal=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D4\u30A2\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3002
elytron.client-ssl-context.ssl-session.protocol=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.client-ssl-context.ssl-session.valid=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u6027\u3002
elytron.client-ssl-context.ssl-session.local-certificates=SSLSession \u304B\u3089\u306E\u30ED\u30FC\u30AB\u30EB\u8A3C\u660E\u66F8\u3002
elytron.client-ssl-context.ssl-session.local-certificates.type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.client-ssl-context.ssl-session.local-certificates.algorithm=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.client-ssl-context.ssl-session.local-certificates.format=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u5F62\u5F0F\u3002
elytron.client-ssl-context.ssl-session.local-certificates.public-key=\u8A3C\u660E\u66F8\u306B\u95A2\u9023\u3059\u308B\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002
elytron.client-ssl-context.ssl-session.local-certificates.sha-1-digest=\u8A3C\u660E\u66F8\u306E SHA-1 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8 (\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.client-ssl-context.ssl-session.local-certificates.sha-256-digest=\u8A3C\u660E\u66F8\u306E SHA-256 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8(\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.client-ssl-context.ssl-session.local-certificates.encoded=\u8A3C\u660E\u66F8\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u5024\u3002
elytron.client-ssl-context.ssl-session.local-certificates.subject=\u8A3C\u660E\u66F8\u304B\u3089\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3002
elytron.client-ssl-context.ssl-session.local-certificates.issuer=\u8A3C\u660E\u66F8\u306E\u767A\u884C\u5143\u3002
elytron.client-ssl-context.ssl-session.local-certificates.not-before=\u8A3C\u660E\u66F8\u304C\u6709\u52B9\u306B\u306A\u308B\u958B\u59CB\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.client-ssl-context.ssl-session.local-certificates.not-after=\u8A3C\u660E\u66F8\u306E\u5931\u52B9\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.client-ssl-context.ssl-session.local-certificates.serial-number=\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u3002
elytron.client-ssl-context.ssl-session.local-certificates.signature-algorithm=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.client-ssl-context.ssl-session.local-certificates.signature=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3002
elytron.client-ssl-context.ssl-session.local-certificates.version=\u8A3C\u660E\u66F8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.client-ssl-context.ssl-session.peer-certificates=SSLSession \u304B\u3089\u306E\u30D4\u30A2\u8A3C\u660E\u66F8\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.algorithm=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.format=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u5F62\u5F0F\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.public-key=\u8A3C\u660E\u66F8\u306B\u95A2\u9023\u3059\u308B\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.sha-1-digest=\u8A3C\u660E\u66F8\u306E SHA-1 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8 (\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.sha-256-digest=\u8A3C\u660E\u66F8\u306E SHA-256 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8(\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.encoded=\u8A3C\u660E\u66F8\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u5024\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.subject=\u8A3C\u660E\u66F8\u304B\u3089\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.issuer=\u8A3C\u660E\u66F8\u306E\u767A\u884C\u5143\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.not-before=\u8A3C\u660E\u66F8\u304C\u6709\u52B9\u306B\u306A\u308B\u958B\u59CB\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.not-after=\u8A3C\u660E\u66F8\u306E\u5931\u52B9\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.serial-number=\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.signature-algorithm=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.signature=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3002
elytron.client-ssl-context.ssl-session.peer-certificates.version=\u8A3C\u660E\u66F8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.client-ssl-context.ssl-session.invalidate=SSLSession \u306E\u7121\u52B9\u5316 (\u6CE8\u8A18\: \u3053\u308C\u306F\u73FE\u5728\u306E\u63A5\u7D9A\u3092\u7D42\u4E86\u3057\u307E\u305B\u3093\u304C\u3001\u3055\u3089\u306A\u308B\u63A5\u7D9A\u304C\u3053\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u306B\u53C2\u52A0\u3057\u305F\u308A\u3001\u3053\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u3092\u518D\u958B\u3057\u306A\u3044\u3088\u3046\u306B\u3057\u307E\u3059)\u3002
elytron.server-ssl-context=\u63A5\u7D9A\u306E\u30B5\u30FC\u30D0\u30FC\u5074\u3067\u4F7F\u7528\u3059\u308B SSLContext\u3002
elytron.server-ssl-context.add=SSLContext \u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.server-ssl-context.remove=SSLContext \u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.server-ssl-context.security-domain=SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u78BA\u7ACB\u4E2D\u306B\u8A8D\u8A3C\u306B\u4F7F\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u3002
elytron.server-ssl-context.cipher-suite-filter=\u6709\u52B9\u5316\u3055\u308C\u305F\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u3092\u6307\u5B9A\u3059\u308B\u305F\u3081\u306B\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
elytron.server-ssl-context.protocols=\u6709\u52B9\u5316\u3055\u308C\u305F\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.server-ssl-context.want-client-auth=SSL \u30CF\u30F3\u30C9\u30B7\u30A7\u30A4\u30AF\u3067\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A3C\u660E\u66F8\u3092\u8981\u6C42\u3057\u307E\u3059 (\u5FC5\u8981\u3068\u306F\u3057\u307E\u305B\u3093)\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u304C\u53C2\u7167\u3055\u308C\u3001 X509 \u8A3C\u660E\u66F8\u306E\u30A8\u30D3\u30C7\u30F3\u30B9\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u5834\u5408\u3001\u81EA\u52D5\u7684\u306B true \u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002need-client-auth \u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
elytron.server-ssl-context.need-client-auth=SSL \u30CF\u30F3\u30C9\u30B7\u30A7\u30A4\u30AF\u3067\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A3C\u660E\u66F8\u3092\u5FC5\u8981\u3068\u3057\u307E\u3059\u3002\u4FE1\u983C\u3055\u308C\u305F\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A3C\u660E\u66F8\u304C\u306A\u3044\u63A5\u7D9A (trust-manager \u3092\u53C2\u7167) \u306F\u62D2\u5426\u3055\u308C\u307E\u3059\u3002
elytron.server-ssl-context.authentication-optional=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u306B\u3088\u3063\u3066\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A3C\u660E\u66F8\u304C\u62D2\u5426\u3055\u308C\u3066\u3082\u63A5\u7D9A\u306F\u963B\u6B62\u3055\u308C\u307E\u305B\u3093\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u306B\u3088\u3063\u3066\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u8A3C\u660E\u66F8\u304C\u62D2\u5426\u3055\u308C\u305F\u3068\u304D\u306B\u3001\u30D5\u30A9\u30FC\u30EB\u30B9\u30EB\u30FC\u306B\u3088\u308B\u4ED6\u306E\u8A8D\u8A3C\u30E1\u30AB\u30CB\u30BA\u30E0 (\u30ED\u30B0\u30A4\u30F3\u306A\u3069) \u306E\u4F7F\u7528\u3092\u8A31\u53EF\u3057\u307E\u3059\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30C9\u30E1\u30A4\u30F3\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u5BFE\u8C61\u306B\u306A\u308A\u307E\u3059\u3002
elytron.server-ssl-context.use-cipher-suites-order=\u30ED\u30FC\u30AB\u30EB\u306E\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u8A2D\u5B9A\u3092\u5C0A\u91CD\u3059\u308B\u3002
elytron.server-ssl-context.maximum-session-cache-size=\u30AD\u30E3\u30C3\u30B7\u30E5\u3067\u306E SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6700\u5927\u6570\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F -1 \u3067\u3001JVM \u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002\u5024\u3092 0 \u306B\u3059\u308B\u3068\u7121\u5236\u9650\u306B\u306A\u308A\u307E\u3059\u3002
elytron.server-ssl-context.session-timeout=SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F -1 \u3067\u3001JVM \u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002\u5024\u3092 0 \u306B\u3059\u308B\u3068\u7121\u5236\u9650\u306B\u306A\u308A\u307E\u3059\u3002
elytron.server-ssl-context.wrap=\u8FD4\u3055\u308C\u305F SSLEngine\u3001SSLSocket\u3001\u304A\u3088\u3073 SSLServerSocket \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u30E9\u30C3\u30D7\u3057\u3001\u3055\u3089\u306B\u7DE8\u96C6\u3055\u308C\u306A\u3044\u3088\u3046\u306B\u4FDD\u8B77\u3059\u308B\u304B\u3069\u3046\u304B\u3002
elytron.server-ssl-context.key-manager=SSLContext \u5185\u3067\u4F7F\u7528\u3059\u308B\u30AD\u30FC\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.server-ssl-context.key-refresh=SSLContext \u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B KeyManager \u3092\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
elytron.server-ssl-context.trust-manager=SSLContext \u5185\u3067\u4F7F\u7528\u3059\u308B\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3078\u306E\u53C2\u7167\u3002
elytron.server-ssl-context.pre-realm-principal-transformer=\u30EC\u30EB\u30E0\u304C\u9078\u629E\u3055\u308C\u308B\u524D\u306B\u9069\u7528\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3002
elytron.server-ssl-context.post-realm-principal-transformer=\u30EC\u30EB\u30E0\u304C\u9078\u629E\u3055\u308C\u305F\u5F8C\u306B\u9069\u7528\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3002
elytron.server-ssl-context.final-principal-transformer=\u3053\u306E\u30E1\u30AB\u30CB\u30BA\u30E0\u30EC\u30EB\u30E0\u306B\u9069\u7528\u3059\u308B\u6700\u7D42\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u30FC\u3002
elytron.server-ssl-context.realm-mapper=SSL \u8A8D\u8A3C\u306B\u4F7F\u7528\u3055\u308C\u308B\u30EC\u30EB\u30E0\u30DE\u30C3\u30D1\u30FC\u3002
elytron.server-ssl-context.provider-name=\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u306F\u3001\u3059\u3079\u3066\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C SSLContext \u3078\u6E21\u3055\u308C\u307E\u3059\u3002
elytron.server-ssl-context.providers=SSLContext \u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B Provider [] \u3092\u53D6\u5F97\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002
elytron.server-ssl-context.active-session-count=\u73FE\u5728\u30A2\u30AF\u30C6\u30A3\u30D6\u306A\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6570\u3002
elytron.server-ssl-context.ssl-session=\u73FE\u5728\u78BA\u7ACB\u3055\u308C\u3066\u3044\u308B SSL \u30BB\u30C3\u30B7\u30E7\u30F3\u3002
elytron.server-ssl-context.ssl-session.application-buffer-size=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA\u3002
elytron.server-ssl-context.ssl-session.cipher-suite=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u9078\u629E\u6E08\u307F\u306E\u6697\u53F7\u30B9\u30A4\u30FC\u30C8\u3002
elytron.server-ssl-context.ssl-session.creation-time=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u4F5C\u6210\u6642\u9593\u3002
elytron.server-ssl-context.ssl-session.last-accessed-time=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u6700\u7D42\u30A2\u30AF\u30BB\u30B9\u6642\u3002
elytron.server-ssl-context.ssl-session.local-principal=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30ED\u30FC\u30AB\u30EB\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3002
elytron.server-ssl-context.ssl-session.packet-buffer-size=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D1\u30B1\u30C3\u30C8\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA\u3002
elytron.server-ssl-context.ssl-session.peer-host=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D4\u30A2\u30DB\u30B9\u30C8\u3002
elytron.server-ssl-context.ssl-session.peer-port=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D4\u30A2\u30DD\u30FC\u30C8\u3002
elytron.server-ssl-context.ssl-session.peer-principal=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D4\u30A2\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3002
elytron.server-ssl-context.ssl-session.protocol=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30D7\u30ED\u30C8\u30B3\u30EB\u3002
elytron.server-ssl-context.ssl-session.valid=SSLSession \u306B\u3088\u3063\u3066\u5831\u544A\u3055\u308C\u305F\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6709\u52B9\u6027\u3002
elytron.server-ssl-context.ssl-session.local-certificates=SSLSession \u304B\u3089\u306E\u30ED\u30FC\u30AB\u30EB\u8A3C\u660E\u66F8\u3002
elytron.server-ssl-context.ssl-session.local-certificates.type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.server-ssl-context.ssl-session.local-certificates.algorithm=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.server-ssl-context.ssl-session.local-certificates.format=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u5F62\u5F0F\u3002
elytron.server-ssl-context.ssl-session.local-certificates.public-key=\u8A3C\u660E\u66F8\u306B\u95A2\u9023\u3059\u308B\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002
elytron.server-ssl-context.ssl-session.local-certificates.sha-1-digest=\u8A3C\u660E\u66F8\u306E SHA-1 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8 (\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.server-ssl-context.ssl-session.local-certificates.sha-256-digest=\u8A3C\u660E\u66F8\u306E SHA-256 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8(\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.server-ssl-context.ssl-session.local-certificates.encoded=\u8A3C\u660E\u66F8\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u5024\u3002
elytron.server-ssl-context.ssl-session.local-certificates.subject=\u8A3C\u660E\u66F8\u304B\u3089\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3002
elytron.server-ssl-context.ssl-session.local-certificates.issuer=\u8A3C\u660E\u66F8\u306E\u767A\u884C\u5143\u3002
elytron.server-ssl-context.ssl-session.local-certificates.not-before=\u8A3C\u660E\u66F8\u304C\u6709\u52B9\u306B\u306A\u308B\u958B\u59CB\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.server-ssl-context.ssl-session.local-certificates.not-after=\u8A3C\u660E\u66F8\u306E\u5931\u52B9\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.server-ssl-context.ssl-session.local-certificates.serial-number=\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u3002
elytron.server-ssl-context.ssl-session.local-certificates.signature-algorithm=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.server-ssl-context.ssl-session.local-certificates.signature=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3002
elytron.server-ssl-context.ssl-session.local-certificates.version=\u8A3C\u660E\u66F8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.server-ssl-context.ssl-session.peer-certificates=SSLSession \u304B\u3089\u306E\u30D4\u30A2\u8A3C\u660E\u66F8\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.type=\u8A3C\u660E\u66F8\u306E\u30BF\u30A4\u30D7\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.algorithm=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.format=\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u306E\u5F62\u5F0F\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.public-key=\u8A3C\u660E\u66F8\u306B\u95A2\u9023\u3059\u308B\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u30D1\u30D6\u30EA\u30C3\u30AF\u30AD\u30FC\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.sha-1-digest=\u8A3C\u660E\u66F8\u306E SHA-1 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8 (\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.sha-256-digest=\u8A3C\u660E\u66F8\u306E SHA-256 \u30C0\u30A4\u30B8\u30A7\u30B9\u30C8(\u30D5\u30A3\u30F3\u30AC\u30FC\u30D7\u30EA\u30F3\u30C8)\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.encoded=\u8A3C\u660E\u66F8\u306E\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F\u5024\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.subject=\u8A3C\u660E\u66F8\u304B\u3089\u306E\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.issuer=\u8A3C\u660E\u66F8\u306E\u767A\u884C\u5143\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.not-before=\u8A3C\u660E\u66F8\u304C\u6709\u52B9\u306B\u306A\u308B\u958B\u59CB\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.not-after=\u8A3C\u660E\u66F8\u306E\u5931\u52B9\u65E5\u304A\u3088\u3073\u6642\u9593\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.serial-number=\u8A3C\u660E\u66F8\u306E\u30B7\u30EA\u30A2\u30EB\u756A\u53F7\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.signature-algorithm=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3092\u751F\u6210\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.signature=\u8A3C\u660E\u66F8\u306E\u7F72\u540D\u3002
elytron.server-ssl-context.ssl-session.peer-certificates.version=\u8A3C\u660E\u66F8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.server-ssl-context.ssl-session.invalidate=SSLSession \u306E\u7121\u52B9\u5316 (\u6CE8\u8A18\: \u3053\u308C\u306F\u73FE\u5728\u306E\u63A5\u7D9A\u3092\u7D42\u4E86\u3057\u307E\u305B\u3093\u304C\u3001\u3055\u3089\u306A\u308B\u63A5\u7D9A\u304C\u3053\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u306B\u53C2\u52A0\u3057\u305F\u308A\u3001\u3053\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u3092\u518D\u958B\u3057\u306A\u3044\u3088\u3046\u306B\u3057\u307E\u3059)\u3002
elytron.credential-store=\u5916\u90E8\u30B5\u30FC\u30D3\u30B9\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u306A\u3069\u306E\u6A5F\u5BC6\u6027\u306E\u9AD8\u3044\u60C5\u5831\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u3002
elytron.credential-store.name=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D\u3002
elytron.credential-store.type=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u578B (\u4F8B\: KeyStoreCredentialStore)
elytron.credential-store.credential-reference=\u4FDD\u8B77\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3055\u308C\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u53C2\u7167\u3002
elytron.credential-store.credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D\u3002
elytron.credential-store.credential-reference.alias=\u30B9\u30C8\u30A2\u306B\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.credential-store.credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7\u3002
elytron.credential-store.credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6\u3002\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044\u3002
elytron.credential-store.loaded-provider=\u3053\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u578B\u306E\u5B9F\u88C5\u3092\u30ED\u30FC\u30C9\u3057\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306B\u95A2\u3059\u308B\u60C5\u5831\u3002
elytron.credential-store.loaded-provider.name=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30ED\u30FC\u30C0\u30FC\u306E\u540D\u524D\u3002
elytron.credential-store.loaded-provider.info=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30ED\u30FC\u30C0\u30FC\u306B\u95A2\u3059\u308B\u60C5\u5831\u6587\u5B57\u5217\u3002
elytron.credential-store.loaded-provider.version=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
elytron.credential-store.providers=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u53D6\u5F97\u3057\u3066\u5FC5\u8981\u306A CredentialStore \u578B\u3092\u4F5C\u6210\u3067\u304D\u308B\u3082\u306E\u3092\u691C\u7D22\u3059\u308B\u305F\u3081\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u5185\u306B\u5B9A\u7FA9\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u3001\u4EE3\u308F\u308A\u306B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u30EA\u30B9\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.credential-store.other-providers=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u53D6\u5F97\u3057\u3001\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u5185\u3067\u5FC5\u8981\u3068\u306A\u308B JCA \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u4F5C\u6210\u3067\u304D\u308B\u3082\u306E\u3092\u691C\u7D22\u3059\u308B\u305F\u3081\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u5185\u306B\u5B9A\u7FA9\u3055\u308C\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002\u30AD\u30FC\u30B9\u30C8\u30A2\u30D9\u30FC\u30B9\u306E CredentialStore \u306E\u307F\u306B\u6709\u52B9\u3067\u3059\u3002\u6307\u5B9A\u306E\u306A\u3044\u5834\u5408\u306F\u3001\u4EE3\u308F\u308A\u306B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u30EA\u30B9\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.credential-store.provider-name=CredentialStoreSpi \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u306B\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u6307\u5B9A\u3055\u308C\u305F 'type' \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3067\u304D\u308B\u6700\u521D\u306B\u898B\u3064\u304B\u3063\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.credential-store.implementation-properties=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u5B9F\u88C5\u306B\u56FA\u6709\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u30DE\u30C3\u30D7\u3002
elytron.credential-store.location=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u30B9\u30C8\u30EC\u30FC\u30B8\u306E\u30D5\u30A1\u30A4\u30EB\u540D\u3002
elytron.credential-store.modifiable=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u5909\u66F4\u53EF\u80FD\u3067\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
elytron.credential-store.create=\u30B9\u30C8\u30EC\u30FC\u30B8\u304C\u5B58\u5728\u3057\u306A\u3044\u3068\u304D\u306B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30B9\u30C8\u30EC\u30FC\u30B8\u3092\u4F5C\u6210\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
elytron.credential-store.relative-to=\u30D5\u30A1\u30A4\u30EB\u540D\u306E\u76F8\u5BFE\u30D1\u30B9\u306E\u8D77\u70B9\u3068\u306A\u308B\u4EE5\u524D\u5B9A\u7FA9\u3055\u308C\u305F\u30D1\u30B9\u3078\u306E\u53C2\u7167\u3002
elytron.credential-store.add=\u5225\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u3092\u8A2D\u5B9A\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.credential-store.remove=\u8A2D\u5B9A\u304B\u3089\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.credential-store.reload=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u30EA\u30ED\u30FC\u30C9 (\u5B58\u5728\u3059\u308B\u5834\u5408\u306F\u65B0\u3057\u3044\u30C7\u30FC\u30BF\u3092\u518D\u5EA6\u521D\u671F\u5316\u3057\u3001\u30ED\u30FC\u30C9\u3057\u307E\u3059)\u3002
elytron.credential-store.state=\u8D77\u52D5\u6642\u306B\u3053\u306E\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u3092\u8868\u3059\u57FA\u76E4\u306E\u30B5\u30FC\u30D3\u30B9\u306E\u72B6\u614B\u3002
elytron.credential-store.read-aliases=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304B\u3089\u30A8\u30A4\u30EA\u30A2\u30B9 (\u30A8\u30F3\u30C8\u30EA\u30FC) \u3092\u8AAD\u307F\u53D6\u308A\u307E\u3059\u3002
elytron.credential-store.add-alias=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306B\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.credential-store.add-alias.alias=\u8FFD\u52A0\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u30A2\u30A4\u30C6\u30E0\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.credential-store.add-alias.entry-type=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306B\u4FDD\u5B58\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30A8\u30F3\u30C8\u30EA\u30FC) \u306E\u30BF\u30A4\u30D7\u3002
elytron.credential-store.add-alias.secret-value=\u30D1\u30B9\u30EF\u30FC\u30C9\u306A\u3069\u306E\u79D8\u5BC6\u306E\u5024\u3002
elytron.credential-store.remove-alias=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306B\u4FDD\u5B58\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30A8\u30F3\u30C8\u30EA\u30FC) \u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.credential-store.remove-alias.alias=\u524A\u9664\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u30A2\u30A4\u30C6\u30E0\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.credential-store.set-secret=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306B\u4FDD\u5B58\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30A8\u30F3\u30C8\u30EA\u30FC) \u306E\u79D8\u5BC6\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
elytron.credential-store.set-secret.alias=\u8A2D\u5B9A\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.credential-store.set-secret.entry-type=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306B\u4FDD\u5B58\u3055\u308C\u305F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB (\u30A8\u30F3\u30C8\u30EA\u30FC) \u306E\u30BF\u30A4\u30D7\u3002
elytron.credential-store.set-secret.secret-value=\u30D1\u30B9\u30EF\u30FC\u30C9\u306A\u3069\u306E\u79D8\u5BC6\u306E\u5024\u3002
elytron.dir-context=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FC (LDAP) \u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3059\u308B\u8A2D\u5B9A\u3002
elytron.dir-context.add=DirContext \u5B9A\u7FA9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
elytron.dir-context.remove=DirContext \u5B9A\u7FA9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
elytron.dir-context.url=\u63A5\u7D9A URL\u3002
elytron.dir-context.authentication-level=\u4F7F\u7528\u3059\u308B\u8A8D\u8A3C\u30EC\u30D9\u30EB (\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FC\u30EC\u30D9\u30EB/\u8A8D\u8A3C\u30E1\u30AB\u30CB\u30BA\u30E0)\u3002SECURITY_AUTHENTICATION ("java.naming.security.authentication") \u74B0\u5883\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306B\u5BFE\u5FDC\u3057\u307E\u3059\u3002\u8A31\u53EF\u3055\u308C\u308B\u5024\: "none"\u3001"simple"\u3001sasl_mech (sasl_mech \u306F SASL \u30E1\u30AB\u30CB\u30BA\u30E0\u540D\u306E\u30B9\u30DA\u30FC\u30B9\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3067\u3059)\u3002
elytron.dir-context.authentication-context=\u30ED\u30B0\u30A4\u30F3\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u53D6\u5F97\u3057\u3066 LDAP \u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3059\u308B\u8A8D\u8A3C\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3002\u8A8D\u8A3C\u30EC\u30D9\u30EB\u304C "none" (\u533F\u540D) \u306E\u5834\u5408\u306F\u7701\u7565\u3067\u304D\u307E\u3059\u3002
elytron.dir-context.principal=LDAP \u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3057\u3066\u8A8D\u8A3C\u3057\u3001\u63A5\u7D9A\u3059\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3002\u8A8D\u8A3C\u30EC\u30D9\u30EB\u304C "none" (\u533F\u540D) \u306E\u5834\u5408\u306F\u7701\u7565\u3067\u304D\u307E\u3059\u3002
elytron.dir-context.credential-reference=LDAP \u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3057\u3066\u8A8D\u8A3C\u3057\u3001\u63A5\u7D9A\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u53C2\u7167\u3002\u8A8D\u8A3C\u30EC\u30D9\u30EB\u304C "none" (\u533F\u540D) \u306E\u5834\u5408\u306F\u7701\u7565\u3067\u304D\u307E\u3059\u3002
elytron.dir-context.credential-reference.store=\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4FDD\u6301\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u306E\u540D\u524D\u3002
elytron.dir-context.credential-reference.alias=\u30B9\u30C8\u30A2\u306B\u4FDD\u5B58\u3055\u308C\u305F\u79D8\u5BC6\u307E\u305F\u306F\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u3092\u610F\u5473\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u3002
elytron.dir-context.credential-reference.type=\u3053\u306E\u53C2\u7167\u304C\u610F\u5473\u3059\u308B\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u306E\u30BF\u30A4\u30D7\u3002
elytron.dir-context.credential-reference.clear-text=\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u6307\u5B9A\u3055\u308C\u305F\u79D8\u5BC6\u3002\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u30B9\u30C8\u30A2\u304C\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB/ \u79D8\u5BC6\u3092\u30B5\u30FC\u30D3\u30B9\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u304F\u3060\u3055\u3044\u3002
elytron.dir-context.enable-connection-pooling=\u63A5\u7D9A\u30D7\u30FC\u30EB\u304C\u6709\u52B9\u3067\u3042\u308B\u304B\u3092\u793A\u3057\u307E\u3059\u3002
elytron.dir-context.module=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C7\u30A3\u30F3\u30B0\u30D9\u30FC\u30B9\u3068\u3057\u3066\u4F7F\u7528\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D\u3002
elytron.dir-context.referral-mode=\u7D39\u4ECB\u306B\u5F93\u3046\u304B\u3002
elytron.dir-context.ssl-context=LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u306E\u30BB\u30AD\u30E5\u30A2\u306A\u63A5\u7D9A\u306B\u4F7F\u7528\u3055\u308C\u308B ssl-context \u306E\u540D\u524D\u3002
elytron.dir-context.connection-timeout=LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306B\u5BFE\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
elytron.dir-context.read-timeout=LDAP \u64CD\u4F5C\u306E\u8AAD\u307F\u53D6\u308A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u3002
elytron.dir-context.properties=DirContext \u306E\u8FFD\u52A0\u306E\u63A5\u7D9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
elytron.policy=\u30DD\u30EA\u30B7\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u30BB\u30C3\u30C8\u30A2\u30C3\u30D7\u3059\u308B\u5B9A\u7FA9\u3002
elytron.policy.add=\u30DD\u30EA\u30B7\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u8FFD\u52A0\u3059\u308B\u305F\u3081\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.policy.remove=\u30DD\u30EA\u30B7\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u524A\u9664\u3059\u308B\u305F\u3081\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.policy.default-policy=\u30C7\u30D5\u30A9\u30EB\u30C8\u30DD\u30EA\u30B7\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u30EA\u30BD\u30FC\u30B9\u306E\u540D\u524D\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
elytron.policy.jacc-policy=JACC \u304A\u3088\u3073\u95A2\u9023\u3059\u308B\u30B5\u30FC\u30D3\u30B9\u3092\u30BB\u30C3\u30C8\u30A2\u30C3\u30D7\u3059\u308B\u30DD\u30EA\u30B7\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u5B9A\u7FA9\u3002
elytron.policy.jacc-policy.name=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u3002
elytron.policy.jacc-policy.policy=\u30DD\u30EA\u30B7\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u53C2\u7167\u3059\u308B java.security.Policy \u5B9F\u88C5\u306E\u540D\u524D\u3002
elytron.policy.jacc-policy.configuration-factory=\u30DD\u30EA\u30B7\u30FC\u8A2D\u5B9A\u30D5\u30A1\u30AF\u30C8\u30EA\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u53C2\u7167\u3059\u308B javax.security.jacc.PolicyConfigurationFactory \u5B9F\u88C5\u306E\u540D\u524D\u3002
elytron.policy.jacc-policy.module=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30ED\u30FC\u30C9\u5143\u3068\u306A\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D\u3002
elytron.policy.custom-policy=\u30AB\u30B9\u30BF\u30E0\u306E\u30DD\u30EA\u30B7\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u5B9A\u7FA9\u3002
elytron.policy.custom-policy.add=\u30AB\u30B9\u30BF\u30E0\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u8FFD\u52A0\u3059\u308B\u305F\u3081\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002
elytron.policy.custom-policy.remove=\u30AB\u30B9\u30BF\u30E0\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u524A\u9664\u3059\u308B\u305F\u3081\u306E\u524A\u9664\u64CD\u4F5C\u3002
elytron.policy.custom-policy.name=\u3053\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D
elytron.policy.custom-policy.class-name=\u30DD\u30EA\u30B7\u30FC\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u3092\u53C2\u7167\u3059\u308B java.security.Policy \u5B9F\u88C5\u306E\u540D\u524D\u3002
elytron.policy.custom-policy.module=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30ED\u30FC\u30C9\u5143\u3068\u306A\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D\u3002
