elytron=El subsistema Elytron
elytron.add=La operaci\u00F3n agrega el subsistema Elytron
elytron.remove=La operaci\u00F3n retira el subsistema Elytron
elytron.default-authentication-context=El contexto predeterminado de autenticaci\u00F3n que debe asociarse a todas las implementaciones
elytron.initial-providers=Referencia a los proveedores que se deben registrar antes que todos los proveedores existentes.
elytron.final-providers=Referencia a los proveedores que se deben registrar despu\u00E9s de todos los proveedores existentes.
elytron.disallowed-providers=Una lista de proveedores no permitidos, los cuales ser\u00E1n retirados de la lista de proveedores.
elytron.security-properties=Propiedades de seguridad que deben configurarse.
elytron.authentication-configuration=Una definici\u00F3n de la configuraci\u00F3n de autenticaci\u00F3n individual.
elytron.authentication-configuration.add=Agregue una nueva definici\u00F3n de configuraci\u00F3n de autenticaci\u00F3n.
elytron.authentication-configuration.remove=Elimine la definici\u00F3n de la configuraci\u00F3n de autenticaci\u00F3n.
elytron.authentication-configuration.extends=Una configuraci\u00F3n de autenticaci\u00F3n definida previamente para ampliar.
elytron.authentication-configuration.anonymous=Permite la autenticaci\u00F3n an\u00F3nima
elytron.authentication-configuration.authentication-name=Nombre de autenticaci\u00F3n que debe utilizarse.
elytron.authentication-configuration.authorization-name=El nombre de autorizaci\u00F3n a ser utilizado.
elytron.authentication-configuration.host=El host a ser utilizado.
elytron.authentication-configuration.port=El puerto a ser utilizado.
elytron.authentication-configuration.protocol=El protocolo a ser utilizado.
elytron.authentication-configuration.realm=El dominio a ser utilizado.
elytron.authentication-configuration.security-domain=Referencia a un dominio de seguridad para obtener una identidad reenviada.
elytron.authentication-configuration.sasl-mechanism-selector=La cadena del selector del mecanismo SASL.
elytron.authentication-configuration.mechanism-properties=Propiedades de configuraci\u00F3n del mecanismo de autenticaci\u00F3n SASL.
elytron.authentication-configuration.mechanism-properties.name=Nombre de la propiedad.
elytron.authentication-configuration.mechanism-properties.value=Valor de la propiedad.
elytron.authentication-configuration.credential-reference=La referencia a la credencial almacenada en CredentialStore bajo el alias definido o la contrase\u00F1a del texto sin cifrar.
elytron.authentication-configuration.credential-reference.store=El nombre del almac\u00E9n de credenciales que mantiene el alias en la credencial.
elytron.authentication-configuration.credential-reference.alias=El alias que designa un secreto almacenado o una credencial almacenada en el almac\u00E9n.
elytron.authentication-configuration.credential-reference.type=El tipo de credencial que designa esta referencia.
elytron.authentication-configuration.credential-reference.clear-text=Secreto especificado mediante texto sin cifrar. Verifique la manera en que el almac\u00E9n de credenciales proporciona credenciales/secretos a servicios.
elytron.authentication-configuration.kerberos-security-factory=Referencia a una f\u00E1brica de seguridad kerberos utilizada para obtener una credencial kerberos GSS
elytron.authentication-context=Una definici\u00F3n del contexto de autenticaci\u00F3n individual.
elytron.authentication-context.add=Agregue una nueva definici\u00F3n del contexto de autenticaci\u00F3n.
elytron.authentication-context.remove=Elimine la definici\u00F3n authentication-context.
elytron.authentication-context.extends=Un contexto de autenticaci\u00F3n definido previamente para ampliar.
elytron.authentication-context.match-rules=Las match-rules para este contexto de autenticaci\u00F3n.
elytron.authentication-context.match-rules.match-abstract-type=El tipo abstracto con el cual se debe coincidir
elytron.authentication-context.match-rules.match-abstract-type-authority=La autoridad del tipo abstracto con la cual se debe coincidir.
elytron.authentication-context.match-rules.match-host=El host con el cual se debe coincidir
elytron.authentication-context.match-rules.match-local-security-domain=El dominio de seguridad local con el cual se debe coincidir
elytron.authentication-context.match-rules.match-no-user=No se encontr\u00F3 coincidencia con ning\u00FAn usuario
elytron.authentication-context.match-rules.match-path=El parche con el cual se debe coincidir
elytron.authentication-context.match-rules.match-port=El puerto con el cual se debe coincidir
elytron.authentication-context.match-rules.match-protocol=El protocolo con el cual se debe coincidir
elytron.authentication-context.match-rules.match-urn=La URN con la cual se debe coincidir.
elytron.authentication-context.match-rules.match-user=El usuario con el cual se debe coincidir.
elytron.authentication-context.match-rules.authentication-configuration=La configuraci\u00F3n de autenticaci\u00F3n a utilizar para una coincidencia exitosa.
elytron.authentication-context.match-rules.ssl-context=El contexto SSL a usar para una coincidencia exitosa.
elytron.aggregate-providers=Adici\u00F3n de dos o m\u00E1s recursos de proveedor[].
elytron.aggregate-providers.add=Operaci\u00F3n de agregar para el recurso de proveedores agregados
elytron.aggregate-providers.remove=Operaci\u00F3n de eliminaci\u00F3n del recurso de los proveedores agregados
elytron.aggregate-providers.providers=Los recursos del Proveedor[] referenciado para agregar.
elytron.provider-loader=Una definici\u00F3n para un cargador de proveedores.
elytron.provider-loader.add=Agregue una nueva definici\u00F3n del cargador de proveedores.
elytron.provider-loader.remove=Elimine una definici\u00F3n del cargador de proveedores.
elytron.provider-loader.module=El nombre del m\u00F3dulo desde donde cargar el proveedor.
elytron.provider-loader.class-names=Los nombres de clase completamente calificados de los proveedores a cargar se cargan despu\u00E9s de que el service-loader haya descubierto proveedores, y se omitir\u00E1n los duplicados.
elytron.provider-loader.path=La ruta del archivo a usar para inicializar los proveedores.
elytron.provider-loader.relative-to=La ruta de base del archivo de configuraci\u00F3n.
elytron.provider-loader.argument=Un argumento que se debe transmitir al constructor mientras el proveedor es instanciado.
elytron.provider-loader.configuration=La configuraci\u00F3n de la llave/valor que se debe transmitir al proveedor para inicializarlo.
elytron.provider-loader.loaded-providers=La lista de proveedores cargados por este cargador de proveedores
elytron.provider-loader.loaded-providers.name=El nombre informado por la instancia del proveedor.
elytron.provider-loader.loaded-providers.info=La informaci\u00F3n indicada por la instancia del proveedor.
elytron.provider-loader.loaded-providers.version=La versi\u00F3n informada por la instancia del proveedor.
elytron.provider-loader.loaded-providers.services=Lista de servicios disponibles de este proveedor.
elytron.provider-loader.loaded-providers.type=El tipo de servicio.
elytron.provider-loader.loaded-providers.algorithm=El algoritmo admitido por el servicio.
elytron.provider-loader.loaded-providers.class-name=El nombre de clase de la implementaci\u00F3n del SPI del servicio.
elytron.aggregate-security-event-listener=Adici\u00F3n de dos o m\u00E1s recursos del oyente del evento de seguridad.
elytron.aggregate-security-event-listener.add=La operaci\u00F3n de agregar para el recurso del oyente del evento de seguridad agregado.
elytron.aggregate-security-event-listener.remove=La operaci\u00F3n de eliminaci\u00F3n para el recurso del oyente del evento de seguridad agregado.
elytron.aggregate-security-event-listener.security-event-listeners=Los recursos del oyente del evento de seguridad al que se hace referencia.
elytron.file-audit-log=Un registrador de auditor\u00EDa que se registra en un archivo local.
elytron.file-audit-log.add=Agregar el recurso del registrador de auditor\u00EDa.
elytron.file-audit-log.remove=Elimine el recurso del registrador de auditor\u00EDa.
elytron.file-audit-log.path=Ruta del archivo que se debe escribir.
elytron.file-audit-log.relative-to=La ruta relativa al registro de auditor\u00EDa.
elytron.file-audit-log.synchronized=Si todos los eventos se deben sincronizar de inmediato con el disco.
elytron.file-audit-log.format=El formato a utilizar para registrar el evento de auditor\u00EDa.
elytron.periodic-rotating-file-audit-log=Una definici\u00F3n de registro de auditor\u00EDa para persistir un registro de auditor\u00EDa en un archivo local, rotando el registro despu\u00E9s de un per\u00EDodo de tiempo derivado de la cadena de sufijos dada, la cual debe ser en un formato comprendido por java.time.format.DateTimeFormatter.
elytron.periodic-rotating-file-audit-log.add=Agregue el recurso del registrador de auditor\u00EDa.
elytron.periodic-rotating-file-audit-log.remove=Elimine el recurso del registrador de auditor\u00EDa.
elytron.periodic-rotating-file-audit-log.path=Ruta del archivo que se debe escribir.
elytron.periodic-rotating-file-audit-log.relative-to=La ruta relativa al registro de auditor\u00EDa.
elytron.periodic-rotating-file-audit-log.synchronized=Si todos los eventos se deben sincronizar de inmediato con el disco.
elytron.periodic-rotating-file-audit-log.format=El formato a utilizar para registrar el evento de auditor\u00EDa.
elytron.periodic-rotating-file-audit-log.suffix=La cadena de sufijos que puede ser comprendida por java.time.format.DateTimeFormatter. El per\u00EDodo de la rotaci\u00F3n se calcula autom\u00E1ticamente con base en el sufijo.
elytron.size-rotating-file-audit-log=Una definici\u00F3n del registro de auditor\u00EDa para persistir un registro de auditor\u00EDa en un archivo local, rotando el registro despu\u00E9s de que el tama\u00F1o del archivo aumente m\u00E1s all\u00E1 de cierto punto y manteniendo un n\u00FAmero fijo de copias de seguridad.
elytron.size-rotating-file-audit-log.add=Agregue el recurso del registrador de auditor\u00EDa.
elytron.size-rotating-file-audit-log.remove=Elimine el recurso del registrador de auditor\u00EDa.
elytron.size-rotating-file-audit-log.path=Ruta del archivo que se debe escribir.
elytron.size-rotating-file-audit-log.relative-to=La ruta relativa al registro de auditor\u00EDa.
elytron.size-rotating-file-audit-log.synchronized=Si todos los eventos se deben sincronizar de inmediato con el disco.
elytron.size-rotating-file-audit-log.format=El formato a utilizar para registrar el evento de auditor\u00EDa.
elytron.size-rotating-file-audit-log.max-backup-index=El n\u00FAmero m\u00E1ximo de archivos para realizar copias de seguridad al rotar.
elytron.size-rotating-file-audit-log.rotate-size=El tama\u00F1o del archivo de registro en el que debe rotar el archivo.
elytron.size-rotating-file-audit-log.rotate-on-boot=Si el archivo se debe rotar antes de establecer un nuevo archivo.
elytron.size-rotating-file-audit-log.suffix=Formato de la fecha utilizada como sufijo de los nombres del archivo de registro en java.time.format.DateTimeFormatter. El sufijo no juega un rol en determinar el momento en que se debe rotar el archivo.
elytron.syslog-audit-log=Un registro de auditor\u00EDa que env\u00EDa eventos de auditor\u00EDa a un servidor syslog remoto.
elytron.syslog-audit-log.add=Agregue el recurso del registrador de auditor\u00EDa.
elytron.syslog-audit-log.remove=Elimine el recurso del registrador de auditor\u00EDa.
elytron.syslog-audit-log.server-address=La direcci\u00F3n del servidor syslog a la que deben enviarse los eventos.
elytron.syslog-audit-log.port=El puerto oyente en el servidor syslog.
elytron.syslog-audit-log.transport=El transporte a usar para conectarse al servidor syslog.
elytron.syslog-audit-log.format=El formato a utilizar para registrar el evento de auditor\u00EDa.
elytron.syslog-audit-log.host-name=El nombre del host para incorporar dentro de todos los eventos enviados al servidor syslog remoto.
elytron.syslog-audit-log.ssl-context=El SSLContext a usar para conectarse al servidor syslog cuando se utiliza el transporte SSL_TCP.
elytron.http-authentication-factory=El recurso que contiene la asociaci\u00F3n de un SecurityDomain con una HttpServerAuthenticationMechanismFactory.
elytron.http-authentication-factory.add=Agregue un nuevo recurso http-authentication-factory.
elytron.http-authentication-factory.remove=Elimine el recurso http-authentication-factory.
elytron.http-authentication-factory.security-domain=El SecurityDomain para asociar con este recurso
elytron.http-authentication-factory.http-server-mechanism-factory=La HttpServerAuthenticationMechanismFactory para asociar con este recurso
elytron.http-authentication-factory.mechanism-configurations=Configuraci\u00F3n espec\u00EDfica del mecanismo
elytron.http-authentication-factory.mechanism-configurations.mechanism-name=Esta configuraci\u00F3n solo se aplicar\u00E1 en los casos en que se utiliza un mecanismo con el nombre especificado. Si se omite este atributo, esto coincidir\u00E1 con cualquier nombre de mecanismo.
elytron.http-authentication-factory.mechanism-configurations.host-name=El nombre del host al que se aplica esta configuraci\u00F3n.
elytron.http-authentication-factory.mechanism-configurations.protocol=El protocolo al que se aplica esta configuraci\u00F3n.
elytron.http-authentication-factory.mechanism-configurations.pre-realm-principal-transformer=Un transformador principal para aplicar antes de seleccionar el dominio
elytron.http-authentication-factory.mechanism-configurations.post-realm-principal-transformer=Un transformador principal para aplicar despu\u00E9s de seleccionar el dominio
elytron.http-authentication-factory.mechanism-configurations.final-principal-transformer=Un transformador principal final para aplicar para este dominio del mecanismo
elytron.http-authentication-factory.mechanism-configurations.realm-mapper=El mapeador del dominio que el mecanismo debe usar
elytron.http-authentication-factory.mechanism-configurations.credential-security-factory=La f\u00E1brica de seguridad a usar para obtener una credencial, seg\u00FAn lo requerido por el mecanismo.
elytron.http-authentication-factory.mechanism-configurations.mechanism-realm-configurations=Definici\u00F3n de los nombres del dominio seg\u00FAn lo entiende el mecanismo
elytron.http-authentication-factory.mechanism-configurations.realm-name=El nombre del dominio que el mecanismo debe presentar
elytron.http-authentication-factory.available-mechanisms=Los mecanismos HTTP disponibles de esta configuraci\u00F3n despu\u00E9s de haberse aplicado todos los filtros.
elytron.sasl-authentication-factory=El recurso que contiene la asociaci\u00F3n de un SecurityDomain con una SaslServerFactory.
elytron.sasl-authentication-factory.add=Agregue un nuevo recurso sasl-authentication-factory.
elytron.sasl-authentication-factory.remove=Elimine el recurso sasl-authentication-factory
elytron.sasl-authentication-factory.security-domain=El SecurityDomain para asociar con este recurso
elytron.sasl-authentication-factory.sasl-server-factory=El SaslServerFactory para asociar con este recurso
elytron.sasl-authentication-factory.mechanism-configurations=Configuraci\u00F3n espec\u00EDfica del mecanismo
elytron.sasl-authentication-factory.mechanism-configurations.mechanism-name=Esta configuraci\u00F3n solo se aplicar\u00E1 en los casos en que se utiliza un mecanismo con el nombre especificado. Si se omite este atributo, esto coincidir\u00E1 con cualquier nombre de mecanismo.
elytron.sasl-authentication-factory.mechanism-configurations.host-name=El nombre del host al que se aplica esta configuraci\u00F3n.
elytron.sasl-authentication-factory.mechanism-configurations.protocol=El protocolo al que se aplica esta configuraci\u00F3n.
elytron.sasl-authentication-factory.mechanism-configurations.pre-realm-principal-transformer=Un transformador principal para aplicar antes de seleccionar el dominio
elytron.sasl-authentication-factory.mechanism-configurations.post-realm-principal-transformer=Un transformador principal para aplicar despu\u00E9s de seleccionar el dominio
elytron.sasl-authentication-factory.mechanism-configurations.final-principal-transformer=Un transformador principal final para aplicar para este dominio del mecanismo
elytron.sasl-authentication-factory.mechanism-configurations.realm-mapper=El mapeador del dominio que el mecanismo debe usar
elytron.sasl-authentication-factory.mechanism-configurations.credential-security-factory=La f\u00E1brica de seguridad a usar para obtener una credencial, seg\u00FAn lo requerido por el mecanismo.
elytron.sasl-authentication-factory.mechanism-configurations.mechanism-realm-configurations=Definici\u00F3n de los nombres del dominio seg\u00FAn lo entiende el mecanismo
elytron.sasl-authentication-factory.mechanism-configurations.realm-name=El nombre del dominio que el mecanismo debe presentar
elytron.sasl-authentication-factory.available-mechanisms=Los mecanismos SASL disponibles de esta configuraci\u00F3n despu\u00E9s de haberse aplicado todos los filtros.
elytron.security-domain=Definici\u00F3n de un dominio de seguridad.
elytron.security-domain.add=La operaci\u00F3n de agregar para una definici\u00F3n del dominio de seguridad.
elytron.security-domain.remove=La operaci\u00F3n de agregar para una definici\u00F3n del dominio de seguridad.
elytron.security-domain.read-identity=Lee una identidad del dominio de seguridad, si existe.
elytron.security-domain.read-identity.name=El nombre de la identidad a leer.
elytron.security-domain.authenticate=Una operaci\u00F3n temporal que debe usarse para probar la autenticaci\u00F3n.
elytron.security-domain.authenticate.username=Nombre de usuario con el cual autenticar
elytron.security-domain.authenticate.password=La contrase\u00F1a para el nombre de usuario dado.
elytron.security-domain.pre-realm-principal-transformer=Referencia a un transformador principal para aplicar antes de seleccionar el dominio.
elytron.security-domain.post-realm-principal-transformer=Referencia a un transformador principal para aplicar despu\u00E9s de que el dominio haya operado en el nombre de identidad suministrado.
elytron.security-domain.permission-mapper=Referencia a un PermissionMapper que va a ser utilizado por este dominio.
elytron.security-domain.principal-decoder=Referencia a un PrincipalDecoder que va a ser utilizado por este dominio.
elytron.security-domain.realm-mapper=Referencia a un RealmMapper que va a ser utilizado por este dominio.
elytron.security-domain.role-mapper=Referencia al RoleMapper que va a ser utilizado por este dominio.
elytron.security-domain.security-event-listener=Referencia a un oyente para eventos de seguridad.
elytron.security-domain.default-realm=El dominio predeterminado contenido por este dominio de seguridad.
elytron.security-domain.realms=La lista de dominios contenidos por este dominio de seguridad.
elytron.security-domain.realms.realm=Referencia a un dominio de seguridad individual.
elytron.security-domain.realms.principal-transformer=Un transformador principal para asociarse al dominio
elytron.security-domain.realms.role-decoder=Una referencia a RoleDecoder para asociarse con el dominio.
elytron.security-domain.realms.role-mapper=Una referencia a RoleMapper para asociarse con el dominio.
elytron.security-domain.trusted-security-domains=La lista de dominios de seguridad en los que este dominio de seguridad conf\u00EDa.
elytron.security-domain.outflow-security-domains=La lista de dominios de seguridad hacia los que la identidad de seguridad de este dominio debe dirigirse autom\u00E1ticamente.
elytron.security-domain.outflow-anonymous=Al enviar a un dominio de seguridad si la salida no es posible, \u00BFdeber\u00EDa utilizarse la identidad an\u00F3nima? La salida an\u00F3nima elimina toda identidad ya establecida para ese dominio.
elytron.aggregate-http-server-mechanism-factory=Una definici\u00F3n de la f\u00E1brica del servidor http donde la f\u00E1brica del servidor http es una adici\u00F3n de otras f\u00E1bricas de servidor http.
elytron.aggregate-http-server-mechanism-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor http.
elytron.aggregate-http-server-mechanism-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor http.
elytron.aggregate-http-server-mechanism-factory.http-server-mechanism-factories=Las fabricas del servidor http que se deben agregar.
elytron.aggregate-http-server-mechanism-factory.available-mechanisms=Los mecanismos HTTP disponibles de esta instancia de f\u00E1brica.
elytron.configurable-http-server-mechanism-factory=Una definici\u00F3n de la f\u00E1brica del servidor http que incluye otra f\u00E1brica del servidor http y aplica la configuraci\u00F3n y los filtros especificados.
elytron.configurable-http-server-mechanism-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor http.
elytron.configurable-http-server-mechanism-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor http.
elytron.configurable-http-server-mechanism-factory.http-server-mechanism-factory=La f\u00E1brica del servidor http que debe incluirse.
elytron.configurable-http-server-mechanism-factory.properties=Propiedades personalizadas que deben enviarse a las llamadas de la f\u00E1brica del servidor http.
elytron.configurable-http-server-mechanism-factory.filters=Filtrado que debe aplicarse para habilitar/deshabilitar mecanismos basados en el nombre.
elytron.configurable-http-server-mechanism-factory.filters.pattern-filter=Filtro basado en el patr\u00F3n de expresi\u00F3n regular.
elytron.configurable-http-server-mechanism-factory.filters.enabling=\u00BFEste filtro habilita o deshabilita un mecanismo si coincide.
elytron.configurable-http-server-mechanism-factory.available-mechanisms=Los mecanismos HTTP disponibles de esta instancia de f\u00E1brica.
elytron.provider-http-server-mechanism-factory=Una definici\u00F3n de la f\u00E1brica del servidor http donde la f\u00E1brica del servidor http es una adici\u00F3n de f\u00E1bricas del Proveedor[]
elytron.provider-http-server-mechanism-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor http.
elytron.provider-http-server-mechanism-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor http.
elytron.provider-http-server-mechanism-factory.providers=Los proveedores a utilizar para ubicar las f\u00E1bricas. Si no se especifica, se usar\u00E1 la lista de proveedores registrada a nivel global.
elytron.provider-http-server-mechanism-factory.available-mechanisms=Los mecanismos HTTP disponibles de esta instancia de f\u00E1brica.
elytron.service-loader-http-server-mechanism-factory=Una definici\u00F3n de la f\u00E1brica del servidor http donde la f\u00E1brica del servidor http es una adici\u00F3n de f\u00E1bricas identificadas utilizando un ServiceLoader
elytron.service-loader-http-server-mechanism-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor http.
elytron.service-loader-http-server-mechanism-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor http.
elytron.service-loader-http-server-mechanism-factory.module=El m\u00F3dulo a usar para obtener el cargador de clase para cargar las f\u00E1bricas. De no especificarse, se usar\u00E1 en su lugar el cargador de clase para cargar el recurso.
elytron.service-loader-http-server-mechanism-factory.available-mechanisms=Los mecanismos HTTP disponibles de esta instancia de f\u00E1brica.
elytron.custom-credential-security-factory=Una definici\u00F3n SecurityFactory de la credencial personalizada.
elytron.custom-credential-security-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica de seguridad.
elytron.custom-credential-security-factory.remove=La operaci\u00F3n de eliminar para la f\u00E1brica de seguridad.
elytron.custom-credential-security-factory.module=El m\u00F3dulo a usar para cargar la f\u00E1brica de seguridad personalizada.
elytron.custom-credential-security-factory.class-name=El nombre de clase de la implementaci\u00F3n de la f\u00E1brica de seguridad personalizada.
elytron.custom-credential-security-factory.configuration=La configuraci\u00F3n opcional de llave/valor de la f\u00E1brica de seguridad personalizada.
elytron.kerberos-security-factory=Una f\u00E1brica de seguridad para obtener una GSSCredential para usar durante la autenticaci\u00F3n.
elytron.kerberos-security-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica de seguridad Kerberos.
elytron.kerberos-security-factory.remove=La operaci\u00F3n de eliminar para la f\u00E1brica de seguridad Kerberos.
elytron.kerberos-security-factory.principal=La principal representada por la KeyTab
elytron.kerberos-security-factory.path=La ruta de la KeyTab para cargar para obtener la credencial.
elytron.kerberos-security-factory.relative-to=El nombre de otra ruta nombrada anteriormente o de una de las rutas est\u00E1ndares que el sistema proporciona. Si se proporciona  el 'relative-to' entonces el valor del atributo 'path' se trata como relativo a la ruta especificada por este atributo.
elytron.kerberos-security-factory.minimum-remaining-lifetime=El tiempo de vida (en segundos) que le resta a una credencial almacenada en cach\u00E9 antes de ser recreada.
elytron.kerberos-security-factory.request-lifetime=El tiempo de vida (en segundos) que se debe solicitar para credenciales recientemente creadas.
elytron.kerberos-security-factory.server=\u00BFSe debe usar el lado del servidor o el lado del cliente?
elytron.kerberos-security-factory.obtain-kerberos-ticket=Si el KerberosTicket tambi\u00E9n se debe obtener y asociar con la credencial. Esto debe ser verdadero en los casos en que las credenciales se delegan al servidor.
elytron.kerberos-security-factory.debug=Si el paso JAAS para obtener la credencial tiene activado un registro de depuraci\u00F3n.
elytron.kerberos-security-factory.wrap-gss-credential=\u00BFLas credenciales GSS generadas deben envolverse para evitar una eliminaci\u00F3n incorrecta o no?
elytron.kerberos-security-factory.required=\u00BFEl archivo keytab con principal adecuado debe existir al momento en que el servicio comienza?
elytron.kerberos-security-factory.mechanism-names=Los nombres del mecanismo con los que la credencial deber\u00EDa poder usarse. Los nombres se convertir\u00E1n a OID y se usar\u00E1n junto con OID del atributo mechanism-oids.
elytron.kerberos-security-factory.mechanism-oids=Los OID del mecanismo con los que la credencial deber\u00EDa poder usarse. Se usar\u00E1n junto con OID derivados de nombres del atributo mechanism-names.
elytron.kerberos-security-factory.options=Las opciones adicionales de Krb5LoginModule.
elytron.custom-permission-mapper=Definici\u00F3n de un mapeador de permisos personalizado.
elytron.custom-permission-mapper.add=La operaci\u00F3n de a\u00F1adir para el mapeador de permisos.
elytron.custom-permission-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de permisos.
elytron.custom-permission-mapper.module=El nombre del m\u00F3dulo que se debe usar para cargar el mapeador de permisos.
elytron.custom-permission-mapper.class-name=El nombre de la clase completamente calificado del mapeador de permisos
elytron.custom-permission-mapper.configuration=La configuraci\u00F3n opcional de llave/valor para el mapeador de permisos
elytron.logical-permission-mapper=Definici\u00F3n de un mapeador de permisos l\u00F3gico.
elytron.logical-permission-mapper.add=La operaci\u00F3n de a\u00F1adir para el mapeador de permisos.
elytron.logical-permission-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de permisos.
elytron.logical-permission-mapper.logical-operation=La operaci\u00F3n l\u00F3gica que debe emplearse para combinar los mapeadores de permisos.
elytron.logical-permission-mapper.left=Referencia al mapeador de permisos que se debe usar a la izquierda de la operaci\u00F3n.
elytron.logical-permission-mapper.right=Referencia al mapeador de permisos que se debe usar a la derecha de la operaci\u00F3n.
elytron.simple-permission-mapper=Definici\u00F3n de un mapeador de permisos configurado simple.
elytron.simple-permission-mapper.add=La operaci\u00F3n de a\u00F1adir para el mapeador de permisos.
elytron.simple-permission-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de permisos.
elytron.simple-permission-mapper.mapping-mode=El modo de mapeo que se debe utilizar en caso de coincidencias m\u00FAltiples.
elytron.simple-permission-mapper.permission-mappings=Los mapeos de permisos definidos.
elytron.simple-permission-mapper.permission-mappings.principals=Principales para comparar al mapear permisos. Si el principal de identidades coincide con cualquiera en la lista, es una coincidencia.
elytron.simple-permission-mapper.permission-mappings.roles=Roles para comparar al mapear permisos. Si la identidad es un miembro de cualquiera en la lista, es una coincidencia.
elytron.simple-permission-mapper.permission-mappings.permissions=Los permisos para asignar en caso de coincidencia.
elytron.simple-permission-mapper.permission-mappings.class-name=El nombre de la clase completamente calificado del permiso.
elytron.simple-permission-mapper.permission-mappings.module=El m\u00F3dulo para cargar el permiso.
elytron.simple-permission-mapper.permission-mappings.target-name=El nombre objetivo para enviar al permiso como se conforma.
elytron.simple-permission-mapper.permission-mappings.action=La acci\u00F3n para enviar al permiso como se conforma.
elytron.constant-permission-mapper=Definici\u00F3n de un mapeador de permisos que siempre devuelve la misma constante.
elytron.constant-permission-mapper.add=La operaci\u00F3n de a\u00F1adir para el mapeador de permisos.
elytron.constant-permission-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de permisos.
elytron.constant-permission-mapper.permissions=Los permisos que deben asignarse.
elytron.constant-permission-mapper.permissions.class-name=El nombre de la clase completamente calificado del permiso.
elytron.constant-permission-mapper.permissions.module=El m\u00F3dulo para cargar el permiso.
elytron.constant-permission-mapper.permissions.target-name=El nombre objetivo para enviar al permiso como se conforma.
elytron.constant-permission-mapper.permissions.action=La acci\u00F3n para enviar al permiso como se conforma.
elytron.aggregate-principal-decoder=Una definici\u00F3n del decodificador principal en donde el decodificador principal es una adici\u00F3n de otros decodificadores principales.
elytron.aggregate-principal-decoder.add=La operaci\u00F3n de a\u00F1adir para el decodificador principal.
elytron.aggregate-principal-decoder.remove=La operaci\u00F3n de eliminar para el decodificador principal.
elytron.aggregate-principal-decoder.principal-decoders=Los decodificadores principales referenciados para agregar.
elytron.concatenating-principal-decoder=Una definici\u00F3n del decodificador principal en donde el decodificador principal es una concatenaci\u00F3n de otros decodificadores principales.
elytron.concatenating-principal-decoder.add=La operaci\u00F3n de a\u00F1adir para el decodificador principal.
elytron.concatenating-principal-decoder.remove=La operaci\u00F3n de eliminar para el decodificador principal.
elytron.concatenating-principal-decoder.joiner=La cadena a usar para unir los resultados de los decodificadores principales referenciados.
elytron.concatenating-principal-decoder.principal-decoders=Los decodificadores principales referenciados para concatenar.
elytron.constant-principal-decoder=Definici\u00F3n de un decodificador principal que siempre devuelve la misma constante.
elytron.constant-principal-decoder.add=La operaci\u00F3n de a\u00F1adir para el decodificador principal.
elytron.constant-principal-decoder.remove=La operaci\u00F3n de eliminar para el decodificador principal.
elytron.constant-principal-decoder.constant=El valor constante del decodificador principal siempre regresar\u00E1.
elytron.custom-principal-decoder=Definici\u00F3n de un decodificador principal personalizado.
elytron.custom-principal-decoder.add=La operaci\u00F3n de a\u00F1adir para el decodificador principal
elytron.custom-principal-decoder.remove=La operaci\u00F3n de eliminar para el decodificador principal.
elytron.custom-principal-decoder.module=El nombre del m\u00F3dulo que se debe usar para cargar el decodificador principal.
elytron.custom-principal-decoder.class-name=El nombre de la clase completamente calificado del decodificador principal.
elytron.custom-principal-decoder.configuration=La configuraci\u00F3n opcional de llave/valor para el decodificador principal
elytron.x500-attribute-principal-decoder=Definici\u00F3n de un decodificador principal basado en el atributo X.500
elytron.x500-attribute-principal-decoder.add=La operaci\u00F3n de a\u00F1adir para el decodificador principal
elytron.x500-attribute-principal-decoder.remove=La operaci\u00F3n de eliminar para el decodificador principal.
elytron.x500-attribute-principal-decoder.oid=El OID del atributo X.500 para mapear (se puede definir por nombre de atributo en su lugar)
elytron.x500-attribute-principal-decoder.attribute-name=El nombre del atributo X.500 para mapear (se puede definir utilizando OID en su lugar)
elytron.x500-attribute-principal-decoder.joiner=La cadena de vinculaci\u00F3n
elytron.x500-attribute-principal-decoder.start-segment=La ocurrencia de inicio basada en 0 del atributo a mapear
elytron.x500-attribute-principal-decoder.maximum-segments=N\u00FAmero m\u00E1ximo de ocurrencias del atributo a mapear
elytron.x500-attribute-principal-decoder.reverse=Cuando se establece como 'true', los valores del atributo se procesar\u00E1n y regresar\u00E1n en orden inverso
elytron.x500-attribute-principal-decoder.convert=Cuando se establece como 'true', si el Principal a\u00FAn no es X500Principal, se intentar\u00E1 una conversi\u00F3n
elytron.x500-attribute-principal-decoder.required-oids=Los OID de los atributos que deben estar presentes en el principal
elytron.x500-attribute-principal-decoder.required-attributes=Los nombres de los atributos que deben estar presentes en el principal
elytron.aggregate-principal-transformer=Un transformador principal que agrega m\u00E1s transformadores principales. Se intenta transformar el principal original mediante transformadores individuales hasta que regrese un principal no nulo.
elytron.aggregate-principal-transformer.add=La operaci\u00F3n de a\u00F1adir para el transformador principal.
elytron.aggregate-principal-transformer.remove=La operaci\u00F3n de eliminar para el trasformador principal.
elytron.aggregate-principal-transformer.principal-transformers=Los trasformadores principales referenciados para agregar.
elytron.chained-principal-transformer=Una definici\u00F3n del transformador principal en la que el transformador principal es un encadenamiento de otros transformadores principales.
elytron.chained-principal-transformer.add=La operaci\u00F3n de a\u00F1adir para el transformador principal.
elytron.chained-principal-transformer.remove=La operaci\u00F3n de eliminar para el trasformador principal.
elytron.chained-principal-transformer.principal-transformers=Los trasformadores principales referenciados para encadenar.
elytron.constant-principal-transformer=Definici\u00F3n de un transformador principal para un transformador principal que siempre devuelve la misma constante.
elytron.constant-principal-transformer.add=La operaci\u00F3n de a\u00F1adir para el transformador principal.
elytron.constant-principal-transformer.remove=La operaci\u00F3n de eliminar para el trasformador principal.
elytron.constant-principal-transformer.constant=El valor constante al que este transformador principal siempre regresar\u00E1.
elytron.custom-principal-transformer=Una definici\u00F3n del transformador principal personalizada.
elytron.custom-principal-transformer.add=La operaci\u00F3n de a\u00F1adir para el transformador principal.
elytron.custom-principal-transformer.remove=La operaci\u00F3n de eliminar para el trasformador principal.
elytron.custom-principal-transformer.module=El m\u00F3dulo a usar para cargar transformador principal personalizado.
elytron.custom-principal-transformer.class-name=El nombre de clase de la implementaci\u00F3n del transformador principal personalizado.
elytron.custom-principal-transformer.configuration=La configuraci\u00F3n opcional de llave/valor para el transformador principal personalizado.
elytron.regex-principal-transformer=Transformador principal basado en la expresi\u00F3n regular.
elytron.regex-principal-transformer.add=La operaci\u00F3n de a\u00F1adir para el transformador principal.
elytron.regex-principal-transformer.remove=La operaci\u00F3n de eliminar para el trasformador principal.
elytron.regex-principal-transformer.pattern=La expresi\u00F3n regular a usar para ubicar la parte del nombre que debe reemplazarse.
elytron.regex-principal-transformer.replacement=El valor que debe usarse como reemplazo.
elytron.regex-principal-transformer.replace-all=\u00BFDeber\u00EDan reemplazarse todas las ocurrencias del patr\u00F3n coincidente o solo la primera ocurrencia?
elytron.regex-validating-principal-transformer=Un transformador principal basado en una expresi\u00F3n regular que utiliza la expresi\u00F3n regular para validar el nombre.
elytron.regex-validating-principal-transformer.add=La operaci\u00F3n de a\u00F1adir para el transformador principal.
elytron.regex-validating-principal-transformer.remove=La operaci\u00F3n de eliminar para el trasformador principal.
elytron.regex-validating-principal-transformer.pattern=La expresi\u00F3n regular a usar para el transformador principal.
elytron.regex-validating-principal-transformer.match=Si se establece como verdadero, el nombre debe coincidir con el patr\u00F3n dado para que la validaci\u00F3n sea exitosa. Si se establece como falso, el nombre no debe coincidir con el patr\u00F3n dado para que la validaci\u00F3n sea exitosa.
elytron.constant-realm-mapper=Definici\u00F3n de un RealMapper constante que siempre devuelve el mismo valor.
elytron.constant-realm-mapper.add=Agregue la operaci\u00F3n para el RealmMapper.
elytron.constant-realm-mapper.remove=Elimine la operaci\u00F3n del RealmMapper.
elytron.constant-realm-mapper.realm-name=El nombre del dominio constante que se debe devolver.
elytron.custom-realm-mapper=Definici\u00F3n de un RealmMapper personalizado
elytron.custom-realm-mapper.add=Agregue la operaci\u00F3n para el RealmMapper.
elytron.custom-realm-mapper.remove=Elimine la operaci\u00F3n del RealmMapper.
elytron.custom-realm-mapper.module=El nombre del m\u00F3dulo que se debe usar para cargar el RealmMapper.
elytron.custom-realm-mapper.class-name=El nombre de la clase completamente calificado del RealmMapper.
elytron.custom-realm-mapper.configuration=La configuraci\u00F3n opcional de llave/valor para el RealmMapper
elytron.simple-regex-realm-mapper=Definici\u00F3n de un RealmMapper simple que intenta extraer el nombre del dominio usando el grupo de captura de la expresi\u00F3n regular. Si esto no brinda una coincidencia, en su lugar se usa el RealmMapper delegado.
elytron.simple-regex-realm-mapper.add=Agregue la operaci\u00F3n para el RealmMapper.
elytron.simple-regex-realm-mapper.remove=Elimine la operaci\u00F3n del RealmMapper.
elytron.simple-regex-realm-mapper.pattern=La expresi\u00F3n regular que debe contener al menos un grupo de captura para extraer el dominio del nombre. Si la expresi\u00F3n regular coincide con m\u00E1s de un grupo de captura, se utiliza el primer grupo de captura.
elytron.simple-regex-realm-mapper.delegate-realm-mapper=El RealmMapper al cual delegar si no hay coincidencia al usar este patr\u00F3n.
elytron.mapped-regex-realm-mapper=Definici\u00F3n de una implementaci\u00F3n de RealmMapper que primero utiliza una expresi\u00F3n regular para extraer el nombre del dominio. Posteriormente, esto se convierte usando el mapeo configurado de nombres de dominio.
elytron.mapped-regex-realm-mapper.add=Add operation for the RealmMapper
elytron.mapped-regex-realm-mapper.remove=Remove operation for the RealmMapper
elytron.mapped-regex-realm-mapper.pattern=La expresi\u00F3n regular que debe contener al menos un grupo de captura para extraer el dominio del nombre. Si la expresi\u00F3n regular coincide con m\u00E1s de un grupo de captura, se utiliza el primer grupo de captura.
elytron.mapped-regex-realm-mapper.delegate-realm-mapper=El RealmMapper al cual delegar si el patr\u00F3n no coincide. Si no se especifica ning\u00FAn delegado, en su lugar, se utilizar\u00E1 el dominio predeterminado dentro del dominio. Si el nombre del usuario no coincide, se presenta un patr\u00F3n y un realm-mapper delegado y el resultado de delegate-realm-mapper se mapea a trav\u00E9s del realm-map.
elytron.mapped-regex-realm-mapper.realm-map=Mapeo del nombre del dominio extra\u00EDdo utilizando la expresi\u00F3n regular para un nombre de dominio definido. Si el valor para el mapeo no se encuentra en el mapa o el dominio, cuyo nombre es el resultado del mapeo, no existe en el dominio de seguridad dado, se utiliza el dominio predeterminado.
elytron.custom-role-decoder=Definici\u00F3n de un RoleDecoder personalizado
elytron.custom-role-decoder.add=Agregar operaci\u00F3n para el RoleDecoder
elytron.custom-role-decoder.remove=Eliminar operaci\u00F3n para el RoleDecoder
elytron.custom-role-decoder.module=El nombre del m\u00F3dulo que se debe usar para cargar el RoleDecoder.
elytron.custom-role-decoder.class-name=El nombre de la clase completamente calificado del RoleDecoder.
elytron.custom-role-decoder.configuration=La configuraci\u00F3n opcional de llave/valor para el RoleDecoder
elytron.empty-role-decoder=Definici\u00F3n de un RoleDecoder vac\u00EDo que nunca devuelve ning\u00FAn rol.
elytron.empty-role-decoder.add=Agregue operaci\u00F3n para el RoleDecoder
elytron.empty-role-decoder.remove=Elimine operaci\u00F3n para el RoleDecoder
elytron.simple-role-decoder=Definici\u00F3n de un RoleDecoder simple que toma un atributo \u00FAnico y lo mapea directamente a los roles.
elytron.simple-role-decoder.add=Agregue operaci\u00F3n para el RoleDecoder
elytron.simple-role-decoder.remove=Elimine operaci\u00F3n para el RoleDecoder
elytron.simple-role-decoder.attribute=El nombre del atributo de la identidad para mapear directamente a los roles.
elytron.add-prefix-role-mapper=Una definici\u00F3n del mapeador de roles para un mapeador de roles que agrega un prefijo a cada uno provisto.
elytron.add-prefix-role-mapper.add=La operaci\u00F3n de agregar para el mapeador de roles.
elytron.add-prefix-role-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de roles.
elytron.add-prefix-role-mapper.prefix=El prefijo para agregar a cada rol.
elytron.add-suffix-role-mapper=Una definici\u00F3n del mapeador de roles para un mapeador de roles que agrega un sufijo a cada uno provisto.
elytron.add-suffix-role-mapper.add=La operaci\u00F3n de agregar para el mapeador de roles.
elytron.add-suffix-role-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de roles.
elytron.add-suffix-role-mapper.suffix=El sufijo para agregar a cada rol.
elytron.aggregate-role-mapper=Una definici\u00F3n del mapeador de roles en donde el mapeador es una adici\u00F3n de otros mapeadores de roles.
elytron.aggregate-role-mapper.add=La operaci\u00F3n de agregar para el mapeador de roles.
elytron.aggregate-role-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de roles.
elytron.aggregate-role-mapper.role-mappers=Los mapeadores de roles referenciados para agregar.
elytron.constant-role-mapper=Una definici\u00F3n del mapeador de roles donde el conjunto constante de roles siempre se devuelve.
elytron.constant-role-mapper.add=La operaci\u00F3n de agregar para el mapeador de roles.
elytron.constant-role-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de roles.
elytron.constant-role-mapper.roles=Los roles constantes que el mapeador de roles debe devolver.
elytron.custom-role-mapper=Definici\u00F3n de un RoleMapper personalizado
elytron.custom-role-mapper.add=Agregue operaci\u00F3n para el RoleMapper
elytron.custom-role-mapper.remove=Elimine operaci\u00F3n para el RoleMapper
elytron.custom-role-mapper.module=El nombre del m\u00F3dulo que se debe usar para cargar el RoleMapper.
elytron.custom-role-mapper.class-name=El nombre de la clase completamente calificado del RoleMapper.
elytron.custom-role-mapper.configuration=La configuraci\u00F3n opcional de llave/valor para el RoleMapper.
elytron.logical-role-mapper=Una definici\u00F3n de RoleMapper para un RoleMapper que realiza una operaci\u00F3n l\u00F3gica usando dos RoleMappers referenciados.
elytron.logical-role-mapper.add=La operaci\u00F3n de agregar para el mapeador de roles.
elytron.logical-role-mapper.remove=La operaci\u00F3n de eliminar para el mapeador de roles.
elytron.logical-role-mapper.logical-operation=La operaci\u00F3n l\u00F3gica que debe realizarse en los mapeos del mapeador de roles.
elytron.logical-role-mapper.left=Referencia a un mapeador de roles que se debe usar a la izquierda de la operaci\u00F3n.
elytron.logical-role-mapper.right=Referencia al mapeador de roles que se debe usar a la derecha de la operaci\u00F3n.
elytron.aggregate-realm=Una definici\u00F3n de dominio que es la adici\u00F3n de dos dominios, uno para los pasos de autenticaci\u00F3n y otro para cargar la identidad para los pasos de autorizaci\u00F3n.
elytron.aggregate-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.aggregate-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.aggregate-realm.authentication-realm=Referencia al dominio de seguridad que debe usarse para los pasos de autenticaci\u00F3n (obtenci\u00F3n o validaci\u00F3n de credenciales).
elytron.aggregate-realm.authorization-realm=Referencia al dominio de seguridad que debe usarse para cargar la identidad para los pasos de autorizaci\u00F3n (carga de la identidad).
elytron.custom-modifiable-realm=Se espera que el dominio personalizado configurado como modificable implemente la interfaz ModifiableSecurityRealm. Al configurar un dominio como modificable, las operaciones de administraci\u00F3n se har\u00E1n disponibles para manipular el dominio.
elytron.custom-modifiable-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.custom-modifiable-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.custom-modifiable-realm.class-name=El nombre de clase de la implementaci\u00F3n del dominio personalizado.
elytron.custom-modifiable-realm.configuration=La configuraci\u00F3n opcional de llave/valor para el dominio personalizado.
elytron.custom-modifiable-realm.identity=Un identidad que se puede gestionar mediante un dominio de seguridad.
elytron.custom-modifiable-realm.module=El m\u00F3dulo a usar para cargar el dominio personalizado.
elytron.custom-realm=Las definiciones del dominio personalizado pueden implementar la interfaz SecurityRealm o la interfaz ModifiableSecurityRealm. Independientemente de la interfaz  que se implemente, las operaciones de administraci\u00F3n no ser\u00E1n expuestas para gestionar el dominio. No obstante, otros servicios que dependen del dominio a\u00FAn podr\u00E1n realizar una verificaci\u00F3n de tipo e intentar obtener acceso a la API de modificaci\u00F3n.
elytron.custom-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.custom-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.custom-realm.module=El m\u00F3dulo a usar para cargar el dominio personalizado.
elytron.custom-realm.class-name=El nombre de clase de la implementaci\u00F3n del dominio personalizado.
elytron.custom-realm.configuration=La configuraci\u00F3n opcional de llave/valor para el dominio personalizado.
elytron.jdbc-realm=Una definici\u00F3n de dominio de seguridad respaldada por la base de datos que utiliza JDBC.
elytron.jdbc-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.jdbc-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.jdbc-realm.principal-query=La consulta de autenticaci\u00F3n utilizada para autenticar usuarios en base a tipos de llave espec\u00EDficos.
elytron.jdbc-realm.principal-query.sql=La declaraci\u00F3n de SQL utilizada para obtener las llaves (como columnas de tablas) para un usuario espec\u00EDfico y mapearlas conforme su tipo.
elytron.jdbc-realm.principal-query.data-source=Nombre de la fuente de datos utilizada para conectarse a la base de datos.
elytron.jdbc-realm.principal-query.algorithm=El algoritmo para el mapeador de llaves de una contrase\u00F1a espec\u00EDfica.
elytron.jdbc-realm.principal-query.password-index=El \u00EDndice de columnas de una consulta de autenticaci\u00F3n que representa la contrase\u00F1a del usuario.
elytron.jdbc-realm.principal-query.salt-index=El \u00EDndice de la columna de una consulta de autenticaci\u00F3n que representa la sal de la contrase\u00F1a, de admitirse.
elytron.jdbc-realm.principal-query.iteration-count-index=El \u00EDndice de la columna de una consulta de autenticaci\u00F3n que representa el conteo de iteraci\u00F3n de la contrase\u00F1a, de admitirse.
elytron.jdbc-realm.principal-query.clear-password-mapper=Un mapeador de llaves que mapea una columna devuelta de una consulta SQL a un tipo de llave de Contrase\u00F1a sin cifrar.
elytron.jdbc-realm.principal-query.bcrypt-mapper=Un mapeador de llaves que mapea una columna devuelta de una consulta SQL a un tipo de llave Bcrypt.
elytron.jdbc-realm.principal-query.salted-simple-digest-mapper=Un mapeador de llaves que mapea una columna devuelta de una consulta SQL a un tipo de llave Salted Simple Digest.
elytron.jdbc-realm.principal-query.simple-digest-mapper=Un mapeador de llaves que mapea una columna devuelta de una consulta SQL a un tipo de llave Simple Digest.
elytron.jdbc-realm.principal-query.scram-mapper=Un mapeador de llaves que mapea una columna devuelta de una consulta SQL a un tipo de llave Scram.
elytron.jdbc-realm.principal-query.attribute-mapping=El mapeo de atributos definido por este recurso
elytron.jdbc-realm.principal-query.index=El \u00EDndice de columnas de una consulta que representa el atributo mapeado.
elytron.jdbc-realm.principal-query.to=El nombre del atributo de identidad mapeado de una columna devuelta de una consulta SQL.
elytron.identity-realm=Una definici\u00F3n de dominio de seguridad en la que las identidades se representan en el modelo de administraci\u00F3n.
elytron.identity-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.identity-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.identity-realm.identity=La identidad disponible del dominio de seguridad.
elytron.identity-realm.attribute-name=El nombre del atributo asociado a esta identidad.
elytron.identity-realm.attribute-values=Los valores asociados con el atributo de identidades.
elytron.key-store-realm=Una definici\u00F3n de dominio de seguridad respaldada por un almac\u00E9n de llaves.
elytron.key-store-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.key-store-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.key-store-realm.key-store=Referencia a la KeyStore que se debe utilizar para respaldar el dominio de seguridad.
elytron.properties-realm=Una definici\u00F3n de dominio de seguridad respaldada por archivos de propiedades.
elytron.properties-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.properties-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.properties-realm.load=Vuelva a cargar los archivos de propiedades del sistema de archivos.
elytron.properties-realm.users-properties=El archivo de propiedades que contiene los usuarios y sus contrase\u00F1as.
elytron.properties-realm.users-properties.path=La ruta del archivo que contiene los usuarios y sus contrase\u00F1as. El archivo debe contener la declaraci\u00F3n del nombre del dominio.
elytron.properties-realm.users-properties.relative-to=El archivo predefinido al que la ruta es relativa. 
elytron.properties-realm.users-properties.digest-realm-name=El nombre del dominio predeterminado a usar para contrase\u00F1as digeridas si no se descubre uno en el archivo de propiedades.
elytron.properties-realm.users-properties.plain-text=\u00BFLas contrase\u00F1as en el archivo de propiedades se almacenaron en texto plano text o en hash previo? (Forma en hash previo\: HEX( MD5 (nombre de usuario "\:" dominio "\:" contrase\u00F1a ) ) )
elytron.properties-realm.groups-properties=El archivo de propiedades que contiene los usuarios y sus grupos.
elytron.properties-realm.groups-properties.path=La ruta al archivo que contiene los usuarios y sus grupos.
elytron.properties-realm.groups-properties.relative-to=El archivo predefinido al que la ruta es relativa. 
elytron.properties-realm.groups-attribute=El nombre del atributo en la AuthorizationIdentity devuelta que debe contener la informaci\u00F3n de membres\u00EDa del grupo para la identidad.
elytron.properties-realm.synchronized=El momento en que los archivos de propiedades que respaldan este dominio se cargaron por \u00FAltima vez.
elytron.ldap-realm=Una definici\u00F3n de dominio de seguridad respaldada por LDAP.
elytron.ldap-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.ldap-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.ldap-realm.dir-context=La configuraci\u00F3n para conectarse a un servidor LDAP.
elytron.ldap-realm.dir-context.url=La URL de conexi\u00F3n.
elytron.ldap-realm.dir-context.authentication-level=El nivel de autenticaci\u00F3n.
elytron.ldap-realm.dir-context.principal=El principal para autenticar y conectarse al servidor LDAP.
elytron.ldap-realm.dir-context.credential=La credencial para autenticar y conectarse al servidor LDAP.
elytron.ldap-realm.dir-context.enable-connection-pooling=Indica si el pooling de conexi\u00F3n est\u00E1 habilitado.
elytron.ldap-realm.identity-mapping=Las opciones de configuraci\u00F3n que definen c\u00F3mo se mapean los principales con sus correspondientes entradas en el servidor LDAP subyacente.
elytron.ldap-realm.identity-mapping.rdn-identifier=La parte RDN del DN del principal que debe usarse para obtener el nombre del principal de una entrada LDAP. Usado tambi\u00E9n al crear nuevas identidades.
elytron.ldap-realm.identity-mapping.search-base-dn=El DN de base para buscar identidades.
elytron.ldap-realm.identity-mapping.use-recursive-search=Indica si las consultas de b\u00FAsqueda de identidad son recursivas.
elytron.ldap-realm.identity-mapping.attribute-mapping=El mapeo de atributos definido por este recurso
elytron.ldap-realm.identity-mapping.attribute-mapping.attribute=La configuraci\u00F3n utilizada para mapear un atributo LDAP espec\u00EDfico como atributo de identidad.
elytron.ldap-realm.identity-mapping.from=El nombre del atributo LDAP para mapear a un atributo de identidad. Si no se define, se utiliza la DN de entrada.
elytron.ldap-realm.identity-mapping.to=El nombre del atributo de identidad mapeado de un atributo LDAP espec\u00EDfico. Si no se brinda, el nombre del atributo es el mismo que se define en 'from'. Si 'from' tampoco se define, se usa el valor 'dn'.
elytron.ldap-realm.identity-mapping.reference=El nombre del atributo LDAP que contiene la DN de entrada desde la cual obtener valor.
elytron.ldap-realm.identity-mapping.filter=El filtro a usar para obtener los valores para un atributo espec\u00EDfico. La cadena "{0}" ser\u00E1 reemplazada por el nombre de usuario, "{1}" por DN de identidad de usuario.
elytron.ldap-realm.identity-mapping.filter-base-dn=El nombre del contexto en donde se debe aplicar el filtro.
elytron.ldap-realm.identity-mapping.search-recursive=Indica si las consultas de b\u00FAsqueda LDAP del atributo son recursivas.
elytron.ldap-realm.identity-mapping.role-recursion=Establece la asignaci\u00F3n de roles recursivos. El valor determina la profundidad m\u00E1xima de recurrencia. (0 para ninguna recurrencia)
elytron.ldap-realm.identity-mapping.role-recursion-name=Determina el atributo LDAP de la entrada del rol que ser\u00E1 un sustituto de "{0}" en filter-name al buscar los roles del rol.
elytron.ldap-realm.identity-mapping.extract-rdn=La llave RDN a usar como el valor de un atributo, en caso de que el valor en su estado sin procesar sea en formato X.500.
elytron.ldap-realm.identity-mapping.filter-name=El filtro LDAP para obtener la identidad por nombre. Si esto no se especifica, el valor predeterminado ser\u00E1 (rdn_identifier\={0}). La cadena '{0}' ser\u00E1 reemplazada por el nombre de la identidad buscada, y 'rdn_identifier' ser\u00E1 el valor del atributo 'rdn-identifier'.
elytron.ldap-realm.identity-mapping.iterator-filter=El filtro LDAP para iterar a trav\u00E9s de identidades del dominio.
elytron.ldap-realm.identity-mapping.new-identity-parent-dn=El DN del principal de identidades recientemente creadas. Requerido para la variabilidad del dominio.
elytron.ldap-realm.identity-mapping.new-identity-attributes=Los atributos de las identidades recientemente creadas. Requerido para la variabilidad del dominio.
elytron.ldap-realm.identity-mapping.name=El nombre del atributo.
elytron.ldap-realm.identity-mapping.value=El valor del atributo.
elytron.ldap-realm.identity-mapping.credential-mapping=Los mapeos de credenciales definidos por este recurso.
elytron.ldap-realm.identity-mapping.credential-mapping.credential=La configuraci\u00F3n utilizada para mapear un atributo LDAP espec\u00EDfico como atributo de contrase\u00F1a de usuario.
elytron.ldap-realm.identity-mapping.user-password-mapper=El mapeo de las credenciales para el atributo de credenciales userPassword-like.
elytron.ldap-realm.identity-mapping.otp-credential-mapper=El mapeo de credenciales para la credencial OTP.
elytron.ldap-realm.identity-mapping.algorithm-from=El nombre del atributo LDAP para asignar a un algoritmo de credenciales OTP.
elytron.ldap-realm.identity-mapping.hash-from=El nombre del atributo LDAP para asignar a un hash de credenciales OTP con codificaci\u00F3n Base64.
elytron.ldap-realm.identity-mapping.seed-from=El nombre del atributo LDAP para asignar a una inicializaci\u00F3n de credenciales OTP.
elytron.ldap-realm.identity-mapping.sequence-from=El nombre del atributo LDAP para asignar a un n\u00FAmero de secuencia de credenciales OTP.
elytron.ldap-realm.identity-mapping.writable=Indica si se puede modificar la contrase\u00F1a.
elytron.ldap-realm.identity-mapping.verifiable=Indica se puede utilizar si la contrase\u00F1a para verificar el usuario.
elytron.ldap-realm.identity-mapping.x509-credential-mapper=La configuraci\u00F3n que permite usar LDAP como almacenamiento de credenciales X509. La credencial X509 es el certificado del usuario o la informaci\u00F3n que permite identificarlo. Se debe especificar al menos uno *-del atributo. De lo contrario, se ignorar\u00E1 esta definici\u00F3n. Si se definen m\u00E1s *-de los atributos, el certificado del usuario debe coincidir con todos los criterios definidos.
elytron.ldap-realm.identity-mapping.digest-from=El nombre del atributo LDAP para mapear a un digest de certificado del usuario. Si no se define, no se verificar\u00E1 la digest de entrada.
elytron.ldap-realm.identity-mapping.digest-algorithm=El algoritmo digest (funci\u00F3n de hash) usado para calcular el digest del certificado del usuario. Solo se usar\u00E1 si se defini\u00F3 digest-from.
elytron.ldap-realm.identity-mapping.certificate-from=El nombre del atributo LDAP para mapear a un certificado cifrado del usuario. Si no se define, no se verificar\u00E1 el certificado cifrado.
elytron.ldap-realm.identity-mapping.serial-number-from=El nombre del atributo LDAP para mapear a un n\u00FAmero de serie del certificado del usuario. Si no se define, no se verificar\u00E1 el n\u00FAmero de serie.
elytron.ldap-realm.identity-mapping.subject-dn-from=El nombre del atributo LDAP para mapear a un DN de asunto del certificado cifrado del usuario. Si no se define, no se verificar\u00E1 el certificado cifrado.
elytron.ldap-realm.direct-verification=\u00BFEste dominio admite la verificaci\u00F3n de credenciales conect\u00E1ndose directamente a LDAP como la cuenta que se est\u00E1 autenticando?
elytron.ldap-realm.allow-blank-password=\u00BFEste dominio admite una verificaci\u00F3n directa de la contrase\u00F1a en blanco? De lo contrario, el intento de contrase\u00F1a en blanco ser\u00E1 rechazado.
elytron.ldap-realm.identity=Un identidad que se puede gestionar mediante un dominio de seguridad.
elytron.filesystem-realm=Una definici\u00F3n de dominio de seguridad simple respaldada por el sistema de archivos.
elytron.filesystem-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.filesystem-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.filesystem-realm.path=La ruta al archivo que contiene el dominio.
elytron.filesystem-realm.relative-to=El archivo predefinido al que la ruta es relativa. 
elytron.filesystem-realm.levels=La cantidad de niveles de hashing que se deben aplicar.
elytron.filesystem-realm.encoded=Si los nombres de identidad se deben almacenar codificados (Base32) en nombres de archivos.
elytron.filesystem-realm.identity=Un identidad que se puede gestionar mediante un dominio de seguridad.
elytron.token-realm=Una definici\u00F3n de dominio de seguridad capaz de validar y extraer identidades de tokens de seguridad.
elytron.token-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.token-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.token-realm.principal-claim=El nombre de la reclamaci\u00F3n que se debe utilizar para obtener el nombre del principal.
elytron.token-realm.jwt=Un validador de tokens que debe usarse junto con un dominio basado en tokens que gestione los tokens de seguridad en base al est\u00E1ndar JWT/JWS.
elytron.token-realm.jwt.issuer=Una lista de cadenas que representa a los emisores admitidos por esta configuraci\u00F3n. Durante la validaci\u00F3n, los tokens JWT deben tener un reclamaci\u00F3n "iss" que contenga uno de los valores definidos aqu\u00ED.
elytron.token-realm.jwt.audience=Una lista de cadenas que representa a las audiencias admitidas por esta configuraci\u00F3n. Durante la validaci\u00F3n, los tokens JWT deben tener una reclamaci\u00F3n "aud" que contenga uno de los valores definidos aqu\u00ED.
elytron.token-realm.jwt.public-key=Una llave p\u00FAblica en formato PEM. Durante la validaci\u00F3n, si se brinda una llave p\u00FAblica, la firma se verificar\u00E1 en base a la llave que brind\u00F3 aqu\u00ED.
elytron.token-realm.jwt.key-store=Un almac\u00E9n de llaves desde el cual se debe cargar el certificado con una llave p\u00FAblica.
elytron.token-realm.jwt.certificate=El nombre del certificado con una llave p\u00FAblica para cargar del almac\u00E9n de llaves.
elytron.token-realm.oauth2-introspection=Un validador de tokens que debe usarse junto con un dominio basado en tokens que gestione los tokens de acceso OAuth2 y los valide mediante un punto de acceso que est\u00E9 en conformidad con la especificaci\u00F3n de introspecci\u00F3n del token OAuth2.
elytron.token-realm.oauth2-introspection.client-id=El identificador del cliente en el servidor de autorizaci\u00F3n OAuth2.
elytron.token-realm.oauth2-introspection.client-secret=El secreto del cliente.
elytron.token-realm.oauth2-introspection.introspection-url=La URL del punto de acceso de introspecci\u00F3n del token.
elytron.token-realm.oauth2-introspection.client-ssl-context=El contexto SSL que debe usarse si el punto de acceso de introspecci\u00F3n est\u00E1 utilizando HTTP.
elytron.token-realm.oauth2-introspection.host-name-verification-policy=Una pol\u00EDtica que define la forma en que se deben verificar los nombres del host al usar HTTPS. Valores permitidos\: "ANY".
elytron.modifiable-security-realm.add-identity=Agregue una identidad a un dominio de seguridad.
elytron.modifiable-security-realm.add-identity.identity=El nombre de la identidad.
elytron.modifiable-security-realm.remove-identity=Elimine una identidad de un dominio de seguridad.
elytron.modifiable-security-realm.remove-identity.identity=El nombre de la identidad.
elytron.modifiable-security-realm.read-identity=Lea una identidad de un dominio de seguridad, si existe.
elytron.modifiable-security-realm.read-identity.identity=El nombre de la identidad.
elytron.modifiable-security-realm.add-identity-attribute=Agregue un atributo a una identidad existente.
elytron.modifiable-security-realm.add-identity-attribute.identity=El nombre de la identidad.
elytron.modifiable-security-realm.add-identity-attribute.name=El nombre del atributo.
elytron.modifiable-security-realm.add-identity-attribute.value=El valor del atributo
elytron.modifiable-security-realm.remove-identity-attribute=Elimine un atributo de una identidad existente.
elytron.modifiable-security-realm.remove-identity-attribute.identity=El nombre de la identidad.
elytron.modifiable-security-realm.remove-identity-attribute.name=El nombre del atributo.
elytron.modifiable-security-realm.remove-identity-attribute.value=El valor del atributo.
elytron.modifiable-security-realm.set-password=Agregue un contrase\u00F1a a una identidad existente.
elytron.modifiable-security-realm.set-password.identity=El nombre de la identidad.
elytron.modifiable-security-realm.set-password.bcrypt=Una contrase\u00F1a que usa el algoritmo Bcrypt.
elytron.modifiable-security-realm.set-password.bcrypt.iteration-count=El conteo de iteraci\u00F3n o el costo a aplicar a la contrase\u00F1a.
elytron.modifiable-security-realm.set-password.bcrypt.salt=La sal que se debe aplicar a la contrase\u00F1a.
elytron.modifiable-security-realm.set-password.bcrypt.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.bcrypt=Una contrase\u00F1a que usa el algoritmo Bcrypt.
elytron.modifiable-security-realm.bcrypt.name=El nombre de la credencial.
elytron.modifiable-security-realm.bcrypt.iteration-count=El conteo de iteraci\u00F3n o el costo a aplicar a la contrase\u00F1a.
elytron.modifiable-security-realm.bcrypt.salt=La sal que se debe aplicar a la contrase\u00F1a.
elytron.modifiable-security-realm.bcrypt.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.bcrypt.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.set-password.clear=Una contrase\u00F1a en texto sin procesar.
elytron.modifiable-security-realm.set-password.clear.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.clear=Una contrase\u00F1a en texto sin procesar.
elytron.modifiable-security-realm.clear.name=El nombre de la credencial.
elytron.modifiable-security-realm.clear.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.set-password.simple-digest=Una contrase\u00F1a de simple digest.
elytron.modifiable-security-realm.set-password.simple-digest.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.set-password.simple-digest.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.simple-digest=Una contrase\u00F1a de simple digest.
elytron.modifiable-security-realm.simple-digest.name=El nombre de la credencial.
elytron.modifiable-security-realm.simple-digest.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.simple-digest.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.set-password.salted-simple-digest=Una contrase\u00F1a de salted simple digest.
elytron.modifiable-security-realm.salted-simple-digest.name=El nombre de la credencial.
elytron.modifiable-security-realm.set-password.salted-simple-digest.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.set-password.salted-simple-digest.salt=La sal que se debe aplicar a la contrase\u00F1a.
elytron.modifiable-security-realm.set-password.salted-simple-digest.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.salted-simple-digest=Una contrase\u00F1a de salted simple digest.
elytron.modifiable-security-realm.salted-simple-digest.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.salted-simple-digest.salt=La sal que se debe aplicar a la contrase\u00F1a.
elytron.modifiable-security-realm.salted-simple-digest.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.set-password.digest=Una contrase\u00F1a de digest.
elytron.modifiable-security-realm.set-password.digest.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.set-password.digest.realm=El dominio.
elytron.modifiable-security-realm.set-password.digest.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.digest=Una contrase\u00F1a de digest.
elytron.modifiable-security-realm.digest.name=El nombre de la credencial.
elytron.modifiable-security-realm.digest.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.digest.realm=El dominio.
elytron.modifiable-security-realm.digest.password=La contrase\u00F1a real est\u00E1 establecida.
elytron.modifiable-security-realm.otp=Una contrase\u00F1a \u00FAnica, utilizada por el mecanismo SASL de OTP.
elytron.modifiable-security-realm.otp.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.otp.password=La contrase\u00F1a real para establecer.
elytron.modifiable-security-realm.otp.seed=La semilla utilizada para generar el hash.
elytron.modifiable-security-realm.otp.sequence=El n\u00FAmero de la secuencia usado para generar el hash.
elytron.modifiable-security-realm.set-password.otp=Una contrase\u00F1a \u00FAnica, utilizada por el mecanismo SASL de OTP.
elytron.modifiable-security-realm.set-password.algorithm=El algoritmo utilizado para cifrar la contrase\u00F1a.
elytron.modifiable-security-realm.set-password.otp.password=La contrase\u00F1a real para establecer.
elytron.modifiable-security-realm.set-password.otp.seed=La semilla utilizada para generar el hash.
elytron.modifiable-security-realm.set-password.otp.sequence=El n\u00FAmero de la secuencia usado para generar el hash.
elytron.caching-realm=Una definici\u00F3n de dominio que habilita el almacenamiento en cach\u00E9 a otro dominio de seguridad. La estrategia de almacenamiento en cach\u00E9 es LRU (la m\u00E1s recientemente utilizada) en donde las entradas con menos accesos se eliminan cuando se alcanza el n\u00FAmero m\u00E1ximo de entradas.
elytron.caching-realm.add=La operaci\u00F3n de agregar para el dominio de seguridad.
elytron.caching-realm.remove=La operaci\u00F3n de eliminar para el dominio de seguridad.
elytron.caching-realm.realm=Una referencia a un dominio de seguridad en cach\u00E9.
elytron.caching-realm.maximum-entries=El n\u00FAmero m\u00E1ximo de entradas para mantener en cach\u00E9.
elytron.caching-realm.maximum-age=El tiempo en mili-segundos que un elemento puede permanecer en el cach\u00E9.
elytron.caching-realm.clear-cache=Elimina todas las entradas del cach\u00E9.
elytron.aggregate-sasl-server-factory=Una definici\u00F3n de la f\u00E1brica del servidor sasl en donde la f\u00E1brica del servidor sasl es una adici\u00F3n de otras f\u00E1bricas de servidores sasl.
elytron.aggregate-sasl-server-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor sasl.
elytron.aggregate-sasl-server-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor sasl.
elytron.aggregate-sasl-server-factory.sasl-server-factories=Las fabricas del servidor sasl referenciado que se deben agregar.
elytron.aggregate-sasl-server-factory.available-mechanisms=Los mecanismos SASL disponibles de esta f\u00E1brica despu\u00E9s de haberse aplicado todos los filtros.
elytron.configurable-sasl-server-factory=Una definici\u00F3n de SaslServerFactory que incluye otra SaslServerFactory y aplica la configuraci\u00F3n y los filtros especificados.
elytron.configurable-sasl-server-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor sasl.
elytron.configurable-sasl-server-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor sasl.
elytron.configurable-sasl-server-factory.sasl-server-factory=La f\u00E1brica del servidor sasl que debe incluirse.
elytron.configurable-sasl-server-factory.protocol=El protocolo que se debe enviar a f\u00E1brica al crear el mecanismo.
elytron.configurable-sasl-server-factory.server-name=El nombre del servidor que se debe enviar a f\u00E1brica al crear el mecanismo.
elytron.configurable-sasl-server-factory.properties=Propiedades personalizadas que deben enviarse a las llamadas de la f\u00E1brica del servidor sasl.
elytron.configurable-sasl-server-factory.filters=Lista de filtros que se debe evaluar de manera secuencial combinando los resultados utilizando 'or'.
elytron.configurable-sasl-server-factory.filters.predefined-filter=El filtro predefinido a utilizar para la b\u00FAsqueda LDAP.
elytron.configurable-sasl-server-factory.filters.pattern-filter=Un filtro basado en una expresi\u00F3n regular del nombre del mecanismo.
elytron.configurable-sasl-server-factory.filters.enabling=\u00BFEste filtro est\u00E1 habilitando o deshabilitando los nombres coincidentes?
elytron.configurable-sasl-server-factory.available-mechanisms=Los mecanismos SASL disponibles de esta f\u00E1brica despu\u00E9s de haberse aplicado todos los filtros.
elytron.mechanism-provider-filtering-sasl-server-factory=Una definici\u00F3n de SaslServerFactory que incluye otra SaslServerFactory y habilita los filtros de mecanismos en base al nombre del mecanismo y el nombre y la versi\u00F3n del proveedor. Todo mecanismo cargado por f\u00E1bricas no ubicadas utilizando un proveedor no ser\u00E1 filtrado por esta definici\u00F3n.
elytron.mechanism-provider-filtering-sasl-server-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor sasl.
elytron.mechanism-provider-filtering-sasl-server-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor sasl.
elytron.mechanism-provider-filtering-sasl-server-factory.sasl-server-factory=Referencia a la f\u00E1brica del servidor sasl que debe incluir esta definici\u00F3n.
elytron.mechanism-provider-filtering-sasl-server-factory.enabling=Cuando se establece como 'true', no se habilita ning\u00FAn mecanismo cargado por el proveedor a menos que coincida con uno de los filtros; cuando se establece como 'false', tiene el efecto contrario.
elytron.mechanism-provider-filtering-sasl-server-factory.filters=Los filtros que se deben aplicar al comparar los mecanismos de los proveedores, un filtro coincide cuando todos los valores especificados coinciden con el par mecanismo/proveedor.
elytron.mechanism-provider-filtering-sasl-server-factory.filters.mechanism-name=Esta configuraci\u00F3n solo se aplicar\u00E1 en los casos en que se utiliza un mecanismo con el nombre especificado. Si se omite este atributo, esto coincidir\u00E1 con cualquier nombre de mecanismo.
elytron.mechanism-provider-filtering-sasl-server-factory.filters.provider-name=El nombre del proveedor con el cual se debe coincidir.
elytron.mechanism-provider-filtering-sasl-server-factory.filters.provider-version=Versi\u00F3n para comparar con la versi\u00F3n informada por el proveedor.
elytron.mechanism-provider-filtering-sasl-server-factory.filters.version-comparison=Cuando se establece en 'less-than', un proveedor lo har\u00E1 coincidir con el filtro si la versi\u00F3n del proveedor es menor que la versi\u00F3n especificada aqu\u00ED. Establecerlo en 'greater-than' causa el resultado contrario. No tiene efecto si no se especific\u00F3 una provider-version en el filtro.
elytron.mechanism-provider-filtering-sasl-server-factory.available-mechanisms=Los mecanismos SASL disponibles de esta f\u00E1brica despu\u00E9s de haberse aplicado todos los filtros.
elytron.provider-sasl-server-factory=Una definici\u00F3n de la f\u00E1brica del servidor sasl donde la f\u00E1brica del servidor sasl es una adici\u00F3n de f\u00E1bricas del Proveedor[]
elytron.provider-sasl-server-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor sasl.
elytron.provider-sasl-server-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor sasl.
elytron.provider-sasl-server-factory.providers=Los proveedores a utilizar para ubicar las f\u00E1bricas. Si no se especifica, se usar\u00E1 la lista de proveedores registrada a nivel global.
elytron.provider-sasl-server-factory.available-mechanisms=Los mecanismos SASL disponibles de esta f\u00E1brica despu\u00E9s de haberse aplicado todos los filtros.
elytron.service-loader-sasl-server-factory=Una definici\u00F3n de la f\u00E1brica del servidor sasl donde la f\u00E1brica del servidor sasl es una adici\u00F3n de f\u00E1bricas identificadas utilizando un ServiceLoader
elytron.service-loader-sasl-server-factory.add=La operaci\u00F3n de a\u00F1adir para la f\u00E1brica del servidor sasl.
elytron.service-loader-sasl-server-factory.remove=La operaci\u00F3n de eliminaci\u00F3n para la f\u00E1brica del servidor sasl.
elytron.service-loader-sasl-server-factory.module=El m\u00F3dulo a usar para obtener el cargador de clase para cargar las f\u00E1bricas. De no especificarse, se usar\u00E1 en su lugar el cargador de clase para cargar el recurso.
elytron.service-loader-sasl-server-factory.available-mechanisms=Los mecanismos SASL disponibles de esta f\u00E1brica despu\u00E9s de haberse aplicado todos los filtros.
elytron.key-store=Una definici\u00F3n de KeyStore. 
elytron.key-store.add=Agregue una nueva definici\u00F3n de KeyStore.
elytron.key-store.remove=Elimine la definici\u00F3n de KeyStore.
elytron.key-store.load=Cargue el KeyStore; si el KeyStore est\u00E1 respaldado por un archivo, esto implicar\u00E1 la relectura de los contenidos del archivo.
elytron.key-store.store=Almacene el KeyStore en un archivo; esta operaci\u00F3n fallar\u00E1 para cualquier instancia de KeyStore no respaldada por un archivo. Si el archivo no existe y no fue marcado seg\u00FAn lo requerido, ser\u00E1 creado.
elytron.key-store.type=El tipo de KeyStore, utilizado al crear la nueva instancia de KeyStore.
elytron.key-store.provider-name=El nombre del proveedor que debe utilizarse para cargar el KeyStore deshabilita la b\u00FAsqueda del primer proveedor que puede crear un KeyStore del tipo especificado.
elytron.key-store.credential-reference=La referencia a la credencial almacenada en CredentialStore bajo el alias definido o la contrase\u00F1a del texto sin cifrar.
elytron.key-store.credential-reference.store=El nombre del almac\u00E9n de credenciales que mantiene el alias en la credencial.
elytron.key-store.credential-reference.alias=El alias que designa un secreto almacenado o una credencial almacenada en el almac\u00E9n.
elytron.key-store.credential-reference.type=El tipo de credencial que designa esta referencia.
elytron.key-store.credential-reference.clear-text=Secreto especificado mediante texto sin cifrar. Verifique la manera en que el almac\u00E9n de credenciales proporciona credenciales/secretos a servicios.
elytron.key-store.relative-to=La ruta de base a la que la ruta es relativa. 
elytron.key-store.path=La ruta completa al archivo KeyStore.
elytron.key-store.required=\u00BFEl archivo debe existir al momento en que el servicio KeyStore comienza?
elytron.key-store.providers=Una referencia a los proveedores que deben utilizarse para obtener la lista de instancias del proveedor que se deben buscar. Si no se especifica, se utilizar\u00E1 la lista global de proveedores en su lugar.
elytron.key-store.alias-filter=Un filtro para aplicar a los alias regresados del KeyStore, puede ser una lista de alias separada por coma la que debe regresar, o uno de los siguientes formatos ALL\:-alias1\:-alias2, NONE\:+alias1\:+alias2
elytron.key-store.state=El estado del servicio subyacente que representa este KeyStore en el tiempo de ejecuci\u00F3n; de ser cualquier otro que no sea UP, las operaciones de tiempo de ejecuci\u00F3n no estar\u00E1n disponibles.
elytron.key-store.synchronized=El momento en que este KeyStore se carg\u00F3 o guard\u00F3 por \u00FAltima vez. Nota\: algunos proveedores pueden pasar a aplicar actualizaciones despu\u00E9s de que se haya cargado el KeyStore dentro del servidor de aplicaciones.
elytron.key-store.modified=Indica si la representaci\u00F3n in-memory del KeyStore se ha modificado desde que fue cargada o almacenada.  Nota\: para algunos proveedores, las actualizaciones pueden ser inmediatas, sin continuar cargando o almacenando llamadas.
elytron.key-store.loaded-provider=Informaci\u00F3n acerca del proveedor que fue utilizada para este KeyStore.
elytron.key-store.loaded-provider.name=El nombre del proveedor utilizado para cargar el KeyStore.
elytron.key-store.loaded-provider.info=La cadena de informaci\u00F3n acerca del proveedor utilizada para este KeyStore.
elytron.key-store.loaded-provider.version=La versi\u00F3n del proveedor utilizada para cargar el KeyStore.
elytron.key-store.size=El n\u00FAmero de entradas en el KeyStore.
elytron.key-store.alias=Un alias individual dentro del KeyStore.
elytron.key-store.alias.remove=Elimine inmediatamente el alias del KeyStore. El \u00E9xito de esta operaci\u00F3n depender\u00E1 de que el proveedor de KeyStore subyacente admita eliminaciones.
elytron.key-store.alias.creation-date=La fecha de creaci\u00F3n de la entrada representada por este alias.
elytron.key-store.alias.entry-type=El tipo de entrada para este alias. Nota\: los tipos no reconocidos se informar\u00E1n como 'Other'.
elytron.key-store.alias.certificate=El certificado relacionado con el alias (Nota\: si el alias cuenta con una cadena de certificado, esta siempre ser\u00E1 indefinida).
elytron.key-store.alias.certificate-chain=La cadena de certificado relacionada con este alias.
elytron.key-store.alias.certificate.type=El tipo de certificado.
elytron.key-store.alias.certificate.algorithm=El algoritmo de la llave p\u00FAblica.
elytron.key-store.alias.certificate.format=El formato de la llave p\u00FAblica.
elytron.key-store.alias.certificate.public-key=La llave p\u00FAblica cifrada relacionada con el certificado.
elytron.key-store.alias.certificate.sha-1-digest=El SHA-1 digest (huella digital) del certificado.
elytron.key-store.alias.certificate.sha-256-digest=El SHA-256 digest (huella digital) del certificado.
elytron.key-store.alias.certificate.encoded=El valor cifrado del certificado.
elytron.key-store.alias.certificate.subject=El asunto del certificado.
elytron.key-store.alias.certificate.issuer=El emisor del certificado.
elytron.key-store.alias.certificate.not-before=La fecha y hora de inicio del certificado es inv\u00E1lida.
elytron.key-store.alias.certificate.not-after=La fecha y hora de inicio de caducidad del certificado.
elytron.key-store.alias.certificate.serial-number=El n\u00FAmero serial del certificado.
elytron.key-store.alias.certificate.signature-algorithm=El algoritmo utilizado para generar la firma de certificados.
elytron.key-store.alias.certificate.signature=La firma del certificado.
elytron.key-store.alias.certificate.version=La versi\u00F3n del certificado
elytron.key-store.alias.certificate-chain.type=El tipo de certificado.
elytron.key-store.alias.certificate-chain.algorithm=El algoritmo de la llave p\u00FAblica.
elytron.key-store.alias.certificate-chain.format=El formato de la llave p\u00FAblica.
elytron.key-store.alias.certificate-chain.public-key=La llave p\u00FAblica cifrada relacionada con el certificado.
elytron.key-store.alias.certificate-chain.sha-1-digest=El SHA-1 digest (huella digital) del certificado.
elytron.key-store.alias.certificate-chain.sha-256-digest=El SHA-256 digest (huella digital) del certificado.
elytron.key-store.alias.certificate-chain.encoded=El valor cifrado del certificado.
elytron.key-store.alias.certificate-chain.subject=El asunto del certificado.
elytron.key-store.alias.certificate-chain.issuer=El emisor del certificado.
elytron.key-store.alias.certificate-chain.not-before=La fecha y hora de inicio del certificado es inv\u00E1lida.
elytron.key-store.alias.certificate-chain.not-after=La fecha y hora de inicio de caducidad del certificado.
elytron.key-store.alias.certificate-chain.serial-number=El n\u00FAmero serial del certificado.
elytron.key-store.alias.certificate-chain.signature-algorithm=El algoritmo utilizado para generar la firma de certificados.
elytron.key-store.alias.certificate-chain.signature=La firma del certificado.
elytron.key-store.alias.certificate-chain.version=La versi\u00F3n del certificado.
elytron.modifiable-key-store.read-alias=Lea un alias del KeyStore.
elytron.modifiable-key-store.read-alias.alias=El alias del elemento de KeyStore que se debe leer.
elytron.modifiable-key-store.read-aliases=Lea los alias de un KeyStore.
elytron.modifiable-key-store.remove-alias=Lea un alias del KeyStore.
elytron.modifiable-key-store.remove-alias.alias=El alias del elemento de KeyStore que se debe eliminar.
elytron.ldap-key-store=Una definici\u00F3n de LdapKeyStore. 
elytron.ldap-key-store.add=A\u00F1adir un nuevo KeyStore de LDAP.
elytron.ldap-key-store.remove=Elimine el KeyStore de LDAP.
elytron.ldap-key-store.size=El tama\u00F1o del KeyStore de LDAP en cantidad de elementos/alias.
elytron.ldap-key-store.state=El estado del servicio subyacente que representa este KeyStore en el tiempo de ejecuci\u00F3n; de ser cualquier otro que no sea UP, las operaciones de tiempo de ejecuci\u00F3n no estar\u00E1n disponibles.
elytron.ldap-key-store.dir-context=El nombre de DirContext, el cual se utilizar\u00E1 para comunicarse con el servidor LDAP.
elytron.ldap-key-store.search-path=La ruta en LDAP en la que se buscar\u00E1n elementos de KeyStore.
elytron.ldap-key-store.search-recursive=Si la b\u00FAsqueda de LDAP debe ser recursiva. 
elytron.ldap-key-store.search-time-limit=El tiempo l\u00EDmite para obtener los elementos del almac\u00E9n de llaves de LDAP.
elytron.ldap-key-store.filter-alias=El filtro de LDAP para obtener un elemento del KeyStore por alias. Si esto no se especifica, el valor predeterminado ser\u00E1 (alias_attribute\={0}). La cadena '{0}' ser\u00E1 reemplazada por el alias buscado, y el valor 'alias_attribute' ser\u00E1 el valor del atributo 'alias-attribute'.
elytron.ldap-key-store.filter-certificate=El filtro de LDAP para obtener un elemento del KeyStore por certificado. Si esto no se especifica, el valor predeterminado ser\u00E1 (certificate_attribute\={0}). La cadena '{0}' ser\u00E1 reemplazada por el certificado codificado buscado, y 'certificate_attribute' ser\u00E1 el valor del atributo 'certificate-attribute'.
elytron.ldap-key-store.filter-iterate=El filtro LDAP para iterar en todos los elementos del KeyStore. Si esto no se especifica, el valor predeterminado ser\u00E1 (alias_attribute\=*). 'alias_attribute' ser\u00E1 el valor del atributo 'alias-attribute'.
elytron.ldap-key-store.new-item-template=Configuraci\u00F3n para la creaci\u00F3n del elemento. Define c\u00F3mo se ver\u00E1 la entrada LDAP del elemento del almac\u00E9n de llaves recientemente creado.
elytron.ldap-key-store.new-item-template.new-item-path=La ruta en LDAP en la que se almacenar\u00E1n los elementos de KeyStore recientemente creados.
elytron.ldap-key-store.new-item-template.new-item-rdn=El nombre del atributo LDAP, el cual se utilizar\u00E1 en el RDN de elementos recientemente creados.
elytron.ldap-key-store.new-item-template.new-item-attributes=Los atributos de LDAP, que se establecer\u00E1n para elementos recientemente creados.
elytron.ldap-key-store.new-item-template.name=El nombre del atributo LDAP.
elytron.ldap-key-store.new-item-template.value=El valor del atributo LDAP.
elytron.ldap-key-store.alias-attribute=El nombre del atributo LDAP donde se almacenar\u00E1 el alias del elemento.
elytron.ldap-key-store.certificate-attribute=El nombre del atributo LDAP donde se almacenar\u00E1 el certificado.
elytron.ldap-key-store.certificate-type=El tipo de certificado.
elytron.ldap-key-store.certificate-chain-attribute=El nombre del atributo LDAP donde se almacenar\u00E1 la cadena del certificado.
elytron.ldap-key-store.certificate-chain-type=El tipo de certificados en la cadena de certificados.
elytron.ldap-key-store.certificate-chain-encoding=La codificaci\u00F3n de la cadena de certificados.
elytron.ldap-key-store.key-attribute=El nombre del atributo LDAP, donde se almacenar\u00E1 la llave.
elytron.ldap-key-store.key-type=El tipo de KeyStore, en donde la llave ser\u00E1 serializada al atributo LDAP.
elytron.ldap-key-store.alias=Un alias individual dentro del KeyStore.
elytron.ldap-key-store.alias.remove=Elimine inmediatamente el alias del KeyStore. El \u00E9xito de esta operaci\u00F3n depender\u00E1 de que el proveedor de KeyStore subyacente admita eliminaciones.
elytron.ldap-key-store.alias.creation-date=La fecha de creaci\u00F3n de la entrada representada por este alias.
elytron.ldap-key-store.alias.entry-type=El tipo de entrada para este alias. Nota\: los tipos no reconocidos se informar\u00E1n como 'Other'.
elytron.ldap-key-store.alias.certificate=El certificado relacionado con el alias (Nota\: si el alias cuenta con una cadena de certificado, esta siempre ser\u00E1 indefinida).
elytron.ldap-key-store.alias.certificate-chain=La cadena de certificado relacionada con este alias.
elytron.ldap-key-store.alias.certificate.type=El tipo de certificado.
elytron.ldap-key-store.alias.certificate.algorithm=El algoritmo de la llave p\u00FAblica.
elytron.ldap-key-store.alias.certificate.format=El formato de la llave p\u00FAblica.
elytron.ldap-key-store.alias.certificate.public-key=La llave p\u00FAblica cifrada relacionada con el certificado.
elytron.ldap-key-store.alias.certificate.sha-1-digest=El SHA-1 digest (huella digital) del certificado.
elytron.ldap-key-store.alias.certificate.sha-256-digest=El SHA-256 digest (huella digital) del certificado.
elytron.ldap-key-store.alias.certificate.encoded=El valor cifrado del certificado.
elytron.ldap-key-store.alias.certificate.subject=El asunto del certificado.
elytron.ldap-key-store.alias.certificate.issuer=El emisor del certificado.
elytron.ldap-key-store.alias.certificate.not-before=La fecha y hora de inicio del certificado es inv\u00E1lida.
elytron.ldap-key-store.alias.certificate.not-after=La fecha y hora de inicio de caducidad del certificado.
elytron.ldap-key-store.alias.certificate.serial-number=El n\u00FAmero serial del certificado.
elytron.ldap-key-store.alias.certificate.signature-algorithm=El algoritmo utilizado para generar la firma de certificados.
elytron.ldap-key-store.alias.certificate.signature=La firma del certificado.
elytron.ldap-key-store.alias.certificate.version=La versi\u00F3n del certificado.
elytron.ldap-key-store.alias.certificate-chain.type=El tipo de certificado.
elytron.ldap-key-store.alias.certificate-chain.algorithm=El algoritmo de la llave p\u00FAblica.
elytron.ldap-key-store.alias.certificate-chain.format=El formato de la llave p\u00FAblica.
elytron.ldap-key-store.alias.certificate-chain.public-key=La llave p\u00FAblica cifrada relacionada con el certificado.
elytron.ldap-key-store.alias.certificate-chain.sha-1-digest=El SHA-1 digest (huella digital) del certificado.
elytron.ldap-key-store.alias.certificate-chain.sha-256-digest=El SHA-256 digest (huella digital) del certificado.
elytron.ldap-key-store.alias.certificate-chain.encoded=El valor cifrado del certificado.
elytron.ldap-key-store.alias.certificate-chain.subject=El asunto del certificado.
elytron.ldap-key-store.alias.certificate-chain.issuer=El emisor del certificado.
elytron.ldap-key-store.alias.certificate-chain.not-before=La fecha y hora de inicio del certificado es inv\u00E1lida.
elytron.ldap-key-store.alias.certificate-chain.not-after=La fecha y hora de inicio de caducidad del certificado.
elytron.ldap-key-store.alias.certificate-chain.serial-number=El n\u00FAmero serial del certificado.
elytron.ldap-key-store.alias.certificate-chain.signature-algorithm=El algoritmo utilizado para generar la firma de certificados.
elytron.ldap-key-store.alias.certificate-chain.signature=La firma del certificado.
elytron.ldap-key-store.alias.certificate-chain.version=La versi\u00F3n del certificado.
elytron.filtering-key-store=Elimine la definici\u00F3n de KeyStore.
elytron.filtering-key-store.add=Agregue una nueva definici\u00F3n de KeyStore.
elytron.filtering-key-store.remove=Elimine la definici\u00F3n de KeyStore.
elytron.filtering-key-store.alias-filter=Un filtro para aplicar a los alias regresados del KeyStore, puede ser una lista de alias separada por coma la que debe regresar, o uno de los siguientes formatos ALL\:-alias1\:-alias2, NONE\:+alias1\:+alias2
elytron.filtering-key-store.key-store=Nombre del KeyStore filtrado.
elytron.filtering-key-store.state=El estado del servicio subyacente que representa este KeyStore en el tiempo de ejecuci\u00F3n; de ser cualquier otro que no sea UP, las operaciones de tiempo de ejecuci\u00F3n no estar\u00E1n disponibles.
elytron.filtering-key-store.alias=Un alias individual dentro del KeyStore de filtro.
elytron.key-manager=Una definici\u00F3n del gestor de llaves para crear el KeyManager, seg\u00FAn se utiliz\u00F3 para crear un SSLContext.
elytron.key-manager.add=Agregue la nueva definici\u00F3n del gestor de llaves.
elytron.key-manager.remove=Elimine la definici\u00F3n del gestor de llaves.
elytron.key-manager.init=Reinicialice el gestor de llaves.
elytron.key-manager.algorithm=El nombre del algoritmo a utilizar para crear la KeyManagerFactory subyacente.
elytron.key-manager.providers=Referencia para obtener el Proveedor[] a usar al crear la KeyManagerFactory subyacente.
elytron.key-manager.provider-name=El nombre del proveedor a utilizar para crear la KeyManagerFactory subyacente.
elytron.key-manager.credential-reference=La referencia de la credencial para descifrar el elemento KeyStore. (No una contrase\u00F1a del KeyStore)
elytron.key-manager.credential-reference.store=El nombre del almac\u00E9n de credenciales que mantiene el alias en la credencial.
elytron.key-manager.credential-reference.alias=El alias que designa un secreto almacenado o una credencial almacenada en el almac\u00E9n.
elytron.key-manager.credential-reference.type=El tipo de credencial que designa esta referencia.
elytron.key-manager.credential-reference.clear-text=El secreto especificado mediante texto sin cifrar. Verifique la manera en que el almac\u00E9n de credenciales proporciona credenciales/secretos a servicios.
elytron.key-manager.key-store=Referencia al KeyStore a usar para inicializar la KeyManagerFactory subyacente.
elytron.key-manager.alias-filter=Un filtro para aplicar a los alias regresados del KeyStore, puede ser una lista de alias separada por coma la que debe regresar, o uno de los siguientes formatos ALL\:-alias1\:-alias2, NONE\:+alias1\:+alias2
elytron.trust-manager=Una definici\u00F3n del gestor de confianza para crear el TrustManager[], seg\u00FAn se utiliz\u00F3 para crear un SSLContext.
elytron.trust-manager.add=Agregue la nueva definici\u00F3n del gestor de confianza.
elytron.trust-manager.remove=Elimine la definici\u00F3n del gestor de confianza.
elytron.trust-manager.algorithm=El nombre del algoritmo a utilizar para crear la TrustManagerFactory subyacente.
elytron.trust-manager.providers=Referencia para obtener el Proveedor[] a usar al crear la KeyManagerFactory subyacente.
elytron.trust-manager.provider-name=El nombre del proveedor a utilizar para crear la TrustManagerFactory subyacente.
elytron.trust-manager.key-store=Referencia al KeyStore a usar para inicializar la TrustManagerFactory subyacente.
elytron.trust-manager.alias-filter=Un filtro para aplicar a los alias regresados del KeyStore, puede ser una lista de alias separada por coma la que debe regresar, o uno de los siguientes formatos ALL\:-alias1\:-alias2, NONE\:+alias1\:+alias2
elytron.trust-manager.certificate-revocation-list=Habilita verificaciones de la lista de revocaci\u00F3n del certificado.
elytron.trust-manager.certificate-revocation-list.path=La ruta a la configuraci\u00F3n a usar para inicializar el proveedor.
elytron.trust-manager.certificate-revocation-list.relative-to=La ruta de base del archivo de la lista de revocaci\u00F3n de certificados.
elytron.trust-manager.certificate-revocation-list.maximum-cert-path=La cantidad m\u00E1xima de certificados intermedios que no fueron autoemitidos y que pueden existir en una ruta de certificaci\u00F3n.
elytron.trust-manager.reload-certificate-revocation-list=Notifique al gestor de confianza para recargar la lista de revocaci\u00F3n del certificado, de definirse.
elytron.client-ssl-context=Un SSLContext para usar en el lado del cliente de una conexi\u00F3n.
elytron.client-ssl-context.add=Agregue la definici\u00F3n de SSLContext.
elytron.client-ssl-context.remove=Elimine la definici\u00F3n de SSLContext.
elytron.client-ssl-context.cipher-suite-filter=El filtro a aplicar para especificar las suites de cifras habilitadas.
elytron.client-ssl-context.protocols=Los protocolos habilitados.
elytron.client-ssl-context.use-cipher-suites-order=Para aceptar la preferencia de suites de cifras locales.
elytron.client-ssl-context.maximum-session-cache-size=La cantidad m\u00E1xima de sesiones de SSL en el cach\u00E9. El valor predeterminado -1 implica el uso del valor predeterminado de JVM. El valor cero implica que no hay l\u00EDmites.
elytron.client-ssl-context.session-timeout=El tiempo de expiraci\u00F3n de las sesiones SSL, en segundos. El valor predeterminado -1 implica el uso del valor predeterminado de JVM. El valor cero implica que no hay l\u00EDmites.
elytron.client-ssl-context.key-manager=Referencia al gestor de llaves que se debe usar dentro del contexto SSLContext.
elytron.client-ssl-context.key-refresh=Actualice el KeyManager utilizado por SSLContext.
elytron.client-ssl-context.trust-manager=Referencia al gestor de confianza que se debe usar dentro de SSLContext.
elytron.client-ssl-context.provider-name=El nombre del proveedor a usar. De no estar especificado, todos los proveedores de proveedores se enviar\u00E1n al SSLContext.
elytron.client-ssl-context.providers=El nombre de los proveedores para obtener el Proveedor[] a usar para cargar el SSLContext.
elytron.client-ssl-context.active-session-count=El conteo de sesiones activas actuales.
elytron.client-ssl-context.ssl-session=Una sesi\u00F3n de SSL establecida actualmente.
elytron.client-ssl-context.ssl-session.application-buffer-size=El tama\u00F1o del b\u00FAfer de la aplicaci\u00F3n seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.cipher-suite=La suite de cifras seleccionada seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.creation-time=La hora de creaci\u00F3n seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.last-accessed-time=La hora del \u00FAltimo acceso seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.local-principal=El principal local seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.packet-buffer-size=El tama\u00F1o del b\u00FAfer del paquete seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.peer-host=El host de pares seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.peer-port=El puerto de pares seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.peer-principal=El principal de pares seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.protocol=El protocolo seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.valid=La validez de la sesi\u00F3n seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.local-certificates=Los certificados locales seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.local-certificates.type=El tipo de certificado.
elytron.client-ssl-context.ssl-session.local-certificates.algorithm=El algoritmo de la llave p\u00FAblica.
elytron.client-ssl-context.ssl-session.local-certificates.format=El formato de la llave p\u00FAblica.
elytron.client-ssl-context.ssl-session.local-certificates.public-key=La llave p\u00FAblica cifrada relacionada con el certificado.
elytron.client-ssl-context.ssl-session.local-certificates.sha-1-digest=El SHA-1 digest (huella digital) del certificado.
elytron.client-ssl-context.ssl-session.local-certificates.sha-256-digest=El SHA-256 digest (huella digital) del certificado.
elytron.client-ssl-context.ssl-session.local-certificates.encoded=El valor cifrado del certificado.
elytron.client-ssl-context.ssl-session.local-certificates.subject=El asunto del certificado.
elytron.client-ssl-context.ssl-session.local-certificates.issuer=El emisor del certificado.
elytron.client-ssl-context.ssl-session.local-certificates.not-before=La fecha y hora de inicio del certificado es inv\u00E1lida.
elytron.client-ssl-context.ssl-session.local-certificates.not-after=La fecha y hora de inicio de caducidad del certificado.
elytron.client-ssl-context.ssl-session.local-certificates.serial-number=El n\u00FAmero serial del certificado.
elytron.client-ssl-context.ssl-session.local-certificates.signature-algorithm=El algoritmo utilizado para generar la firma de certificados.
elytron.client-ssl-context.ssl-session.local-certificates.signature=La firma del certificado.
elytron.client-ssl-context.ssl-session.local-certificates.version=La versi\u00F3n del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates=Los certificados locales seg\u00FAn lo informado por la SSLSession.
elytron.client-ssl-context.ssl-session.peer-certificates.type=El tipo de certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.algorithm=El algoritmo de la llave p\u00FAblica.
elytron.client-ssl-context.ssl-session.peer-certificates.format=El formato de la llave p\u00FAblica.
elytron.client-ssl-context.ssl-session.peer-certificates.public-key=La llave p\u00FAblica cifrada relacionada con el certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.sha-1-digest=El SHA-1 digest (huella digital) del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.sha-256-digest=El SHA-256 digest (huella digital) del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.encoded=El valor cifrado del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.subject=El asunto del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.issuer=El emisor del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.not-before=La fecha y hora de inicio del certificado es inv\u00E1lida.
elytron.client-ssl-context.ssl-session.peer-certificates.not-after=La fecha y hora de inicio de caducidad del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.serial-number=El n\u00FAmero serial del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.signature-algorithm=El algoritmo utilizado para generar la firma de certificados.
elytron.client-ssl-context.ssl-session.peer-certificates.signature=La firma del certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.version=La versi\u00F3n del certificado.
elytron.client-ssl-context.ssl-session.invalidate=Invalide la SSLSession (Nota\: esto no finaliza las conexiones actuales, solo evita que las futuras conexiones se unan a, o reanuden, esta sesi\u00F3n).
elytron.server-ssl-context=Un SSLContext para su uso en el lado del servidor de una conexi\u00F3n.
elytron.server-ssl-context.add=Agregue la definici\u00F3n de SSLContext.
elytron.server-ssl-context.remove=Elimine la definici\u00F3n de SSLContext.
elytron.server-ssl-context.security-domain=El dominio de seguridad a usarse para la autenticaci\u00F3n al establecer la sesi\u00F3n SSL.
elytron.server-ssl-context.cipher-suite-filter=El filtro a aplicar para especificar las suites de cifras habilitadas.
elytron.server-ssl-context.protocols=Los protocolos habilitados.
elytron.server-ssl-context.want-client-auth=Solicitar (de manera opcional) un certificado de cliente en handshake de SSL. Si se hace referencia a un dominio de seguridad y admite la evidencia X509, se establecer\u00E1 como verdadero autom\u00E1ticamente. Se ignorar\u00E1 cuando se establezca need-client-auth.
elytron.server-ssl-context.need-client-auth=Requerir un certificado de cliente en el handshake de SSL. Se rechazar\u00E1 la conexi\u00F3n sin certificado del cliente confiado (consultar trust-manager).
elytron.server-ssl-context.authentication-optional=El rechazo del certificado del cliente por el dominio de seguridad no impedir\u00E1 la conexi\u00F3n. Permite una ca\u00EDda para usar otros mecanismos de autenticaci\u00F3n (como el inicio de sesi\u00F3n del formato) cuando el certificado  del cliente es rechazado por el dominio de seguridad. Tiene efecto solo cuando se establece el dominio de seguridad.
elytron.server-ssl-context.use-cipher-suites-order=Para aceptar la preferencia de suites de cifras locales.
elytron.server-ssl-context.maximum-session-cache-size=La cantidad m\u00E1xima de sesiones de SSL en el cach\u00E9. El valor predeterminado -1 implica el uso del valor predeterminado de JVM. El valor cero implica que no hay l\u00EDmites.
elytron.server-ssl-context.session-timeout=El tiempo de expiraci\u00F3n de las sesiones SSL, en segundos. El valor predeterminado -1 implica el uso del valor predeterminado de JVM. El valor cero implica que no hay l\u00EDmites.
elytron.server-ssl-context.wrap=\u00BFSe deber\u00EDan envolver las instancias SSLEngine, SSLSocket y SSLServerSocket devueltas para protegerse de modificaciones posteriores?
elytron.server-ssl-context.key-manager=Referencia al gestor de llaves que se debe usar dentro del contexto SSLContext.
elytron.server-ssl-context.key-refresh=Actualice el KeyManager utilizado por SSLContext.
elytron.server-ssl-context.trust-manager=Referencia al gestor de confianza que se debe usar dentro de SSLContext.
elytron.server-ssl-context.pre-realm-principal-transformer=Un transformador principal para aplicar antes de seleccionar el dominio.
elytron.server-ssl-context.post-realm-principal-transformer=Un transformador principal para aplicar despu\u00E9s de seleccionar el dominio.
elytron.server-ssl-context.final-principal-transformer=Un transformador principal final para aplicar para este dominio del mecanismo.
elytron.server-ssl-context.realm-mapper=El mapeador del dominio que se debe usar para la autenticaci\u00F3n de SSL.
elytron.server-ssl-context.provider-name=El nombre del proveedor a usar. De no estar especificado, todos los proveedores de proveedores se enviar\u00E1n al SSLContext.
elytron.server-ssl-context.providers=El nombre de los proveedores para obtener el Proveedor[] a usar para cargar el SSLContext.
elytron.server-ssl-context.active-session-count=El conteo de sesiones activas actuales.
elytron.server-ssl-context.ssl-session=Una sesi\u00F3n de SSL establecida actualmente.
elytron.server-ssl-context.ssl-session.application-buffer-size=El tama\u00F1o del b\u00FAfer de la aplicaci\u00F3n seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.cipher-suite=La suite de cifras seleccionada seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.creation-time=La hora de creaci\u00F3n seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.last-accessed-time=La hora del \u00FAltimo acceso seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.local-principal=El principal local seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.packet-buffer-size=El tama\u00F1o del b\u00FAfer del paquete seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.peer-host=El host de pares seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.peer-port=El puerto de pares seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.peer-principal=El principal de pares seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.protocol=El protocolo seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.valid=La validez de la sesi\u00F3n seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.local-certificates=Los certificados locales seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.local-certificates.type=El tipo de certificado.
elytron.server-ssl-context.ssl-session.local-certificates.algorithm=El algoritmo de la llave p\u00FAblica.
elytron.server-ssl-context.ssl-session.local-certificates.format=El formato de la llave p\u00FAblica.
elytron.server-ssl-context.ssl-session.local-certificates.public-key=La llave p\u00FAblica cifrada relacionada con el certificado.
elytron.server-ssl-context.ssl-session.local-certificates.sha-1-digest=El SHA-1 digest (huella digital) del certificado.
elytron.server-ssl-context.ssl-session.local-certificates.sha-256-digest=El SHA-256 digest (huella digital) del certificado.
elytron.server-ssl-context.ssl-session.local-certificates.encoded=El valor cifrado del certificado.
elytron.server-ssl-context.ssl-session.local-certificates.subject=El asunto del certificado.
elytron.server-ssl-context.ssl-session.local-certificates.issuer=El emisor del certificado.
elytron.server-ssl-context.ssl-session.local-certificates.not-before=La fecha y hora de inicio del certificado es inv\u00E1lida.
elytron.server-ssl-context.ssl-session.local-certificates.not-after=La fecha y hora de inicio de caducidad del certificado.
elytron.server-ssl-context.ssl-session.local-certificates.serial-number=El n\u00FAmero serial del certificado.
elytron.server-ssl-context.ssl-session.local-certificates.signature-algorithm=El algoritmo utilizado para generar la firma de certificados.
elytron.server-ssl-context.ssl-session.local-certificates.signature=La firma del certificado.
elytron.server-ssl-context.ssl-session.local-certificates.version=La versi\u00F3n del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates=Los certificados locales seg\u00FAn lo informado por la SSLSession.
elytron.server-ssl-context.ssl-session.peer-certificates.type=El tipo de certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.algorithm=El algoritmo de la llave p\u00FAblica.
elytron.server-ssl-context.ssl-session.peer-certificates.format=El formato de la llave p\u00FAblica.
elytron.server-ssl-context.ssl-session.peer-certificates.public-key=La llave p\u00FAblica cifrada relacionada con el certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.sha-1-digest=El SHA-1 digest (huella digital) del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.sha-256-digest=El SHA-256 digest (huella digital) del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.encoded=El valor cifrado del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.subject=El asunto del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.issuer=El emisor del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.not-before=La fecha y hora de inicio del certificado es inv\u00E1lida.
elytron.server-ssl-context.ssl-session.peer-certificates.not-after=La fecha y hora de inicio de caducidad del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.serial-number=El n\u00FAmero serial del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.signature-algorithm=El algoritmo utilizado para generar la firma de certificados.
elytron.server-ssl-context.ssl-session.peer-certificates.signature=La firma del certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.version=La versi\u00F3n del certificado.
elytron.server-ssl-context.ssl-session.invalidate=Invalide la SSLSession (nota\: esto no finaliza las conexiones actuales, solo evita que las futuras conexiones se unan a, o reanuden, esta sesi\u00F3n).
elytron.credential-store=Almac\u00E9n de credenciales para mantener el alias para informaci\u00F3n sensible, como contrase\u00F1as para los servicios externos.
elytron.credential-store.name=Nombre del almac\u00E9n de credenciales.
elytron.credential-store.type=El tipo del almac\u00E9n de credenciales, por ej., KeyStoreCredentialStore.
elytron.credential-store.credential-reference=Referencia de credenciales que debe usarse para crear un par\u00E1metro de protecci\u00F3n.
elytron.credential-store.credential-reference.store=El nombre del almac\u00E9n de credenciales que mantiene el alias en la credencial.
elytron.credential-store.credential-reference.alias=El alias que designa un secreto almacenado o una credencial almacenada en el almac\u00E9n.
elytron.credential-store.credential-reference.type=El tipo de credencial que designa esta referencia.
elytron.credential-store.credential-reference.clear-text=Secreto especificado mediante texto sin cifrar. Verifique la manera en que el almac\u00E9n de credenciales proporciona credenciales/secretos a servicios.
elytron.credential-store.loaded-provider=Informaci\u00F3n acerca del proveedor que carg\u00F3 la implementaci\u00F3n de este tipo de almac\u00E9n de credenciales.
elytron.credential-store.loaded-provider.name=El nombre del cargador del proveedor.
elytron.credential-store.loaded-provider.info=La cadena de informaci\u00F3n acerca del cargador del proveedor.
elytron.credential-store.loaded-provider.version=La versi\u00F3n del proveedor utilizada para cargar el almac\u00E9n de credenciales.
elytron.credential-store.providers=El nombre de los proveedores definidos dentro del subsistema para obtener los proveedores para buscar el que pueda crear el tipo de CredentialStore requerido. Si no se especifica, se utilizar\u00E1 la lista global de proveedores en su lugar.
elytron.credential-store.other-providers=El nombre de los proveedores definidos dentro del subsistema para obtener los proveedores para buscar el que pueda crear los objetos JCA requeridos dentro del almac\u00E9n de credenciales. Esto es v\u00E1lido \u00FAnicamente para la CredentialStore basada en key-store. Si no se especifica, se utilizar\u00E1 la lista global de proveedores en su lugar.
elytron.credential-store.provider-name=El nombre del proveedor que debe utilizarse para instanciar el CredentialStoreSpi. Si no se especifica el proveedor, se utilizar\u00E1 el primer proveedor encontrado que pueda crear una instancia del 'type' especificado.
elytron.credential-store.implementation-properties=Mapa de las propiedades espec\u00EDficas de implementaci\u00F3n del almac\u00E9n de credenciales.
elytron.credential-store.location=Nombre del almacenamiento del almac\u00E9n de credenciales.
elytron.credential-store.modifiable=Especifica si el almac\u00E9n de credenciales es modificable.
elytron.credential-store.create=Especifica si el almac\u00E9n de credenciales debe crear almacenamiento cuando no existe.
elytron.credential-store.relative-to=Referencia a una ruta predefinido a la que el nombre del archivo es relativo. 
elytron.credential-store.add=Agregue otro almac\u00E9n de credenciales a la configuraci\u00F3n.
elytron.credential-store.remove=Elimine el almac\u00E9n de credenciales de la configuraci\u00F3n.
elytron.credential-store.reload=Recargue el almac\u00E9n de credenciales (reinicialice y cargue nuevos datos si est\u00E1n disponibles).
elytron.credential-store.state=El estado del servicio subyacente que representa este almac\u00E9n de credenciales en el tiempo de ejecuci\u00F3n.
elytron.credential-store.read-aliases=Lea los alias (entradas) de un almac\u00E9n de credenciales.
elytron.credential-store.add-alias=Agregue un alias al almac\u00E9n de credenciales.
elytron.credential-store.add-alias.alias=El alias del elemento del almac\u00E9n de credenciales para agregar.
elytron.credential-store.add-alias.entry-type=Tipo de credencial (entrada) almacenada en el almac\u00E9n de credenciales.
elytron.credential-store.add-alias.secret-value=Valor secreto como una contrase\u00F1a
elytron.credential-store.remove-alias=Elimine la credencial (entrada) almacenada en el almac\u00E9n de credenciales.
elytron.credential-store.remove-alias.alias=El alias del elemento del almac\u00E9n de credenciales que se debe eliminar.
elytron.credential-store.set-secret=Establezca el valor secreto de una credencial (entrada) almacenada en el almac\u00E9n de credenciales.
elytron.credential-store.set-secret.alias=El alias del elemento del almac\u00E9n de credenciales que se debe establecer.
elytron.credential-store.set-secret.entry-type=Tipo de credencial (entrada) almacenada en el almac\u00E9n de credenciales.
elytron.credential-store.set-secret.secret-value=Valor secreto como una contrase\u00F1a
elytron.dir-context=La configuraci\u00F3n para conectarse a un servidor (LDAP) del directorio.
elytron.dir-context.add=Agregue la definici\u00F3n de DirContext.
elytron.dir-context.remove=Elimine la definici\u00F3n de DirContext.
elytron.dir-context.url=La URL de conexi\u00F3n.
elytron.dir-context.authentication-level=El nivel de autenticaci\u00F3n (nivel de seguridad/mecanismo de autenticaci\u00F3n) a usar. Corresponde a la propiedad del entorno SECURITY_AUTHENTICATION ("java.naming.security.authentication"). Valores permitidos\: "none", "simple", sasl_mech, where sasl_mech es una lista de nombres del mecanismo SASL separada por espacio.
elytron.dir-context.authentication-context=El contexto de autenticaci\u00F3n para obtener credenciales de inicio de sesi\u00F3n para conectarse al servidor LDAP. Se puede omitir si el nivel de autenticaci\u00F3n is "none" (an\u00F3nimo).
elytron.dir-context.principal=El principal para autenticar y conectarse al servidor LDAP. Se puede omitir si el nivel de autenticaci\u00F3n es "none" (an\u00F3nimo).
elytron.dir-context.credential-reference=La referencia de la credencial para autenticar y conectarse al servidor LDAP. Se puede omitir si el nivel de autenticaci\u00F3n es "none" (an\u00F3nimo).
elytron.dir-context.credential-reference.store=El nombre del almac\u00E9n de credenciales que mantiene el alias en la credencial.
elytron.dir-context.credential-reference.alias=El alias que designa un secreto almacenado o una credencial almacenada en el almac\u00E9n.
elytron.dir-context.credential-reference.type=El tipo de credencial que designa esta referencia.
elytron.dir-context.credential-reference.clear-text=Secreto especificado mediante texto sin cifrar. Verifique la manera en que el almac\u00E9n de credenciales proporciona credenciales/secretos a servicios.
elytron.dir-context.enable-connection-pooling=Indica si el pooling de conexi\u00F3n est\u00E1 habilitado.
elytron.dir-context.module=El nombre del m\u00F3dulo que se usar\u00E1 como base de carga de la clase.
elytron.dir-context.referral-mode=Si se deben seguir las remisiones.
elytron.dir-context.ssl-context=El nombre de ssl-context utilizado para garantizar la conexi\u00F3n al servidor LDAP.
elytron.dir-context.connection-timeout=El tiempo de espera para conectarse al servidor LDAP en milisegundos.
elytron.dir-context.read-timeout=El tiempo de espera de lectura para una operaci\u00F3n LDAP en milisegundos.
elytron.dir-context.properties=Las propiedades de conexi\u00F3n adicionales para el DirContext.
elytron.policy=Una definici\u00F3n que configura un proveedor de pol\u00EDticas.
elytron.policy.add=Agregue una operaci\u00F3n para a\u00F1adir un proveedor de pol\u00EDticas.
elytron.policy.remove=Elimine una operaci\u00F3n para eliminar un proveedor de pol\u00EDticas.
elytron.policy.default-policy=El nombre de un proveedor de pol\u00EDticas predeterminado.
elytron.policy.jacc-policy=Una definici\u00F3n de proveedor de pol\u00EDticas que configura JACC y servicios relacionados.
elytron.policy.jacc-policy.name=El nombre de este proveedor.
elytron.policy.jacc-policy.policy=El nombre de una implementaci\u00F3n java.security.Policy que hace referencia a un proveedor de pol\u00EDticas.
elytron.policy.jacc-policy.configuration-factory=El nombre de una implementaci\u00F3n javax.security.jacc.PolicyConfigurationFactory que hace referencia a un proveedor de f\u00E1bricas de configuraci\u00F3n de pol\u00EDticas.
elytron.policy.jacc-policy.module=El nombre del m\u00F3dulo desde donde cargar el proveedor.
elytron.policy.custom-policy=Una definici\u00F3n del proveedor de pol\u00EDticas personalizado.
elytron.policy.custom-policy.add=Agregue una operaci\u00F3n para a\u00F1adir el proveedor personalizado.
elytron.policy.custom-policy.remove=Elimine una operaci\u00F3n para eliminar el proveedor personalizado.
elytron.policy.custom-policy.name=El nombre de este proveedor.
elytron.policy.custom-policy.class-name=El nombre de una implementaci\u00F3n java.security.Policy que hace referencia a un proveedor de pol\u00EDticas.
elytron.policy.custom-policy.module=El nombre del m\u00F3dulo desde donde cargar el proveedor.
