elytron=O subsistema Elytron
elytron.add=A opera\u00E7\u00E3o adiciona o subsistema Elytron
elytron.remove=A opera\u00E7\u00E3o remove o subsistema Elytron
elytron.default-authentication-context=O contexto de autentica\u00E7\u00E3o padr\u00E3o a ser associado com todas as implanta\u00E7\u00F5es.
elytron.initial-providers=Refer\u00EAncia aos Provedores que deve ser registrada antes de todos os Provedores existentes.
elytron.final-providers=Refer\u00EAncia aos Provedores que deve ser registrada depois de todos os Provedores existentes.
elytron.disallowed-providers=Uma lista de provedores n\u00E3o permitidos e que ser\u00E3o removidos da lista de provedores.
elytron.security-properties=Propriedades de seguran\u00E7a a serem definidas.
elytron.authentication-configuration=Uma defini\u00E7\u00E3o de configura\u00E7\u00E3o de autentica\u00E7\u00E3o individual.
elytron.authentication-configuration.add=Adicionar uma nova defini\u00E7\u00E3o de configura\u00E7\u00E3o de autentica\u00E7\u00E3o.
elytron.authentication-configuration.remove=Remover a defini\u00E7\u00E3o de configura\u00E7\u00E3o de autentica\u00E7\u00E3o .
elytron.authentication-configuration.extends=Uma configura\u00E7\u00E3o de autentica\u00E7\u00E3o definida anteriormente.
elytron.authentication-configuration.anonymous=Ativa a autentica\u00E7\u00E3o an\u00F4nima.
elytron.authentication-configuration.authentication-name=O nome de autentica\u00E7\u00E3o a ser usado.
elytron.authentication-configuration.authorization-name=O nome da autoriza\u00E7\u00E3o a ser usada.
elytron.authentication-configuration.host=O host a ser usado.
elytron.authentication-configuration.port=A porta a ser usada.
elytron.authentication-configuration.protocol=O protocolo a ser usado.
elytron.authentication-configuration.realm=O realm a ser usado.
elytron.authentication-configuration.security-domain=Refer\u00EAncia a um dom\u00EDnio de seguran\u00E7a para obter uma identidade encaminhada.
elytron.authentication-configuration.sasl-mechanism-selector=A string do seletor do mecanismo SASL.
elytron.authentication-configuration.mechanism-properties=Propriedades de configura\u00E7\u00E3o do mecanismo de autentica\u00E7\u00E3o SASL.
elytron.authentication-configuration.mechanism-properties.name=Nome da propriedade.
elytron.authentication-configuration.mechanism-properties.value=Valor da propriedade. 
elytron.authentication-configuration.credential-reference=A refer\u00EAncia da credencial armazenada em CredentialStore no alias definido ou na senha com texto n\u00E3o criptografado. 
elytron.authentication-configuration.credential-reference.store=O nome do reposit\u00F3rio de credenciais contendo o alias da credencial.
elytron.authentication-configuration.credential-reference.alias=O alias que denota credencial ou segredo armazenado no reposit\u00F3rio.
elytron.authentication-configuration.credential-reference.type=O tipo de credencial que esta refer\u00EAncia est\u00E1 denotando.
elytron.authentication-configuration.credential-reference.clear-text=O segredo especificado usando texto n\u00E3o criptografado. Verifique como o reposit\u00F3rio de credenciais fornece credenciais/segredos aos servi\u00E7os.
elytron.authentication-configuration.kerberos-security-factory=Refer\u00EAncia a uma f\u00E1brica de seguran\u00E7a kerberos usada para obter uma credencial kerberos GSS
elytron.authentication-context=Uma defini\u00E7\u00E3o de contexto de autentica\u00E7\u00E3o individual.
elytron.authentication-context.add=Adicionar uma nova defini\u00E7\u00E3o de contexto de autentica\u00E7\u00E3o.
elytron.authentication-context.remove=Remover a defini\u00E7\u00E3o de contexto de autentica\u00E7\u00E3o.
elytron.authentication-context.extends=Um contexto de autentica\u00E7\u00E3o definido anteriormente a ser estendido.
elytron.authentication-context.match-rules=O atributo match-rules para este contexto de autentica\u00E7\u00E3o.
elytron.authentication-context.match-rules.match-abstract-type=O tipo abstrato para a correspond\u00EAncia.
elytron.authentication-context.match-rules.match-abstract-type-authority=A autoridade do tipo abstrato para a correspond\u00EAncia.
elytron.authentication-context.match-rules.match-host=O host para a correspond\u00EAncia.
elytron.authentication-context.match-rules.match-local-security-domain=O dom\u00EDnio de seguran\u00E7a local para a correspond\u00EAncia.
elytron.authentication-context.match-rules.match-no-user=Nenhum usu\u00E1rio correspondente.
elytron.authentication-context.match-rules.match-path=O patch para a correspond\u00EAncia.
elytron.authentication-context.match-rules.match-port=A porta para a correspond\u00EAncia.
elytron.authentication-context.match-rules.match-protocol=O protocolo para a correspond\u00EAncia.
elytron.authentication-context.match-rules.match-urn=O URN para a correspond\u00EAncia.
elytron.authentication-context.match-rules.match-user=O usu\u00E1rio para a correspond\u00EAncia.
elytron.authentication-context.match-rules.authentication-configuration=A configura\u00E7\u00E3o de autentica\u00E7\u00E3o a ser usada para uma correspond\u00EAncia com \u00EAxito.
elytron.authentication-context.match-rules.ssl-context=O SSLContext a ser usado para uma correspond\u00EAncia com \u00EAxito.
elytron.aggregate-providers=Uma agrega\u00E7\u00E3o de dois ou mais recursos do Provedor [].
elytron.aggregate-providers.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o recurso dos provedores agregados
elytron.aggregate-providers.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o recurso dos provedores agregados
elytron.aggregate-providers.providers=Os recursos do Provedor [] referenciado a serem agregados.
elytron.provider-loader=Uma defini\u00E7\u00E3o para um carregador de Provedor.
elytron.provider-loader.add=Adicionar uma nova defini\u00E7\u00E3o de carregador do provedor.
elytron.provider-loader.remove=Remover uma defini\u00E7\u00E3o de carregador do provedor.
elytron.provider-loader.module=O nome do m\u00F3dulo para carregar o provedor.
elytron.provider-loader.class-names=O nome da classe inteiramente qualificada dos provedores a serem carregados. Elas ser\u00E3o carregadas ap\u00F3s os provedores de descoberta service-loader e as duplicadas ser\u00E3o ignoradas.
elytron.provider-loader.path=O caminho do arquivo a ser usado para inicializar os provedores.
elytron.provider-loader.relative-to=O caminho base do arquivo de configura\u00E7\u00E3o.
elytron.provider-loader.argument=Um argumento a ser passado no construtor conforme o Provedor for instanciado.
elytron.provider-loader.configuration=A configura\u00E7\u00E3o de valor/chave a ser passada ao Provedor para inicializ\u00E1-lo.
elytron.provider-loader.loaded-providers=A lista de provedores carregados por este carregador de provedor.
elytron.provider-loader.loaded-providers.name=O nome informado pela inst\u00E2ncia do provedor.
elytron.provider-loader.loaded-providers.info=As informa\u00E7\u00F5es fornecidas pela inst\u00E2ncia do provedor.
elytron.provider-loader.loaded-providers.version=A vers\u00E3o informada pela inst\u00E2ncia do provedor.
elytron.provider-loader.loaded-providers.services=Lista de servi\u00E7os dispon\u00EDveis neste provedor.
elytron.provider-loader.loaded-providers.type=O tipo de servi\u00E7o.
elytron.provider-loader.loaded-providers.algorithm=O algoritmo suportado pelo servi\u00E7o.
elytron.provider-loader.loaded-providers.class-name=O nome da classe da implementa\u00E7\u00E3o do servi\u00E7o SPI.
elytron.aggregate-security-event-listener=Uma agrega\u00E7\u00E3o de dois ou mais recursos do ouvinte do evento de seguran\u00E7a.
elytron.aggregate-security-event-listener.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o recurso do ouvinte do evento de seguran\u00E7a agregado.
elytron.aggregate-security-event-listener.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o recurso do ouvinte do evento de seguran\u00E7a agregado.
elytron.aggregate-security-event-listener.security-event-listeners=Os recursos do ouvinte do evento de seguran\u00E7a referenciado a serem agregados.
elytron.file-audit-log=Um logger de auditoria que faz o registro em um arquivo local.
elytron.file-audit-log.add=Adicionar o recurso do logger de auditoria.
elytron.file-audit-log.remove=Remover o recurso do logger de auditoria.
elytron.file-audit-log.path=Caminho do arquivo a ser gravado.
elytron.file-audit-log.relative-to=O caminho relativo para o log de auditoria.
elytron.file-audit-log.synchronized=Se cada evento deve ser imediatamente sincronizado com o disco.
elytron.file-audit-log.format=O formato a ser usado para registrar os eventos de auditoria.
elytron.periodic-rotating-file-audit-log=Uma defini\u00E7\u00E3o de log de auditoria para persistir em um log de auditoria para arquivos locais alternando o log ap\u00F3s um determinado per\u00EDodo derivado de uma sequ\u00EAncia de sufixo determinada, que deve estar em um formato entendido pelojava.time.format.DateTimeFormatter.
elytron.periodic-rotating-file-audit-log.add=Adicionar o recurso do logger de auditoria.
elytron.periodic-rotating-file-audit-log.remove=Remover o recurso do logger de auditoria.
elytron.periodic-rotating-file-audit-log.path=Caminho do arquivo a ser gravado.
elytron.periodic-rotating-file-audit-log.relative-to=O caminho relativo para o log de auditoria.
elytron.periodic-rotating-file-audit-log.synchronized=Se cada evento deve ser imediatamente sincronizado com o disco.
elytron.periodic-rotating-file-audit-log.format=O formato a ser usado para registrar os eventos de auditoria.
elytron.periodic-rotating-file-audit-log.suffix=Determina a sequ\u00EAncia do sufixo em um formato que pode ser entendido pelo  java.time.format.DateTimeFormatter. O per\u00EDodo de rota\u00E7\u00E3o \u00E9 automaticamente calculado baseado no sufixo.
elytron.size-rotating-file-audit-log=Uma defini\u00E7\u00E3o de log de auditoria para persistir em um log de auditoria para arquivos locais alternando o log ap\u00F3s o tamanho do arquivo aumentar al\u00E9m de um certo ponto e manter um n\u00FAmero fixo de backups.
elytron.size-rotating-file-audit-log.add=Adicionar o recurso do logger de auditoria.
elytron.size-rotating-file-audit-log.remove=Remover o recurso do logger de auditoria.
elytron.size-rotating-file-audit-log.path=Caminho do arquivo a ser gravado.
elytron.size-rotating-file-audit-log.relative-to=O caminho relativo para o log de auditoria.
elytron.size-rotating-file-audit-log.synchronized=Se cada evento deve ser imediatamente sincronizado com o disco.
elytron.size-rotating-file-audit-log.format=O formato a ser usado para registrar os eventos de auditoria.
elytron.size-rotating-file-audit-log.max-backup-index=O n\u00FAmero m\u00E1ximo de arquivos a ter backups ao alternar.
elytron.size-rotating-file-audit-log.rotate-size=O tamanho do arquivo de log em que o arquivo deve alternar.
elytron.size-rotating-file-audit-log.rotate-on-boot=Se o arquivo deve ser alternado antes de um novo arquivo ser definido.
elytron.size-rotating-file-audit-log.suffix=Formato da data usada sufixo ou nomes do arquivo de log em  in java.time.format.DateTimeFormatter. O sufixo n\u00E3o tem um papel na determina\u00E7\u00E3o de quanto o arquivo deve ser alternado.
elytron.syslog-audit-log=Um logger de auditoria que envia eventos de auditoria a um servidor syslog remoto.
elytron.syslog-audit-log.add=Adicionar o recurso do logger de auditoria.
elytron.syslog-audit-log.remove=Remover o recurso do logger de auditoria.
elytron.syslog-audit-log.server-address=O endere\u00E7o de servidor do servidor syslog aos quais os eventos devem ser enviados.
elytron.syslog-audit-log.port=A porta ouvinte no servidor syslog.
elytron.syslog-audit-log.transport=O transporte a ser usado para conectar ao servidor syslog.
elytron.syslog-audit-log.format=O formato a ser usado para registrar o evento de auditoria.
elytron.syslog-audit-log.host-name=O nome do host a ser incorporado em todos os eventos enviados para o servidor syslog remoto.
elytron.syslog-audit-log.ssl-context=O SSLContext a ser usado para conectar ao servidor syslog quando o transporte SSL_TCP for usado.
elytron.http-authentication-factory=Recurso contendo a associa\u00E7\u00E3o de um SecurityDomain com um HttpServerAuthenticationMechanismFactory.
elytron.http-authentication-factory.add=Adicionar um novo recurso http-authentication-factory.
elytron.http-authentication-factory.remove=Remover o recurso http-authentication-factory.
elytron.http-authentication-factory.security-domain=O SecurityDomain a ser associado com este recurso
elytron.http-authentication-factory.http-server-mechanism-factory=O HttpServerAuthenticationMechanismFactory a ser associado com este recurso
elytron.http-authentication-factory.mechanism-configurations=Configura\u00E7\u00E3o espec\u00EDfica do mecanismo
elytron.http-authentication-factory.mechanism-configurations.mechanism-name=Esta configura\u00E7\u00E3o ser\u00E1 aplicada somente quando um mecanismo com o nome especificado for usado. Se o atributo for omitido, isso corresponder\u00E1 a qualquer nome de mecanismo.
elytron.http-authentication-factory.mechanism-configurations.host-name=O nome do host ao qual esta configura\u00E7\u00E3o se aplica.
elytron.http-authentication-factory.mechanism-configurations.protocol=O protocolo ao qual esta configura\u00E7\u00E3o se aplica.
elytron.http-authentication-factory.mechanism-configurations.pre-realm-principal-transformer=Um transformador principal a ser aplicado antes de selecionar o realm
elytron.http-authentication-factory.mechanism-configurations.post-realm-principal-transformer=Um transformador principal a ser aplicado depois de selecionar o realm
elytron.http-authentication-factory.mechanism-configurations.final-principal-transformer=Um transformador principal final a ser aplicado para este realm do mecanismo
elytron.http-authentication-factory.mechanism-configurations.realm-mapper=O mapeador do realm a ser usado pelo mecanismo
elytron.http-authentication-factory.mechanism-configurations.credential-security-factory=A f\u00E1brica de seguran\u00E7a a ser usada para obter uma credencial conforme solicitado pelo mecanismo
elytron.http-authentication-factory.mechanism-configurations.mechanism-realm-configurations=Defini\u00E7\u00E3o dos nomes de realm conforme entendido pelo mecanismo
elytron.http-authentication-factory.mechanism-configurations.realm-name=O nome do realm a ser apresentado pelo mecanismo
elytron.http-authentication-factory.available-mechanisms=Os mecanismos HTTP dispon\u00EDveis nesta configura\u00E7\u00E3o ap\u00F3s todos os filtros terem sido aplicados.
elytron.sasl-authentication-factory=Recurso contendo a associa\u00E7\u00E3o de um SecurityDomain com um SaslServerFactory.
elytron.sasl-authentication-factory.add=Adicionar um novo recurso sasl-authentication-factory.
elytron.sasl-authentication-factory.remove=Remove o recurso sasl-authentication-factory.
elytron.sasl-authentication-factory.security-domain=O SecurityDomain a ser associado com este recurso
elytron.sasl-authentication-factory.sasl-server-factory=O SaslServerFactory a ser associado com este recurso
elytron.sasl-authentication-factory.mechanism-configurations=Configura\u00E7\u00E3o espec\u00EDfica do mecanismo
elytron.sasl-authentication-factory.mechanism-configurations.mechanism-name=Esta configura\u00E7\u00E3o ser\u00E1 aplicada somente quando um mecanismo com o nome especificado for usado. Se o atributo for omitido, isso corresponder\u00E1 a qualquer nome de mecanismo.
elytron.sasl-authentication-factory.mechanism-configurations.host-name=O nome do host ao qual esta configura\u00E7\u00E3o se aplica.
elytron.sasl-authentication-factory.mechanism-configurations.protocol=O protocolo ao qual esta configura\u00E7\u00E3o se aplica.
elytron.sasl-authentication-factory.mechanism-configurations.pre-realm-principal-transformer=Um transformador principal a ser aplicado antes de selecionar o realm
elytron.sasl-authentication-factory.mechanism-configurations.post-realm-principal-transformer=Um transformador principal a ser aplicado depois de selecionar o realm
elytron.sasl-authentication-factory.mechanism-configurations.final-principal-transformer=Um transformador principal final a ser aplicado para este realm do mecanismo
elytron.sasl-authentication-factory.mechanism-configurations.realm-mapper=O mapeador do realm a ser usado pelo mecanismo
elytron.sasl-authentication-factory.mechanism-configurations.credential-security-factory=A f\u00E1brica de seguran\u00E7a a ser usada para obter uma credencial conforme solicitado pelo mecanismo
elytron.sasl-authentication-factory.mechanism-configurations.mechanism-realm-configurations=Defini\u00E7\u00E3o dos nomes de realm conforme entendido pelo mecanismo
elytron.sasl-authentication-factory.mechanism-configurations.realm-name=O nome do realm a ser apresentado pelo mecanismo
elytron.sasl-authentication-factory.available-mechanisms=Os mecanismos SASL dispon\u00EDveis nesta configura\u00E7\u00E3o ap\u00F3s todos os filtros terem sido aplicados.
elytron.security-domain=Uma defini\u00E7\u00E3o do dom\u00EDnio de seguran\u00E7a.
elytron.security-domain.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para uma defini\u00E7\u00E3o de dom\u00EDnio de seguran\u00E7a.
elytron.security-domain.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para uma defini\u00E7\u00E3o de dom\u00EDnio de seguran\u00E7a.
elytron.security-domain.read-identity=L\u00EA uma identidade em um dom\u00EDnio de seguran\u00E7a, se existir.
elytron.security-domain.read-identity.name=O nome da identidade a ser lida.
elytron.security-domain.authenticate=Uma opera\u00E7\u00E3o tempor\u00E1ria a ser usada para testar a autentica\u00E7\u00E3o.
elytron.security-domain.authenticate.username=O nome de usu\u00E1rio para fazer a autentica\u00E7\u00E3o.
elytron.security-domain.authenticate.password=A senha para o nome de usu\u00E1rio fornecido.
elytron.security-domain.pre-realm-principal-transformer=Uma refer\u00EAncia ao transformador principal a ser aplicado antes de selecionar o realm.
elytron.security-domain.post-realm-principal-transformer=Uma refer\u00EAncia ao transformador principal a ser aplicado depois de o realm ter operado no nome de identidade fornecido.
elytron.security-domain.permission-mapper=Uma refer\u00EAncia a um PermissionMapper a ser usado por este dom\u00EDnio.
elytron.security-domain.principal-decoder=Uma refer\u00EAncia a um PrincipalDecoder a ser usado por este dom\u00EDnio.
elytron.security-domain.realm-mapper=Refer\u00EAncia ao RealmMapper a ser usado por este dom\u00EDnio.
elytron.security-domain.role-mapper=Refer\u00EAncia ao RoleMapper a ser usado por este dom\u00EDnio.
elytron.security-domain.security-event-listener=Refer\u00EAncia a um ouvinte para eventos de seguran\u00E7a.
elytron.security-domain.default-realm=O realm padr\u00E3o contido neste dom\u00EDnio de seguran\u00E7a.
elytron.security-domain.realms=A lista de realms contidos neste dom\u00EDnio de seguran\u00E7a.
elytron.security-domain.realms.realm=Uma refer\u00EAncia a um realm de seguran\u00E7a individual.
elytron.security-domain.realms.principal-transformer=Um transformador principal a ser associado com o realm.
elytron.security-domain.realms.role-decoder=Uma refer\u00EAncia RoleDecoder a ser associada com o realm.
elytron.security-domain.realms.role-mapper=Uma refer\u00EAncia RoleMapper a ser associada com o realm.
elytron.security-domain.trusted-security-domains=A lista de dom\u00EDnios de seguran\u00E7a confi\u00E1veis para este dom\u00EDnio de seguran\u00E7a.
elytron.security-domain.outflow-security-domains=A lista de dom\u00EDnios de seguran\u00E7a para os quais a identidade de seguran\u00E7a deste dom\u00EDnio deveria automaticamente ir.
elytron.security-domain.outflow-anonymous=Durante a sa\u00EDda para um dom\u00EDnio de seguran\u00E7a, se esta n\u00E3o for poss\u00EDvel, a identidade an\u00F4nima deve ser usada? A sa\u00EDda an\u00F4nima tem o efeito de limpar qualquer identidade j\u00E1 estabelecida para esse dom\u00EDnio.
elytron.aggregate-http-server-mechanism-factory=Uma defini\u00E7\u00E3o de f\u00E1brica de servidores HTTP na qual a f\u00E1brica de servidores HTTP \u00E9 uma agrega\u00E7\u00E3o de outras f\u00E1bricas de servidores HTTP.
elytron.aggregate-http-server-mechanism-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores HTTP.
elytron.aggregate-http-server-mechanism-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores HTTP.
elytron.aggregate-http-server-mechanism-factory.http-server-mechanism-factories=As f\u00E1bricas de servidores HTTP referenciadas a serem agregadas.
elytron.aggregate-http-server-mechanism-factory.available-mechanisms=Os mecanismos HTTP dispon\u00EDveis nesta inst\u00E2ncia da f\u00E1brica.
elytron.configurable-http-server-mechanism-factory=Uma defini\u00E7\u00E3o de f\u00E1brica de servidores HTTP que encapsula outra f\u00E1brica de servidores HTTP e aplica a configura\u00E7\u00E3o e os filtros especificados.
elytron.configurable-http-server-mechanism-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores HTTP.
elytron.configurable-http-server-mechanism-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores HTTP.
elytron.configurable-http-server-mechanism-factory.http-server-mechanism-factory=A f\u00E1brica de servidores a ser encapsulada.
elytron.configurable-http-server-mechanism-factory.properties=Propriedades personalizadas a serem passadas nas chamadas da f\u00E1brica dos servidores HTTP.
elytron.configurable-http-server-mechanism-factory.filters=Filtro a ser aplicado para ativar/desativar os mecanismos com base no nome.
elytron.configurable-http-server-mechanism-factory.filters.pattern-filter=Um filtro com base em um padr\u00E3o de express\u00E3o regular.
elytron.configurable-http-server-mechanism-factory.filters.enabling=Este filtro ativa ou desativa um mecanismo se ele corresponder.
elytron.configurable-http-server-mechanism-factory.available-mechanisms=Os mecanismos HTTP dispon\u00EDveis nesta inst\u00E2ncia da f\u00E1brica.
elytron.provider-http-server-mechanism-factory=Uma defini\u00E7\u00E3o de f\u00E1brica de servidores HTTP na qual a f\u00E1brica de servidores HTTP \u00E9 uma agrega\u00E7\u00E3o de f\u00E1bricas do Provedor []
elytron.provider-http-server-mechanism-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores HTTP.
elytron.provider-http-server-mechanism-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores HTTP.
elytron.provider-http-server-mechanism-factory.providers=Os provedores usados para localizar as f\u00E1bricas. Se n\u00E3o forem especificados, a lista registrada global de Provedores ser\u00E1 usada.
elytron.provider-http-server-mechanism-factory.available-mechanisms=Os mecanismos HTTP dispon\u00EDveis nesta inst\u00E2ncia da f\u00E1brica.
elytron.service-loader-http-server-mechanism-factory=Uma defini\u00E7\u00E3o de f\u00E1brica de servidores HTTP na qual a f\u00E1brica de servidores HTTP \u00E9 uma agrega\u00E7\u00E3o de f\u00E1bricas identificadas usando um ServiceLoader
elytron.service-loader-http-server-mechanism-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores HTTP.
elytron.service-loader-http-server-mechanism-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores HTTP.
elytron.service-loader-http-server-mechanism-factory.module=O m\u00F3dulo usado para obter o classloader para carregar as f\u00E1bricas. Se n\u00E3o for especificado, ser\u00E1 usado o classloader para carregar o recurso.
elytron.service-loader-http-server-mechanism-factory.available-mechanisms=Os mecanismos HTTP dispon\u00EDveis nesta inst\u00E2ncia da f\u00E1brica.
elytron.custom-credential-security-factory=Uma defini\u00E7\u00E3o SecurityFactory de credencial personalizada.
elytron.custom-credential-security-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de seguran\u00E7a.
elytron.custom-credential-security-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de seguran\u00E7a.
elytron.custom-credential-security-factory.module=O m\u00F3dulo usado para carregar a f\u00E1brica de seguran\u00E7a personalizada.
elytron.custom-credential-security-factory.class-name=O nome da classe da implementa\u00E7\u00E3o da f\u00E1brica de seguran\u00E7a personalizada.
elytron.custom-credential-security-factory.configuration=A configura\u00E7\u00E3o de chave/valor opcional para a f\u00E1brica de seguran\u00E7a personalizada.
elytron.kerberos-security-factory=Uma f\u00E1brica de seguran\u00E7a para obter uma GSSCredential a ser usada durante a autentica\u00E7\u00E3o.
elytron.kerberos-security-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a SecurityFactory do Kerberos
elytron.kerberos-security-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a SecurityFactory do Kerberos
elytron.kerberos-security-factory.principal=O principal representado por KeyTab
elytron.kerberos-security-factory.path=O caminho do KeyTab a ser carregado para obter a credencial.
elytron.kerberos-security-factory.relative-to=O nome de outro caminho nomeado anteriormente ou de um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso 'relative-to' seja fornecido, o valor do atributo 'path' \u00E9 tratado como relativo ao caminho especificado por este atributo.
elytron.kerberos-security-factory.minimum-remaining-lifetime=Quando tempo de vida restante (em segundos) uma credencial em cache tem antes de ser recriada?
elytron.kerberos-security-factory.request-lifetime=Quando tempo de vida restante (em segundos) deve ser solicitado para uma credencial rec\u00E9m criada?
elytron.kerberos-security-factory.server=Isso \u00E9 para uso no lado do servidor ou do cliente?
elytron.kerberos-security-factory.obtain-kerberos-ticket=O KerberosTicket tamb\u00E9m deve ser obtido e associado \u00E0 credencial? Isso \u00E9 necess\u00E1rio nos casos em que as credenciais s\u00E3o delegadas ao servidor.
elytron.kerberos-security-factory.debug=A etapa JAAS de obten\u00E7\u00E3o da credencial deve ter o registro em log de depura\u00E7\u00E3o ativado?
elytron.kerberos-security-factory.wrap-gss-credential=As credenciais GSS geradas devem ou n\u00E3o ser encapsuladas para evitar o descarte inadequado?
elytron.kerberos-security-factory.required=O arquivo keytab com o principal adequado precisa existir no momento em que o servi\u00E7o \u00E9 iniciado?
elytron.kerberos-security-factory.mechanism-names=Os nomes do mecanismo com os quais as credenciais devem ser utiliz\u00E1veis. Os nomes ser\u00E3o convertidos para OIDs e usados juntamente com os OIDs do atributo mechanism-oids.
elytron.kerberos-security-factory.mechanism-oids=Os OIDs do mecanismo com os quais as credenciais devem ser utiliz\u00E1veis ser\u00E3o usados com OIDs derivados de nomes do atributo mechanism-names.
elytron.kerberos-security-factory.options=Op\u00E7\u00F5es adicionais do Krb5LoginModule.
elytron.custom-permission-mapper=Defini\u00E7\u00E3o de um mapeador de permiss\u00E3o personalizado.
elytron.custom-permission-mapper.add=Adicionar opera\u00E7\u00E3o para o mapeador de permiss\u00E3o
elytron.custom-permission-mapper.remove=Remover opera\u00E7\u00E3o para o mapeador de permiss\u00E3o
elytron.custom-permission-mapper.module=Nome do m\u00F3dulo usado para carregar o  mapeador de permiss\u00E3o
elytron.custom-permission-mapper.class-name=Nome da classe inteiramente qualificada do mapeador de permiss\u00E3o
elytron.custom-permission-mapper.configuration=A configura\u00E7\u00E3o de chave/valor opcional para o mapeador de permiss\u00E3o
elytron.logical-permission-mapper=Defini\u00E7\u00E3o de um mapeador de permiss\u00E3o l\u00F3gico.
elytron.logical-permission-mapper.add=Adicionar opera\u00E7\u00E3o para o mapeador de permiss\u00E3o
elytron.logical-permission-mapper.remove=Remover opera\u00E7\u00E3o para o mapeador de permiss\u00E3o
elytron.logical-permission-mapper.logical-operation=A opera\u00E7\u00E3o l\u00F3gica usada para combinar os mapeadores de permiss\u00E3o.
elytron.logical-permission-mapper.left=Refer\u00EAncia ao mapeador de permiss\u00E3o usado no lado esquerdo da opera\u00E7\u00E3o.
elytron.logical-permission-mapper.right=Refer\u00EAncia ao mapeador de permiss\u00E3o usado no lado direito da opera\u00E7\u00E3o.
elytron.simple-permission-mapper=Defini\u00E7\u00E3o de um mapeador de permiss\u00E3o configurado simples.
elytron.simple-permission-mapper.add=Adicionar opera\u00E7\u00E3o para o mapeador de permiss\u00E3o
elytron.simple-permission-mapper.remove=Remover opera\u00E7\u00E3o para o mapeador de permiss\u00E3o
elytron.simple-permission-mapper.mapping-mode=O modo de mapeamento que deve ser usado no evento de m\u00FAltiplas correspond\u00EAncias.
elytron.simple-permission-mapper.permission-mappings=Os mapeamentos de permiss\u00E3o definidos.
elytron.simple-permission-mapper.permission-mappings.principals=Principais a serem comparados ao mapear permiss\u00F5es. Se o principal das identidades correspondente a qualquer uma na lista, h\u00E1 uma correspond\u00EAncia.
elytron.simple-permission-mapper.permission-mappings.roles=Fun\u00E7\u00F5es comparadas ao mapear permiss\u00F5es. Se a identidade \u00E9 um membro de qualquer uma na lista, h\u00E1 uma correspond\u00EAncia.
elytron.simple-permission-mapper.permission-mappings.permissions=As permiss\u00F5es atribu\u00EDdas no evento de uma correspond\u00EAncia.
elytron.simple-permission-mapper.permission-mappings.class-name=Nome da classe inteiramente qualificada da permiss\u00E3o.
elytron.simple-permission-mapper.permission-mappings.module=O m\u00F3dulo usado para carregar a permiss\u00E3o.
elytron.simple-permission-mapper.permission-mappings.target-name=O nome de destino a ser passado para a permiss\u00E3o conforme ela \u00E9 constru\u00EDda.
elytron.simple-permission-mapper.permission-mappings.action=A a\u00E7\u00E3o a ser passada para a permiss\u00E3o conforme ela \u00E9 constru\u00EDda.
elytron.constant-permission-mapper=Defini\u00E7\u00E3o de um mapeador de permiss\u00E3o que sempre retorna a mesma constante.
elytron.constant-permission-mapper.add=Adicionar opera\u00E7\u00E3o para o mapeador de permiss\u00E3o
elytron.constant-permission-mapper.remove=Remover opera\u00E7\u00E3o para o mapeador de permiss\u00E3o
elytron.constant-permission-mapper.permissions=Permiss\u00F5es a serem atribu\u00EDdas.
elytron.constant-permission-mapper.permissions.class-name=Nome da classe inteiramente qualificada da permiss\u00E3o.
elytron.constant-permission-mapper.permissions.module=O m\u00F3dulo usado para carregar a permiss\u00E3o.
elytron.constant-permission-mapper.permissions.target-name=O nome de destino a ser passado para a permiss\u00E3o conforme ela \u00E9 constru\u00EDda.
elytron.constant-permission-mapper.permissions.action=A a\u00E7\u00E3o a ser passada para a permiss\u00E3o conforme ela \u00E9 constru\u00EDda.
elytron.aggregate-principal-decoder=Uma defini\u00E7\u00E3o de decodificador principal na qual o decodificador principal \u00E9 uma agrega\u00E7\u00E3o de outros decodificador principais.
elytron.aggregate-principal-decoder.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o decodificador principal.
elytron.aggregate-principal-decoder.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o decodificador principal.
elytron.aggregate-principal-decoder.principal-decoders=Os decodificadores principais referenciados a serem agregados.
elytron.concatenating-principal-decoder=Uma defini\u00E7\u00E3o de decodificador principal na qual o decodificador principal \u00E9 uma concatena\u00E7\u00E3o de outros decodificador principais.
elytron.concatenating-principal-decoder.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o decodificador principal.
elytron.concatenating-principal-decoder.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o decodificador principal.
elytron.concatenating-principal-decoder.joiner=Uma cadeia de caracteres usada para unir os resultados dos decodificadores principais referenciados.
elytron.concatenating-principal-decoder.principal-decoders=Os decodificadores principais referenciados a serem concatenados.
elytron.constant-principal-decoder=Defini\u00E7\u00E3o de um decodificador principal que sempre retorna a mesma constante.
elytron.constant-principal-decoder.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o decodificador principal.
elytron.constant-principal-decoder.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o decodificador principal.
elytron.constant-principal-decoder.constant=O valor constante que o decodificador principal sempre retornar\u00E1.
elytron.custom-principal-decoder=Defini\u00E7\u00E3o de um decodificador principal personalizado
elytron.custom-principal-decoder.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o decodificador principal
elytron.custom-principal-decoder.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o decodificador principal
elytron.custom-principal-decoder.module=Nome do m\u00F3dulo usado para carregar o decodificador principal
elytron.custom-principal-decoder.class-name=Nome da classe inteiramente qualificada do decodificador principal.
elytron.custom-principal-decoder.configuration=A configura\u00E7\u00E3o de chave/valor opcional para o decodificador principal
elytron.x500-attribute-principal-decoder=Defini\u00E7\u00E3o de um atributo X.500 com base no decodificador principal
elytron.x500-attribute-principal-decoder.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o decodificador principal
elytron.x500-attribute-principal-decoder.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o decodificador principal
elytron.x500-attribute-principal-decoder.oid=O atributo X.500 a ser mapeado (deve ser definido usando o atributo de nome)
elytron.x500-attribute-principal-decoder.attribute-name=O nome do atributo X.500 a ser mapeado (pode ser definido usando o OID)
elytron.x500-attribute-principal-decoder.joiner=A cadeira de caracteres de uni\u00E3o
elytron.x500-attribute-principal-decoder.start-segment=A ocorr\u00EAncia inicial baseada em 0 do atributo a ser mapeado
elytron.x500-attribute-principal-decoder.maximum-segments=O n\u00FAmero m\u00E1ximo de ocorr\u00EAncias do atributo a ser mapeado
elytron.x500-attribute-principal-decoder.reverse=Quandos definidos como "verdadeiros", os valores dos atributos ser\u00E3o processados e retornados na ordem inversa
elytron.x500-attribute-principal-decoder.convert=Quando definido como "verdadeiro", se o Principal n\u00E3o for um X500Principal, ser\u00E1 feita uma tentativa de convers\u00E3o
elytron.x500-attribute-principal-decoder.required-oids=Os OIDs dos atributos que devem estar presentes no principal
elytron.x500-attribute-principal-decoder.required-attributes=Os nomes de atributos dos atributos que devem estar presentes no principal
elytron.aggregate-principal-transformer=Um transformador principal que agrega mais transformadores principais. O principal original tenta ser transformado por transformadores individuais at\u00E9 que um retorne principal n\u00E3o nulo \u2013 que \u00E9 retornado.
elytron.aggregate-principal-transformer.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o transformador principal.
elytron.aggregate-principal-transformer.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o transformador principal.
elytron.aggregate-principal-transformer.principal-transformers=Os transformadores principais referenciados a serem agregados.
elytron.chained-principal-transformer=Uma defini\u00E7\u00E3o de transformador principal na qual o transformador principal \u00E9 um encadeamento de outros transformadores principais.
elytron.chained-principal-transformer.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o transformador principal.
elytron.chained-principal-transformer.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o transformador principal.
elytron.chained-principal-transformer.principal-transformers=Os transformadores principais referenciados a serem encadeados.
elytron.constant-principal-transformer=Um defini\u00E7\u00E3o de um transformador principal para um PrincipalTransformer que sempre retorna a mesma constante.
elytron.constant-principal-transformer.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o transformador principal.
elytron.constant-principal-transformer.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o transformador principal.
elytron.constant-principal-transformer.constant=O valor constante que este PrincipalTransformer retornar\u00E1 sempre.
elytron.custom-principal-transformer=Uma defini\u00E7\u00E3o de transformador principal personalizado.
elytron.custom-principal-transformer.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o transformador principal.
elytron.custom-principal-transformer.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o transformador principal.
elytron.custom-principal-transformer.module=O m\u00F3dulo usado para carregar o transformador principal personalizado.
elytron.custom-principal-transformer.class-name=O nome da classe da implementa\u00E7\u00E3o do transformador principal personalizado.
elytron.custom-principal-transformer.configuration=A configura\u00E7\u00E3o de chave/valor opcional para o transformador principal personalizado.
elytron.regex-principal-transformer=Um transformador principal com base em uma express\u00E3o regular
elytron.regex-principal-transformer.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o transformador principal.
elytron.regex-principal-transformer.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o transformador principal.
elytron.regex-principal-transformer.pattern=A express\u00E3o regular usada para localizar a por\u00E7\u00E3o do nome a ser substitu\u00EDdo.
elytron.regex-principal-transformer.replacement=O valor a ser usado como substituto.
elytron.regex-principal-transformer.replace-all=Todas as ocorr\u00EAncias do padr\u00E3o correspondido devem ser substitu\u00EDdas ou somente a primeira ocorr\u00EAncia?
elytron.regex-validating-principal-transformer=Um transformador principal com base em uma express\u00E3o regular que usa a express\u00E3o regular para validar o nome.
elytron.regex-validating-principal-transformer.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o transformador principal.
elytron.regex-validating-principal-transformer.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o transformador principal.
elytron.regex-validating-principal-transformer.pattern=A express\u00E3o regular usada para o transformador principal.
elytron.regex-validating-principal-transformer.match=Se definido como verdadeiro, o nome dever\u00E1 corresponder ao padr\u00E3o fornecido para fazer a valida\u00E7\u00E3o ter \u00EAxito. Se estiver definido como falso, o nome n\u00E3o precisa corresponder ao padr\u00E3o fornecido para fazer a valida\u00E7\u00E3o ter \u00EAxito.
elytron.constant-realm-mapper=Defini\u00E7\u00E3o de um RealmMapper constante que sempre retorna o mesmo valor.
elytron.constant-realm-mapper.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o RealmMapper
elytron.constant-realm-mapper.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o RealmMapper
elytron.constant-realm-mapper.realm-name=O nome do realm constante a ser retornado.
elytron.custom-realm-mapper=Defini\u00E7\u00E3o de um RealmMapper personalizado
elytron.custom-realm-mapper.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o RealmMapper
elytron.custom-realm-mapper.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o RealmMapper
elytron.custom-realm-mapper.module=Nome do m\u00F3dulo usado para carregar o RealmMapper
elytron.custom-realm-mapper.class-name=Nome da classe inteiramente qualificada para o RealmMapper
elytron.custom-realm-mapper.configuration=A configura\u00E7\u00E3o de chave/valor opcional para o RealmMapper
elytron.simple-regex-realm-mapper=Defini\u00E7\u00E3o de um RealmMapper simples que tenta extrair o nome de realm usando o grupo de captura da express\u00E3o regular. Se isso n\u00E3o fornecer uma correspond\u00EAncia, ent\u00E3o o RealmMapper delegado ser\u00E1 usado.
elytron.simple-regex-realm-mapper.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o RealmMapper
elytron.simple-regex-realm-mapper.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o RealmMapper
elytron.simple-regex-realm-mapper.pattern=A express\u00E3o regular que deve conter pelo menos um grupo de captura para extrair o realm do nome. Se a express\u00E3o regular corresponder a mais de um grupo de captura, o primeiro grupo de captura ser\u00E1 usado.
elytron.simple-regex-realm-mapper.delegate-realm-mapper=O RealmMapper a ser delegado se n\u00E3o houver correspond\u00EAncia usando o padr\u00E3o.
elytron.mapped-regex-realm-mapper=Defini\u00E7\u00E3o de uma implementa\u00E7\u00E3o RealmMapper que usa primeiro uma express\u00E3o regular para extrair o nome do realm, e ent\u00E3o \u00E9 convertida usando o mapeamento configurado dos nomes de realm. 
elytron.mapped-regex-realm-mapper.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o RealmMapper
elytron.mapped-regex-realm-mapper.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o RealmMapper
elytron.mapped-regex-realm-mapper.pattern=A express\u00E3o regular que deve conter pelo menos um grupo de captura para extrair o realm do nome. Se a express\u00E3o regular corresponder a mais de um grupo de captura, o primeiro grupo de captura ser\u00E1 usado.
elytron.mapped-regex-realm-mapper.delegate-realm-mapper=O RealmMapper para delegar se o padr\u00E3o n\u00E3o corresponder. Se nenhum delegado for especificado, o realm padr\u00E3o no dom\u00EDnio ser\u00E1 usado. Se o nome de usu\u00E1rio n\u00E3o corresponder ao padr\u00E3o e um realm-mapper delegado estiver presente, o resultado de delegate-realm-mapper ser\u00E1 mapeado por meio do realm-map.
elytron.mapped-regex-realm-mapper.realm-map=Mapeamento do nome de realm extra\u00EDdo usando uma express\u00E3o regular para um nome de realm definido. Se o valor para o mapeamento n\u00E3o estiver no mapa ou o realm cujo nome \u00E9 o resultado do mapeamento n\u00E3o existir no dom\u00EDnio de seguran\u00E7a fornecido, o realm padr\u00E3o ser\u00E1 usado.
elytron.custom-role-decoder=Defini\u00E7\u00E3o de um RoleDecoder personalizado
elytron.custom-role-decoder.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o RoleDecoder
elytron.custom-role-decoder.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o RoleDecoder
elytron.custom-role-decoder.module=Nome do m\u00F3dulo usado para carregar o RoleDecoder
elytron.custom-role-decoder.class-name=Nome da classe inteiramente qualificada para o RoleDecoder
elytron.custom-role-decoder.configuration=A configura\u00E7\u00E3o de chave/valor opcional para o RoleDecoder
elytron.empty-role-decoder=Defini\u00E7\u00E3o de um RoleDecoder vazio que nunca retorna nenhuma fun\u00E7\u00E3o.
elytron.empty-role-decoder.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o RoleDecoder
elytron.empty-role-decoder.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o RoleDecoder
elytron.simple-role-decoder=Defini\u00E7\u00E3o de um RoleDecoder simples que usa um atributo simples e o mapeia diretamente para as fun\u00E7\u00F5es.
elytron.simple-role-decoder.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o RoleDecoder
elytron.simple-role-decoder.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o RoleDecoder
elytron.simple-role-decoder.attribute=O nome do atributo da identidade a ser mapeada diretamente nas fun\u00E7\u00F5es.
elytron.add-prefix-role-mapper=Uma defini\u00E7\u00E3o de mapeador de fun\u00E7\u00E3o para um mapeador de fun\u00E7\u00E3o que adiciona um prefixo a cada mapeador fornecido.
elytron.add-prefix-role-mapper.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.add-prefix-role-mapper.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.add-prefix-role-mapper.prefix=O prefixo a ser adicionado a cada fun\u00E7\u00E3o.
elytron.add-suffix-role-mapper=Uma defini\u00E7\u00E3o de mapeador de fun\u00E7\u00E3o para um mapeador de fun\u00E7\u00E3o que adiciona um sufixo a cada mapeador fornecido.
elytron.add-suffix-role-mapper.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.add-suffix-role-mapper.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.add-suffix-role-mapper.suffix=O sufixo a ser adicionado a cada fun\u00E7\u00E3o.
elytron.aggregate-role-mapper=Uma defini\u00E7\u00E3o de mapeador de fun\u00E7\u00E3o na qual o mapeador de fun\u00E7\u00E3o \u00E9 uma agrega\u00E7\u00E3o de outros mapeadores de fun\u00E7\u00E3o.
elytron.aggregate-role-mapper.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.aggregate-role-mapper.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.aggregate-role-mapper.role-mappers=Os mapeadores de fun\u00E7\u00E3o referenciados a serem agregados.
elytron.constant-role-mapper=Uma defini\u00E7\u00E3o de mapeador de fun\u00E7\u00E3o na qual um conjunto constante de fun\u00E7\u00F5es sempre \u00E9 retornado.
elytron.constant-role-mapper.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.constant-role-mapper.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.constant-role-mapper.roles=As fun\u00E7\u00F5es constantes a serem retornadas por este mapeador de fun\u00E7\u00E3o.
elytron.custom-role-mapper=Defini\u00E7\u00E3o de um RoleMapper personalizado
elytron.custom-role-mapper.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para o RoleMapper
elytron.custom-role-mapper.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para o RoleMapper
elytron.custom-role-mapper.module=Nome do m\u00F3dulo usado para carregar o RoleMapper
elytron.custom-role-mapper.class-name=Nome da classe inteiramente qualificada para o RoleMapper
elytron.custom-role-mapper.configuration=A configura\u00E7\u00E3o de chave/valor opcional para o RoleMapper
elytron.logical-role-mapper=Uma defini\u00E7\u00E3o de RoleMapper para um RoleMapper que realiza uma opera\u00E7\u00E3o l\u00F3gica usando dois RoleMappers referenciados.
elytron.logical-role-mapper.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.logical-role-mapper.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o mapeador de fun\u00E7\u00E3o.
elytron.logical-role-mapper.logical-operation=A opera\u00E7\u00E3o l\u00F3gica a ser realizada no mapeamento de mapeadores de fun\u00E7\u00E3o.
elytron.logical-role-mapper.left=Refer\u00EAncia ao mapeador de fun\u00E7\u00E3o a ser usado no lado esquerdo da opera\u00E7\u00E3o.
elytron.logical-role-mapper.right=Refer\u00EAncia ao mapeador de fun\u00E7\u00E3o a ser usado no lado direito da opera\u00E7\u00E3o.
elytron.aggregate-realm=Uma defini\u00E7\u00E3o de realm que \u00E9 uma agrega\u00E7\u00E3o de dois realms\: um para etapas de autentica\u00E7\u00E3o e outro para carregar a identidade para as etapas de autoriza\u00E7\u00E3o.
elytron.aggregate-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.aggregate-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.aggregate-realm.authentication-realm=Refer\u00EAncia ao realm de seguran\u00E7a a ser usado para etapas de autentica\u00E7\u00E3o (obten\u00E7\u00E3o ou valida\u00E7\u00E3o de credenciais).
elytron.aggregate-realm.authorization-realm=Refer\u00EAncia ao realm de seguran\u00E7a a ser usado para carregar a identidade das etapas de autentica\u00E7\u00E3o (obten\u00E7\u00E3o da identidade).
elytron.custom-modifiable-realm=O realm personalizado configurado como sendo modific\u00E1vel que se espera implementar na interface ModifiableSecurityRealm. Ao configurar um realm como sendo modific\u00E1vel, opera\u00E7\u00F5es de gerenciamento se tornar\u00E3o dispon\u00EDveis para manipul\u00E1-lo.
elytron.custom-modifiable-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.custom-modifiable-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.custom-modifiable-realm.class-name=O nome da classe da implementa\u00E7\u00E3o do realm personalizado.
elytron.custom-modifiable-realm.configuration=A configura\u00E7\u00E3o de chave/valor opcional do realm personalizado.
elytron.custom-modifiable-realm.identity=Uma identidade que pode ser gerenciada por um realm de seguran\u00E7a.
elytron.custom-modifiable-realm.module=O m\u00F3dulo usado para carregar o realm personalizado.
elytron.custom-realm=Uma defini\u00E7\u00E3o personalizada de realm pode implementar a interface SecurityRealm ou a interface ModifiableSecurityRealm. Independentemente de qual interface for implementada, as opera\u00E7\u00F5es de gerenciamento n\u00E3o ser\u00E3o expostas para gerenciar o realm. No entanto, outros servi\u00E7os que dependem do realm ainda poder\u00E3o executar uma verifica\u00E7\u00E3o de tipo e converter para obter acesso \u00E0 API de modifica\u00E7\u00E3o.
elytron.custom-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.custom-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.custom-realm.module=O m\u00F3dulo usado para carregar o realm personalizado.
elytron.custom-realm.class-name=O nome da classe da implementa\u00E7\u00E3o do realm personalizado.
elytron.custom-realm.configuration=A configura\u00E7\u00E3o de chave/valor opcional do realm personalizado.
elytron.jdbc-realm=Uma defini\u00E7\u00E3o de realm de seguran\u00E7a protegido por banco de dados usando JDBC.
elytron.jdbc-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.jdbc-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.jdbc-realm.principal-query=A consulta de autentica\u00E7\u00E3o usada para autenticar servidores com base em tipos de chave espec\u00EDficos
elytron.jdbc-realm.principal-query.sql=A declara\u00E7\u00E3o SQL usada para obter as chaves (como colunas de tabela) para um usu\u00E1rio espec\u00EDfico e mape\u00E1-las conforme o tipo.
elytron.jdbc-realm.principal-query.data-source=O nome da fonte de dados utilizado para conectar ao banco de dados. 
elytron.jdbc-realm.principal-query.algorithm=O algoritmo para um mapeador de chave de senha espec\u00EDfico.
elytron.jdbc-realm.principal-query.password-index=O \u00EDndice da coluna de uma consulta de autentica\u00E7\u00E3o que representa a senha do usu\u00E1rio.
elytron.jdbc-realm.principal-query.salt-index=O \u00EDndice da coluna de uma consulta de autentica\u00E7\u00E3o que representa o valor de sal da senha do usu\u00E1rio, se for suportado.
elytron.jdbc-realm.principal-query.iteration-count-index=O \u00EDndice da coluna de uma consulta de autentica\u00E7\u00E3o que representa a contagem de intera\u00E7\u00E3o da senha do usu\u00E1rio, se for suportado.
elytron.jdbc-realm.principal-query.clear-password-mapper=Um mapeador de chaves que mapeia uma coluna retornada de uma consulta SQL para um tipo de chave Clear Password.
elytron.jdbc-realm.principal-query.bcrypt-mapper=Um mapeador de chaves que mapeia uma coluna retornada de uma consulta SQL para um tipo de chave Bcrypt.
elytron.jdbc-realm.principal-query.salted-simple-digest-mapper=Um mapeador de chaves que mapeia uma coluna retornada de uma consulta SQL para um tipo de chave Salted Simple Digest.
elytron.jdbc-realm.principal-query.simple-digest-mapper=Um mapeador de chaves que mapeia uma coluna retornada de uma consulta SQL para um tipo de chave Simple Digest.
elytron.jdbc-realm.principal-query.scram-mapper=Um mapeador de chaves que mapeia uma coluna retornada de uma consulta SQL para um tipo de chave Scram.
elytron.jdbc-realm.principal-query.attribute-mapping=Os mapeamentos de atributos definidos para este recurso.
elytron.jdbc-realm.principal-query.index=O \u00EDndice da coluna de uma consulta que representa o atributo mapeado.
elytron.jdbc-realm.principal-query.to=O nome do atributo de identidade mapeado de uma coluna retornada de uma consulta SQL.
elytron.identity-realm=Uma defini\u00E7\u00E3o de dom\u00EDnio de seguran\u00E7a na qual as identidades s\u00E3o representadas no modelo de gerenciamento.
elytron.identity-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.identity-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.identity-realm.identity=A identidade dispon\u00EDvel no realm de seguran\u00E7a.
elytron.identity-realm.attribute-name=O nome do atributo associado a esta identidade.
elytron.identity-realm.attribute-values=Os valores associados ao atributo das identidades.
elytron.key-store-realm=Uma defini\u00E7\u00E3o de realm de seguran\u00E7a protegido por um reposit\u00F3rio de chaves.
elytron.key-store-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.key-store-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.key-store-realm.key-store=Refer\u00EAncia ao KeyStore que deve ser usado para proteger este realm de seguran\u00E7a.
elytron.properties-realm=Uma defini\u00E7\u00E3o de realm de seguran\u00E7a protegido pelos arquivos de propriedades.
elytron.properties-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.properties-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.properties-realm.load=Recarregar os arquivos de propriedades do sistema de arquivos.
elytron.properties-realm.users-properties=O arquivo de propriedades que cont\u00E9m os usu\u00E1rios e suas senhas.
elytron.properties-realm.users-properties.path=O caminho para o arquivo que cont\u00E9m os usu\u00E1rios e suas senhas. O arquivo deve conter a declara\u00E7\u00E3o do nome do realm.
elytron.properties-realm.users-properties.relative-to=O caminho predefinido ao qual o caminho est\u00E1 relacionado.
elytron.properties-realm.users-properties.digest-realm-name=O nome de realm padr\u00E3o a ser usado para senhas resumidas se nenhuma for descoberto no arquivo de propriedades.
elytron.properties-realm.users-properties.plain-text=As senhas no arquivo de propriedades s\u00E3o armazenadas em texto simples ou com hash anterior? (formato de hash anterior\: HEX( MD5(nome de usu\u00E1rio "\:" realm "\:" senha ) ) )
elytron.properties-realm.groups-properties=O arquivo de propriedades que cont\u00E9m os usu\u00E1rios e seus grupos.
elytron.properties-realm.groups-properties.path=O caminho do arquivo que cont\u00E9m os usu\u00E1rios e seus grupos.
elytron.properties-realm.groups-properties.relative-to=O caminho predefinido ao qual o caminho est\u00E1 relacionado.
elytron.properties-realm.groups-attribute=O nome do atributo na Autoriza\u00E7\u00E3oIdentity devolvida que deve conter as informa\u00E7\u00F5es de associa\u00E7\u00E3o de grupo para a identidade.
elytron.properties-realm.synchronized=A hora em que os arquivos de propriedades que acompanham esse realm foram carregadas pela \u00FAltima vez.
elytron.ldap-realm=Uma defini\u00E7\u00E3o de realm de seguran\u00E7a protegido por LDAP.
elytron.ldap-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.ldap-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.ldap-realm.dir-context=A configura\u00E7\u00E3o para conectar a um servidor LDAP.
elytron.ldap-realm.dir-context.url=O URL de conex\u00E3o.
elytron.ldap-realm.dir-context.authentication-level=O n\u00EDvel de autentica\u00E7\u00E3o.
elytron.ldap-realm.dir-context.principal=O principal a ser autenticado e conectado ao servidor LDAP.
elytron.ldap-realm.dir-context.credential=A credencial a ser autenticada e conectada ao servidor LDAP.
elytron.ldap-realm.dir-context.enable-connection-pooling=Indica se o pool de conex\u00F5es est\u00E1 ativado.
elytron.ldap-realm.identity-mapping=As op\u00E7\u00F5es de configura\u00E7\u00E3o que definem como os principais s\u00E3o mapeados para as entradas correspondentes no servidor LDAP subjacente.
elytron.ldap-realm.identity-mapping.rdn-identifier=A parte RDN do DN do principal a ser usada para obter o nome do principal de uma entrada LDAP. Usado tamb\u00E9m ao criar novas identidades.
elytron.ldap-realm.identity-mapping.search-base-dn=O DN base para pesquisar identidades.
elytron.ldap-realm.identity-mapping.use-recursive-search=Indica se as consultas de pesquisa de identidade s\u00E3o recursivas.
elytron.ldap-realm.identity-mapping.attribute-mapping=Os mapeamentos de atributos definidos para este recurso.
elytron.ldap-realm.identity-mapping.attribute-mapping.attribute=A configura\u00E7\u00E3o usada para mapear um atributo LDAP espec\u00EDfico como um atributo de identidade.
elytron.ldap-realm.identity-mapping.from=O nome do atributo LDAP a ser mapeado para um atributo de identidade. Se n\u00E3o estiver definido, o DN de entrada ser\u00E1 usado.
elytron.ldap-realm.identity-mapping.to=O nome do atributo de identidade mapeado de um atributo LDAP espec\u00EDfico. Se n\u00E3o for fornecido, o nome do atributo ser\u00E1 o mesmo que o definido em "from". Se o "from" tamb\u00E9m n\u00E3o estiver definido, o valor "dn" ser\u00E1 usado.
elytron.ldap-realm.identity-mapping.reference=O nome do atributo LDAP que cont\u00E9m o DN de entrada para obter o valor.
elytron.ldap-realm.identity-mapping.filter=O filtro a ser usado para obter os valores de um atributo espec\u00EDfico. A cadeia de caracteres "{0}" ser\u00E1 substitu\u00EDda pelo nome de usu\u00E1rio e "{1}" pelo DN de identidade do usu\u00E1rio.
elytron.ldap-realm.identity-mapping.filter-base-dn=O nome do contexto no qual o filtro deve ser executado.
elytron.ldap-realm.identity-mapping.search-recursive=Indica se as consultas de pesquisa LDAP de atributo s\u00E3o recursivas.
elytron.ldap-realm.identity-mapping.role-recursion=Define a atribui\u00E7\u00E3o de fun\u00E7\u00F5es recursivas \u2013 o valor determina a profundidade m\u00E1xima de recurs\u00E3o. (0 para nenhuma recurs\u00E3o)
elytron.ldap-realm.identity-mapping.role-recursion-name=Determinar o atributo LDAP da entrada de fun\u00E7\u00E3o que substituir\u00E1 "{0}" no filter-name ao pesquisar fun\u00E7\u00F5es de fun\u00E7\u00E3o.
elytron.ldap-realm.identity-mapping.extract-rdn=A chave RDN a ser usada omo valor para um atributo, caso o valor em sua forma bruta esteja no formato X.500.
elytron.ldap-realm.identity-mapping.filter-name=O filtro LDAP para obter a identidade por nome. Se n\u00E3o estiver especificado, o valor padr\u00E3o ser\u00E1 (rdn_identifier\={0}). A cadeia de caracteres '{0}' ser\u00E1 substitu\u00EDda pelo nome da identidade pesquisada e 'rdn_identifier' ser\u00E1 o valor do atributo 'rdn-identifier'.
elytron.ldap-realm.identity-mapping.iterator-filter=O filtro LDAP para iterar sobre as identidades do realm.
elytron.ldap-realm.identity-mapping.new-identity-parent-dn=O DN do pai de identidades rec\u00E9m-criadas. Obrigat\u00F3rio para a modifica\u00E7\u00E3o do realm.
elytron.ldap-realm.identity-mapping.new-identity-attributes=Os atributos das identidades rec\u00E9m-criadas. Obrigat\u00F3rio para a modifica\u00E7\u00E3o do realm.
elytron.ldap-realm.identity-mapping.name=O nome do atributo.
elytron.ldap-realm.identity-mapping.value=O valor do atributo opcional
elytron.ldap-realm.identity-mapping.credential-mapping=Os mapeamentos de credencial definidos para este recurso.
elytron.ldap-realm.identity-mapping.credential-mapping.credential=A configura\u00E7\u00E3o usada para mapear um atributo LDAP espec\u00EDfico como um atributo de senha de usu\u00E1rio.
elytron.ldap-realm.identity-mapping.user-password-mapper=O mapeamento de credenciais para o atributo de credencial userPassword-like.
elytron.ldap-realm.identity-mapping.otp-credential-mapper=O mapeamento de credencial para credencial OTP.
elytron.ldap-realm.identity-mapping.algorithm-from=O nome do atributo LDAP para mapear a um algoritmo de credencial OTP.
elytron.ldap-realm.identity-mapping.hash-from=O nome do atributo LDAP para mapear a um hash de credencial OTP codificado em Base64.
elytron.ldap-realm.identity-mapping.seed-from=O nome do atributo LDAP para mapear a uma semente de credencial OTP.
elytron.ldap-realm.identity-mapping.sequence-from=O nome do atributo LDAP para mapear a um n\u00FAmero de sequ\u00EAncia de credencial OTP.
elytron.ldap-realm.identity-mapping.writable=Indica se a senha pode se alterada.
elytron.ldap-realm.identity-mapping.verifiable=Indica se a senha pode ser usada para verificar o usu\u00E1rio.
elytron.ldap-realm.identity-mapping.x509-credential-mapper=A configura\u00E7\u00E3o que permite usar LDAP como armazenamento de credenciais X509. A credencial X509 \u00E9 um certificado de usu\u00E1rio ou informa\u00E7\u00F5es que permitem identific\u00E1-lo. Pelo menos um atributo *-from deve ser especificado. Esta defini\u00E7\u00E3o ser\u00E1 ignorada de outra forma. Se mais atributos *-from forem definidos, o certificado de usu\u00E1rio dever\u00E1 corresponder a todos os crit\u00E9rios definidos.
elytron.ldap-realm.identity-mapping.digest-from=O nome do atributo LDAP a ser mapeado para um resumo do certificado de usu\u00E1rio. Se n\u00E3o for definido, o resumo do certificado n\u00E3o ser\u00E1 verificado.
elytron.ldap-realm.identity-mapping.digest-algorithm=O algoritmo de resumo (fun\u00E7\u00E3o de hash) usado para calcular o resumo do certificado de usu\u00E1rio. Ser\u00E1 usado somente se digest-from tiver sido definido.
elytron.ldap-realm.identity-mapping.certificate-from=O nome do atributo LDAP a ser mapeado para um certificado de usu\u00E1rio codificado. Se n\u00E3o for definido, o certificado codificado n\u00E3o ser\u00E1 verificado.
elytron.ldap-realm.identity-mapping.serial-number-from=O nome do atributo LDAP a ser mapeado para um n\u00FAmero de s\u00E9rie do certificado de usu\u00E1rio. Se n\u00E3o for definido, o n\u00FAmero de s\u00E9rie n\u00E3o ser\u00E1 verificado.
elytron.ldap-realm.identity-mapping.subject-dn-from=O nome do atributo LDAP a ser mapeado para um DN de entidade do certificado de usu\u00E1rio. Se n\u00E3o for definido, o DN da entidade n\u00E3o ser\u00E1 verificado.
elytron.ldap-realm.direct-verification=Este realm suporta verifica\u00E7\u00E3o de credenciais conectando-se diretamente ao LDAP como a conta que est\u00E1 sendo autenticada?
elytron.ldap-realm.allow-blank-password=Este realm aceita a verifica\u00E7\u00E3o direta de senha em branco? Caso contr\u00E1rio, a tentativa de senha em branco ser\u00E1 rejeitada.
elytron.ldap-realm.identity=Uma identidade que pode ser gerenciada por um realm de seguran\u00E7a.
elytron.filesystem-realm=Uma defini\u00E7\u00E3o de realm de seguran\u00E7a simples protegida pelo sistema de arquivos.
elytron.filesystem-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.filesystem-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.filesystem-realm.path=O caminho do arquivo que cont\u00E9m o realm.
elytron.filesystem-realm.relative-to=O caminho predefinido ao qual o caminho est\u00E1 relacionado.
elytron.filesystem-realm.levels=O n\u00FAmero de n\u00EDveis do hash de diret\u00F3rio a ser aplicado.
elytron.filesystem-realm.encoded=Se os nomes de identidade devem ser armazenados codificados (Base32) nos nomes de arquivos.
elytron.filesystem-realm.identity=Uma identidade que pode ser gerenciada por um realm de seguran\u00E7a.
elytron.token-realm=Uma defini\u00E7\u00E3o de realm de seguran\u00E7a capaz de validar e extrair identidades de tokens de seguran\u00E7a.
elytron.token-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.token-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.token-realm.principal-claim=O nome da declara\u00E7\u00E3o que deve ser usada para obter o nome do principal.
elytron.token-realm.jwt=Um validador de token a ser usado juntamente com um realm com base em token que manipula tokens de seguran\u00E7a com base no padr\u00E3o JWT/JWS.
elytron.token-realm.jwt.issuer=Uma lista de cadeia de caracteres que representam os emissores suportados por esta configura\u00E7\u00E3o. Durante a valida\u00E7\u00E3o, os tokens JWT devem ter uma declara\u00E7\u00E3o "iss" que cont\u00E9m um dos valores definidos aqui.
elytron.token-realm.jwt.audience=Uma lista de cadeia de caracteres que representam as audi\u00EAncias suportadas por esta configura\u00E7\u00E3o. Durante a valida\u00E7\u00E3o, os tokens JWT devem ter uma declara\u00E7\u00E3o "aud" que cont\u00E9m um dos valores definidos aqui.
elytron.token-realm.jwt.public-key=Uma chave p\u00FAblica no formato PEM. Durante a valida\u00E7\u00E3o, se uma chave p\u00FAblica for fornecida, a assinatura ser\u00E1 verificada com base na chave que voc\u00EA forneceu aqui.
elytron.token-realm.jwt.key-store=\   Um reposit\u00F3rio de chaves key onde o certificado com uma chave p\u00FAblica deve ser carregado.
elytron.token-realm.jwt.certificate=O nome do certificado com uma chave p\u00FAblica a ser carregado no reposit\u00F3rio de chaves.
elytron.token-realm.oauth2-introspection=\ Um validador de token para ser usado em conjunto com um realm baseado em token que lida com tokens de acesso OAuth2 e os valida usando um ponto de extremidade compat\u00EDvel com a especifica\u00E7\u00E3o de introspec\u00E7\u00E3o de token OAuth2 (RFC-7662).
elytron.token-realm.oauth2-introspection.client-id=O identificador do cliente no Servidor de Autoriza\u00E7\u00E3o OAuth2.
elytron.token-realm.oauth2-introspection.client-secret=O segredo do cliente.
elytron.token-realm.oauth2-introspection.introspection-url=O URL do ponto de extremidade de introspec\u00E7\u00E3o do token.
elytron.token-realm.oauth2-introspection.client-ssl-context=O contexto SSL a ser usado se o ponto de extremidade de introspec\u00E7\u00E3o estiver usando HTTPS.
elytron.token-realm.oauth2-introspection.host-name-verification-policy=Uma pol\u00EDtica que define como nomes de host devem ser verificados ao usar HTTPS. Valores permitidos\: "ANY".
elytron.modifiable-security-realm.add-identity=Adicionar uma identidade ao realm de seguran\u00E7a.
elytron.modifiable-security-realm.add-identity.identity=O nome da identidade.
elytron.modifiable-security-realm.remove-identity=Remover uma identidade do realm de seguran\u00E7a.
elytron.modifiable-security-realm.remove-identity.identity=O nome da identidade.
elytron.modifiable-security-realm.read-identity=Ler uma identidade em um realm de seguran\u00E7a, se existir.
elytron.modifiable-security-realm.read-identity.identity=O nome da identidade.
elytron.modifiable-security-realm.add-identity-attribute=Adicionar um atributo a uma identidade existente.
elytron.modifiable-security-realm.add-identity-attribute.identity=O nome da identidade.
elytron.modifiable-security-realm.add-identity-attribute.name=O nome do atributo.
elytron.modifiable-security-realm.add-identity-attribute.value=O valor do atributo.
elytron.modifiable-security-realm.remove-identity-attribute=Remover um atributo de uma identidade existente.
elytron.modifiable-security-realm.remove-identity-attribute.identity=O nome da identidade.
elytron.modifiable-security-realm.remove-identity-attribute.name=O nome do atributo.
elytron.modifiable-security-realm.remove-identity-attribute.value=O valor do atributo.
elytron.modifiable-security-realm.set-password=Adicionar uma senha a uma identidade existente.
elytron.modifiable-security-realm.set-password.identity=O nome da identidade.
elytron.modifiable-security-realm.set-password.bcrypt=Uma senha que usa o algoritmo Bcrypt.
elytron.modifiable-security-realm.set-password.bcrypt.iteration-count=A contagem ou o custo de itera\u00E7\u00E3o para aplicar \u00E0 senha.
elytron.modifiable-security-realm.set-password.bcrypt.salt=O sal a ser aplicado \u00E0 senha.
elytron.modifiable-security-realm.set-password.bcrypt.password=A senha real a ser definida.
elytron.modifiable-security-realm.bcrypt=Uma senha que usa o algoritmo Bcrypt.
elytron.modifiable-security-realm.bcrypt.name=O nome da credencial.
elytron.modifiable-security-realm.bcrypt.iteration-count=A contagem ou o custo de itera\u00E7\u00E3o para aplicar \u00E0 senha.
elytron.modifiable-security-realm.bcrypt.salt=O sal a ser aplicado \u00E0 senha.
elytron.modifiable-security-realm.bcrypt.password=A senha real a ser definida.
elytron.modifiable-security-realm.bcrypt.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.set-password.clear=Uma senha com texto n\u00E3o criptografado.
elytron.modifiable-security-realm.set-password.clear.password=A senha real a ser definida.
elytron.modifiable-security-realm.clear=Uma senha com texto n\u00E3o criptografado.
elytron.modifiable-security-realm.clear.name=O nome da credencial.
elytron.modifiable-security-realm.clear.password=A senha real a ser definida.
elytron.modifiable-security-realm.set-password.simple-digest=Uma senha resumida simples.
elytron.modifiable-security-realm.set-password.simple-digest.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.set-password.simple-digest.password=A senha real a ser definida.
elytron.modifiable-security-realm.simple-digest=Uma senha resumida simples.
elytron.modifiable-security-realm.simple-digest.name=O nome da credencial.
elytron.modifiable-security-realm.simple-digest.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.simple-digest.password=A senha real a ser definida.
elytron.modifiable-security-realm.set-password.salted-simple-digest=Uma senha resumida simples com valor de sal.
elytron.modifiable-security-realm.salted-simple-digest.name=O nome da credencial.
elytron.modifiable-security-realm.set-password.salted-simple-digest.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.set-password.salted-simple-digest.salt=O sal a ser aplicado \u00E0 senha.
elytron.modifiable-security-realm.set-password.salted-simple-digest.password=A senha real a ser definida.
elytron.modifiable-security-realm.salted-simple-digest=Uma senha resumida simples com valor de sal.
elytron.modifiable-security-realm.salted-simple-digest.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.salted-simple-digest.salt=O sal a ser aplicado \u00E0 senha.
elytron.modifiable-security-realm.salted-simple-digest.password=A senha real a ser definida.
elytron.modifiable-security-realm.set-password.digest=Um senha resumida.
elytron.modifiable-security-realm.set-password.digest.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.set-password.digest.realm=O realm.
elytron.modifiable-security-realm.set-password.digest.password=A senha real a ser definida.
elytron.modifiable-security-realm.digest=Um senha resumida.
elytron.modifiable-security-realm.digest.name=O nome da credencial.
elytron.modifiable-security-realm.digest.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.digest.realm=O realm.
elytron.modifiable-security-realm.digest.password=A senha real a ser definida.
elytron.modifiable-security-realm.otp=Uma senha \u00FAnica usada pelo mecanismo SASL do OTP.
elytron.modifiable-security-realm.otp.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.otp.password=A real senha a ser definida.
elytron.modifiable-security-realm.otp.seed=A semente usada para gerar o hash.
elytron.modifiable-security-realm.otp.sequence=O n\u00FAmero da sequ\u00EAncia usada para gerar o hash.
elytron.modifiable-security-realm.set-password.otp=Uma senha \u00FAnica usada pelo mecanismo SASL do OTP.
elytron.modifiable-security-realm.set-password.algorithm=O algoritmo usado para criptografar a senha.
elytron.modifiable-security-realm.set-password.otp.password=A senha real a ser definida.
elytron.modifiable-security-realm.set-password.otp.seed=A semente usada para gerar o hash.
elytron.modifiable-security-realm.set-password.otp.sequence=O n\u00FAmero da sequ\u00EAncia usada para gerar o hash.
elytron.caching-realm=Uma defini\u00E7\u00E3o de realm que permite o armazenamento em cache para outro realm de seguran\u00E7a. A estrat\u00E9gia de cache \u00E9 LRU (menos utilizado recentemente), na qual as entradas menos acessadas s\u00E3o descartadas quando o n\u00FAmero m\u00E1ximo de entradas \u00E9 atingido.
elytron.caching-realm.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.caching-realm.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para o realm de seguran\u00E7a.
elytron.caching-realm.realm=Uma refer\u00EAncia a um realm de seguran\u00E7a armazen\u00E1vel em cache.
elytron.caching-realm.maximum-entries=O n\u00FAmero m\u00E1ximo de entradas a serem mantidas em cache.
elytron.caching-realm.maximum-age=O tempo em milissegundos que um item pode permanecer em cache.
elytron.caching-realm.clear-cache=Remove todas as entradas do cache.
elytron.aggregate-sasl-server-factory=Uma defini\u00E7\u00E3o de f\u00E1brica de servidores SASL na qual a f\u00E1brica de servidores SASL \u00E9 uma agrega\u00E7\u00E3o de outras f\u00E1bricas de servidores SASL.
elytron.aggregate-sasl-server-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.aggregate-sasl-server-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.aggregate-sasl-server-factory.sasl-server-factories=As f\u00E1bricas de servidores SASL referenciadas a serem agregadas.
elytron.aggregate-sasl-server-factory.available-mechanisms=Os mecanismos SASL dispon\u00EDveis nesta f\u00E1brica ap\u00F3s todos os filtros terem sido aplicados.
elytron.configurable-sasl-server-factory=Uma defini\u00E7\u00E3o SaslServerFactory que encapsula outra SaslServerFactory e aplica a configura\u00E7\u00E3o e os filtros especificados.
elytron.configurable-sasl-server-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.configurable-sasl-server-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.configurable-sasl-server-factory.sasl-server-factory=A f\u00E1brica de servidores SASL a ser encapsulada.
elytron.configurable-sasl-server-factory.protocol=O protocolo que deve ser passado na f\u00E1brica ao criar o mecanismo.
elytron.configurable-sasl-server-factory.server-name=O nome de servidor que deve ser passado na f\u00E1brica ao criar o mecanismo.
elytron.configurable-sasl-server-factory.properties=Propriedades personalizadas a serem passadas nas chamadas da f\u00E1brica dos servidores SASL.
elytron.configurable-sasl-server-factory.filters=Lista de filtros a serem avaliados sequencialmente combinando os resultados usando "ou".
elytron.configurable-sasl-server-factory.filters.predefined-filter=Um filtro predefinido a ser usado para filtrar o nome do mecanismo.
elytron.configurable-sasl-server-factory.filters.pattern-filter=Um filtro com base em uma express\u00E3o regular do nome do mecanismo.
elytron.configurable-sasl-server-factory.filters.enabling=Este filtro est\u00E1 habilitando ou desabilitando os nomes correspondidos?
elytron.configurable-sasl-server-factory.available-mechanisms=Os mecanismos SASL dispon\u00EDveis nesta f\u00E1brica ap\u00F3s todos os filtros terem sido aplicados.
elytron.mechanism-provider-filtering-sasl-server-factory=Uma defini\u00E7\u00E3o SaslServerFactory que encapsula outra SaslServerFactory e ativa a filtragem de mecanismos com base no nome do mecanismo, nome do Provedor e vers\u00E3o. Todos os mecanismos carregados por f\u00E1bricas que n\u00E3o forem localizados usando um Provedor n\u00E3o ser\u00E3o filtrados por esta defini\u00E7\u00E3o.
elytron.mechanism-provider-filtering-sasl-server-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.mechanism-provider-filtering-sasl-server-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.mechanism-provider-filtering-sasl-server-factory.sasl-server-factory=Refer\u00EAncia a uma f\u00E1brica de servidor SASL a ser encapsulada por esta defini\u00E7\u00E3o.
elytron.mechanism-provider-filtering-sasl-server-factory.enabling=Quando definido como "verdadeiro", nenhum mecanismo carregado do provedor \u00E9 ativado, a menos que corresponda a um dos filtros. Definir como "falso" tem efeito inverso.
elytron.mechanism-provider-filtering-sasl-server-factory.filters=Os filtros a serem aplicados ao comparar os mecanismos dos provedores. Um filtro corresponde quando todos os valores especificados correspondem ao par do mecanismo/provedor.
elytron.mechanism-provider-filtering-sasl-server-factory.filters.mechanism-name=Esta configura\u00E7\u00E3o ser\u00E1 aplicada somente quando um mecanismo com o nome especificado for usado. Se o atributo for omitido, isso corresponder\u00E1 a qualquer nome de mecanismo.
elytron.mechanism-provider-filtering-sasl-server-factory.filters.provider-name=O nome do provedor para a correspond\u00EAncia.
elytron.mechanism-provider-filtering-sasl-server-factory.filters.provider-version=Vers\u00E3o para comparar com a vers\u00E3o relatada pelo provedor.
elytron.mechanism-provider-filtering-sasl-server-factory.filters.version-comparison=Quando definido como "menor que", um Provedor corresponder\u00E1 ao filtro se a vers\u00E3o do Provedor for menor do que a vers\u00E3o especificada aqui. A defini\u00E7\u00E3o de "maior que" tem o efeito inverso. N\u00E3o ter\u00E1 nenhuma efeito se uma vers\u00E3o do provedor n\u00E3o tiver sido especificada no filtro.
elytron.mechanism-provider-filtering-sasl-server-factory.available-mechanisms=Os mecanismos SASL dispon\u00EDveis nesta f\u00E1brica ap\u00F3s todos os filtros terem sido aplicados.
elytron.provider-sasl-server-factory=Uma defini\u00E7\u00E3o de f\u00E1brica de servidores SASL na qual a f\u00E1brica de servidores SASL \u00E9 uma agrega\u00E7\u00E3o de f\u00E1bricas do Provedor []
elytron.provider-sasl-server-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.provider-sasl-server-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.provider-sasl-server-factory.providers=Os provedores usados para localizar as f\u00E1bricas. Se n\u00E3o forem especificados, a lista registrada global de Provedores ser\u00E1 usada.
elytron.provider-sasl-server-factory.available-mechanisms=Os mecanismos SASL dispon\u00EDveis nesta f\u00E1brica ap\u00F3s todos os filtros terem sido aplicados.
elytron.service-loader-sasl-server-factory=Uma defini\u00E7\u00E3o de f\u00E1brica de servidores SASL na qual a f\u00E1brica de servidores SASL \u00E9 uma agrega\u00E7\u00E3o de f\u00E1bricas identificadas usando um ServiceLoader
elytron.service-loader-sasl-server-factory.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.service-loader-sasl-server-factory.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o para a f\u00E1brica de servidores SASL.
elytron.service-loader-sasl-server-factory.module=O m\u00F3dulo usado para obter o classloader para carregar as f\u00E1bricas. Se n\u00E3o for especificado, ser\u00E1 usado o classloader para carregar o recurso.
elytron.service-loader-sasl-server-factory.available-mechanisms=Os mecanismos SASL dispon\u00EDveis nesta f\u00E1brica ap\u00F3s todos os filtros terem sido aplicados.
elytron.key-store=Uma defini\u00E7\u00E3o de KeyStore.
elytron.key-store.add=Adicionar uma nova defini\u00E7\u00E3o de KeyStore.
elytron.key-store.remove=Remover a defini\u00E7\u00E3o de KeyStore.
elytron.key-store.load=Carregar o KeyStore. Se o KeyStore estiver protegido por um arquivo, isso envolver\u00E1 a releitura do conte\u00FAdo do arquivo.
elytron.key-store.store=Armazenar o KeyStore para o arquivo. Esta opera\u00E7\u00E3o falhar\u00E1 para qualquer inst\u00E2ncia KeyStore n\u00E3o protegida por um arquivo. Se o arquivo n\u00E3o existir e n\u00E3o for sinalizado como necess\u00E1rio, ele ser\u00E1 criado.
elytron.key-store.type=O tipo de KeyStore usado ao criar a nova inst\u00E2ncia do KeyStore.
elytron.key-store.provider-name=O nome do provedor a ser usado para carregar o KeyStore desativa a pesquisa do primeiro Provedor, que pode criar um KeyStore do tipo especificado.
elytron.key-store.credential-reference=A refer\u00EAncia da credencial armazenada em CredentialStore no alias definido ou na senha com texto n\u00E3o criptografado. 
elytron.key-store.credential-reference.store=O nome do reposit\u00F3rio de credenciais contendo o alias da credencial.
elytron.key-store.credential-reference.alias=O alias que denota credencial ou segredo armazenado no reposit\u00F3rio.
elytron.key-store.credential-reference.type=O tipo de credencial que esta refer\u00EAncia est\u00E1 denotando.
elytron.key-store.credential-reference.clear-text=O segredo especificado usando texto n\u00E3o criptografado. Verifique como o reposit\u00F3rio de credenciais fornece credenciais/segredos aos servi\u00E7os.
elytron.key-store.relative-to=O caminho base ao qual este armazenamento \u00E9 relativo.
elytron.key-store.path=O caminho para o arquivo do KeyStore.
elytron.key-store.required=\u00C9 preciso existir um arquivo no momento em que o servi\u00E7o do KeyStore inicia?
elytron.key-store.providers=Uma refer\u00EAncia aos provedores que devem ser usados para obter a lista de inst\u00E2ncias do Provedor para pesquisar. Se n\u00E3o for especificada, a lista global de provedores ser\u00E1 usada.
elytron.key-store.alias-filter=Um filtro a ser aplicado aos alias retornados do KeyStore. Pode ser tanto uma lista separada por v\u00EDrgulas de alias a serem retornados ou um dos seguintes formatos ALL\:-alias1\:-alias2, NONE\:+alias1\:+alias2
elytron.key-store.state=O estado do servi\u00E7o subjacente que representa este KeyStore no tempo de execu\u00E7\u00E3o. Se for diferente de UP, as opera\u00E7\u00F5es de tempo de execu\u00E7\u00E3o n\u00E3o ficar\u00E3o dispon\u00EDveis.
elytron.key-store.synchronized=A hora em que este KeyStore foi carregado ou salvo pela \u00FAltima vez. Observa\u00E7\u00E3o\: alguns provedores podem continuar a aplicar atualiza\u00E7\u00F5es depois que o KeyStore for carregado no servidor do aplicativo.
elytron.key-store.modified=Indica se a representa\u00E7\u00E3o na mem\u00F3ria do KeyStore foi alterada desde que foi carregada ou armazenada pela \u00FAltima vez. Observa\u00E7\u00E3o\: para alguns provedores, as atualiza\u00E7\u00F5es podem ser imediatas, sem mais carregamentos ou chamadas de armazenamento.
elytron.key-store.loaded-provider=Informa\u00E7\u00F5es sobre o provedor que foi usado para este KeyStore.
elytron.key-store.loaded-provider.name=O nome do provedor usado para carregar o KeyStore.
elytron.key-store.loaded-provider.info=A cadeia de caracteres de informa\u00E7\u00F5es sobre o provedor usado para carregar o KeyStore.
elytron.key-store.loaded-provider.version=A vers\u00E3o do provedor usado para carregar o KeyStore.
elytron.key-store.size=O n\u00FAmero de entradas no KeyStore.
elytron.key-store.alias=Um alias individual dentro do KeyStore.
elytron.key-store.alias.remove=Imediatamente remove o alias do KeyStore. O \u00EAxito desta opera\u00E7\u00E3o depender\u00E1 de o provedor KeyStore subjacente suportar emo\u00E7\u00F5es.
elytron.key-store.alias.creation-date=A data de cria\u00E7\u00E3o da entrada representada por este ali\u00E1s.
elytron.key-store.alias.entry-type=O tipo de entrada para este alias. Observa\u00E7\u00E3o\: os tipos n\u00E3o reconhecidos ser\u00E3o reportados como "Outros".
elytron.key-store.alias.certificate=O certificado associado ao alias (observa\u00E7\u00E3o\: se o alias tiver uma cadeia de certificados, ela sempre ser\u00E1 indefinida).
elytron.key-store.alias.certificate-chain=A cadeia de certificados associada ao alias.
elytron.key-store.alias.certificate.type=O tipo do certificado.
elytron.key-store.alias.certificate.algorithm=O algoritmo da chave p\u00FAblica.
elytron.key-store.alias.certificate.format=O formato da chave p\u00FAblica.
elytron.key-store.alias.certificate.public-key=A chave p\u00FAblica codificada associada ao certificado.
elytron.key-store.alias.certificate.sha-1-digest=O resumo SHA-1 (impress\u00E3o digital) do certificado.
elytron.key-store.alias.certificate.sha-256-digest=O resumo SHA-256 (impress\u00E3o digital) do certificado.
elytron.key-store.alias.certificate.encoded=O valor codificado do certificado.
elytron.key-store.alias.certificate.subject=A entidade do certificado.
elytron.key-store.alias.certificate.issuer=O emissor do certificado.
elytron.key-store.alias.certificate.not-before=A data e o hor\u00E1rio iniciais em que o certificado \u00E9 v\u00E1lido.
elytron.key-store.alias.certificate.not-after=A data e hora de expira\u00E7\u00E3o do certificado.
elytron.key-store.alias.certificate.serial-number=O n\u00FAmero de s\u00E9rie do certificado.
elytron.key-store.alias.certificate.signature-algorithm=O algoritmo usado para gerar a assinatura dos certificados.
elytron.key-store.alias.certificate.signature=A assinatura do certificado.
elytron.key-store.alias.certificate.version=A vers\u00E3o do certificado.
elytron.key-store.alias.certificate-chain.type=O tipo do certificado.
elytron.key-store.alias.certificate-chain.algorithm=O algoritmo da chave p\u00FAblica.
elytron.key-store.alias.certificate-chain.format=O formato da chave p\u00FAblica.
elytron.key-store.alias.certificate-chain.public-key=A chave p\u00FAblica codificada associada ao certificado.
elytron.key-store.alias.certificate-chain.sha-1-digest=O resumo SHA-1 (impress\u00E3o digital) do certificado.
elytron.key-store.alias.certificate-chain.sha-256-digest=O resumo SHA-256 (impress\u00E3o digital) do certificado.
elytron.key-store.alias.certificate-chain.encoded=O valor codificado do certificado.
elytron.key-store.alias.certificate-chain.subject=A entidade do certificado.
elytron.key-store.alias.certificate-chain.issuer=O emissor do certificado.
elytron.key-store.alias.certificate-chain.not-before=A data e o hor\u00E1rio iniciais em que o certificado \u00E9 v\u00E1lido.
elytron.key-store.alias.certificate-chain.not-after=A data e hora de expira\u00E7\u00E3o do certificado.
elytron.key-store.alias.certificate-chain.serial-number=O n\u00FAmero de s\u00E9rie do certificado.
elytron.key-store.alias.certificate-chain.signature-algorithm=O algoritmo usado para gerar a assinatura dos certificados.
elytron.key-store.alias.certificate-chain.signature=A assinatura do certificado.
elytron.key-store.alias.certificate-chain.version=A vers\u00E3o do certificado.
elytron.modifiable-key-store.read-alias=Ler um alias de um KeyStore.
elytron.modifiable-key-store.read-alias.alias=O alias de um item do KeyStore a ser lido.
elytron.modifiable-key-store.read-aliases=Ler aliases de um Keystore.
elytron.modifiable-key-store.remove-alias=Remover um alias de um KeyStore.
elytron.modifiable-key-store.remove-alias.alias=O alias de um item do KeyStore a ser removido.
elytron.ldap-key-store=Uma defini\u00E7\u00E3o LdapKeyStore.
elytron.ldap-key-store.add=Adicionar um novo KeyStore LDAP.
elytron.ldap-key-store.remove=Remover o KeyStore LDAP.
elytron.ldap-key-store.size=O tamanho do KeyStore LDAP em quantidade de itens/aliases.
elytron.ldap-key-store.state=O estado do servi\u00E7o subjacente que representa este KeyStore no tempo de execu\u00E7\u00E3o. Se for diferente de UP, as opera\u00E7\u00F5es de tempo de execu\u00E7\u00E3o n\u00E3o ficar\u00E3o dispon\u00EDveis.
elytron.ldap-key-store.dir-context=O nome do DirContext, que ser\u00E1 usado para comunica\u00E7\u00E3o com o servidor LDAP.
elytron.ldap-key-store.search-path=O caminho no LDAP, onde ser\u00E3o armazenados os itens do KeyStore pesquisados.
elytron.ldap-key-store.search-recursive=Se a pesquisa LDAP deve ser recursiva.
elytron.ldap-key-store.search-time-limit=O limite de tempo para obter itens do armazenamento de chaves do LDAP.
elytron.ldap-key-store.filter-alias=O filtro LDAP para obten\u00E7\u00E3o de um item obtaining an item of the KeyStore by alias. If this is not specified then the default value will be (alias_attribute\={0}). The string '{0}' will be replaced by the searched alias and the 'alias_attribute' value will be the value of the attribute 'alias-attribute'.
elytron.ldap-key-store.filter-certificate=O filtro LDAP para obten\u00E7\u00E3o de um item do KeyStore por certificado. Se isso n\u00E3o for especificado, o valor padr\u00E3o ser\u00E1 (certificate_attribute\={0}). A cadeia de caracteres '{0}' ser\u00E1 substitu\u00EDda pelo certificado codificado pesquisado, e o 'certificate_attribute' ser\u00E1 o valor do atributo 'certificate-attribute'.
elytron.ldap-key-store.filter-iterate=O filtro LDAP para itera\u00E7\u00E3o de todos os itens do KeyStore. Se isso n\u00E3o for especificado, o valor padr\u00E3o ser\u00E1 (alias_attribute\=*). O 'alias_attribute' ser\u00E1 o valor do atributo 'alias-attribute'.
elytron.ldap-key-store.new-item-template=Configura\u00E7\u00E3o para cria\u00E7\u00E3o de itens. Defina como ficar\u00E1 a entrada LDAP do item de armazenamento de chaves rec\u00E9m-criado.
elytron.ldap-key-store.new-item-template.new-item-path=O caminho no LDAP no qual os itens do KeyStore rec\u00E9m-criados ser\u00E3o armazenados.
elytron.ldap-key-store.new-item-template.new-item-rdn=O nome do atributo LDAP, que ser\u00E1 usado no RDN dos itens rec\u00E9m-criados.
elytron.ldap-key-store.new-item-template.new-item-attributes=Os atributos LDAP, que ser\u00E3o definidos para itens rec\u00E9m-criados.
elytron.ldap-key-store.new-item-template.name=O nome do atributo LDAP.
elytron.ldap-key-store.new-item-template.value=O valor do atributo LDAP.
elytron.ldap-key-store.alias-attribute=O nome do atributo LDAP no qual o alias do item ser\u00E1 armazenado.
elytron.ldap-key-store.certificate-attribute=O nome do atributo LDAP no qual o certificado ser\u00E1 armazenado.
elytron.ldap-key-store.certificate-type=O tipo do certificado.
elytron.ldap-key-store.certificate-chain-attribute=O nome do atributo LDAP no qual a cadeia de certificados ser\u00E1 armazenada.
elytron.ldap-key-store.certificate-chain-type=O tipo dos certificados na cadeia de certificados.
elytron.ldap-key-store.certificate-chain-encoding=A codifica\u00E7\u00E3o da cadeira de certificados.
elytron.ldap-key-store.key-attribute=O nome do atributo LDAP no qual a chave ser\u00E1 armazenada.
elytron.ldap-key-store.key-type=O tipo de KeyStore no qual a chave ser\u00E1 serializada para o atributo LDAP.
elytron.ldap-key-store.alias=Um alias individual dentro do KeyStore.
elytron.ldap-key-store.alias.remove=Imediatamente remove o alias do KeyStore. O \u00EAxito desta opera\u00E7\u00E3o depender\u00E1 de o provedor KeyStore subjacente suportar emo\u00E7\u00F5es.
elytron.ldap-key-store.alias.creation-date=A data de cria\u00E7\u00E3o da entrada representada por este ali\u00E1s.
elytron.ldap-key-store.alias.entry-type=O tipo de entrada para este alias. Observa\u00E7\u00E3o\: os tipos n\u00E3o reconhecidos ser\u00E3o reportados como "Outros".
elytron.ldap-key-store.alias.certificate=O certificado associado ao alias (observa\u00E7\u00E3o\: se o alias tiver uma cadeia de certificados, ela sempre ser\u00E1 indefinida).
elytron.ldap-key-store.alias.certificate-chain=A cadeia de certificados associada ao alias.
elytron.ldap-key-store.alias.certificate.type=O tipo do certificado.
elytron.ldap-key-store.alias.certificate.algorithm=O algoritmo da chave p\u00FAblica.
elytron.ldap-key-store.alias.certificate.format=O formato da chave p\u00FAblica.
elytron.ldap-key-store.alias.certificate.public-key=A chave p\u00FAblica codificada associada ao certificado.
elytron.ldap-key-store.alias.certificate.sha-1-digest=O resumo SHA-1 (impress\u00E3o digital) do certificado.
elytron.ldap-key-store.alias.certificate.sha-256-digest=O resumo SHA-256 (impress\u00E3o digital) do certificado.
elytron.ldap-key-store.alias.certificate.encoded=O valor codificado do certificado.
elytron.ldap-key-store.alias.certificate.subject=A entidade do certificado.
elytron.ldap-key-store.alias.certificate.issuer=O emissor do certificado.
elytron.ldap-key-store.alias.certificate.not-before=A data e o hor\u00E1rio iniciais em que o certificado \u00E9 v\u00E1lido.
elytron.ldap-key-store.alias.certificate.not-after=A data e hora de expira\u00E7\u00E3o do certificado.
elytron.ldap-key-store.alias.certificate.serial-number=O n\u00FAmero de s\u00E9rie do certificado.
elytron.ldap-key-store.alias.certificate.signature-algorithm=O algoritmo usado para gerar a assinatura dos certificados.
elytron.ldap-key-store.alias.certificate.signature=A assinatura do certificado.
elytron.ldap-key-store.alias.certificate.version=A vers\u00E3o do certificado.
elytron.ldap-key-store.alias.certificate-chain.type=O tipo do certificado.
elytron.ldap-key-store.alias.certificate-chain.algorithm=O algoritmo da chave p\u00FAblica.
elytron.ldap-key-store.alias.certificate-chain.format=O formato da chave p\u00FAblica.
elytron.ldap-key-store.alias.certificate-chain.public-key=A chave p\u00FAblica codificada associada ao certificado.
elytron.ldap-key-store.alias.certificate-chain.sha-1-digest=O resumo SHA-1 (impress\u00E3o digital) do certificado.
elytron.ldap-key-store.alias.certificate-chain.sha-256-digest=O resumo SHA-256 (impress\u00E3o digital) do certificado.
elytron.ldap-key-store.alias.certificate-chain.encoded=O valor codificado do certificado.
elytron.ldap-key-store.alias.certificate-chain.subject=A entidade do certificado.
elytron.ldap-key-store.alias.certificate-chain.issuer=O emissor do certificado.
elytron.ldap-key-store.alias.certificate-chain.not-before=A data e o hor\u00E1rio iniciais em que o certificado \u00E9 v\u00E1lido.
elytron.ldap-key-store.alias.certificate-chain.not-after=A data e hora de expira\u00E7\u00E3o do certificado.
elytron.ldap-key-store.alias.certificate-chain.serial-number=O n\u00FAmero de s\u00E9rie do certificado.
elytron.ldap-key-store.alias.certificate-chain.signature-algorithm=O algoritmo usado para gerar a assinatura dos certificados.
elytron.ldap-key-store.alias.certificate-chain.signature=A assinatura do certificado.
elytron.ldap-key-store.alias.certificate-chain.version=A vers\u00E3o do certificado.
elytron.filtering-key-store=Um defini\u00E7\u00E3o de KeyStore de filtragem.
elytron.filtering-key-store.add=Adicionar uma nova defini\u00E7\u00E3o de KeyStore.
elytron.filtering-key-store.remove=Remover a defini\u00E7\u00E3o de KeyStore.
elytron.filtering-key-store.alias-filter=Um filtro a ser aplicado aos alias retornados do KeyStore. Pode ser tanto uma lista separada por v\u00EDrgulas de alias a serem retornados ou um dos seguintes formatos ALL\:-alias1\:-alias2, NONE\:+alias1\:+alias2
elytron.filtering-key-store.key-store=Nome do KeyStore filtrado.
elytron.filtering-key-store.state=O estado do servi\u00E7o subjacente que representa este KeyStore no tempo de execu\u00E7\u00E3o. Se for diferente de UP, as opera\u00E7\u00F5es de tempo de execu\u00E7\u00E3o n\u00E3o ficar\u00E3o dispon\u00EDveis.
elytron.filtering-key-store.alias=Um alias individual dentro do KeyStore de filtragem.
elytron.key-manager=Uma defini\u00E7\u00E3o de gerenciador de chaves para criar o KeyManager conforme usado para criar um SSLContext.
elytron.key-manager.add=Adicionar a nova defini\u00E7\u00E3o do gerenciador de chaves.
elytron.key-manager.remove=Remover a defini\u00E7\u00E3o do gerenciador de chaves.
elytron.key-manager.init=Reinicializar o gerenciador de chaves.
elytron.key-manager.algorithm=O nome do algoritmo a ser usado para criar o KeyManagerFactory subjacente.
elytron.key-manager.providers=Refer\u00EAncia para obter o Provedor[] a ser usado para criar o KeyManagerFactory subjacente.
elytron.key-manager.provider-name=O nome do provedor a ser usado para criar o KeyManagerFactory subjacente.
elytron.key-manager.credential-reference=A refer\u00EAncia de credencial para descriptografar o item de KeyStore (n\u00E3o uma senha do KeyStore).
elytron.key-manager.credential-reference.store=O nome do reposit\u00F3rio de credenciais contendo o alias da credencial.
elytron.key-manager.credential-reference.alias=O alias que denota credencial ou segredo armazenado no reposit\u00F3rio.
elytron.key-manager.credential-reference.type=O tipo de credencial que esta refer\u00EAncia est\u00E1 denotando.
elytron.key-manager.credential-reference.clear-text=O segredo especificado usando texto n\u00E3o criptografado. Verifique como o reposit\u00F3rio de credenciais fornece credenciais/segredos aos servi\u00E7os.
elytron.key-manager.key-store=Refer\u00EAncia ao KeyStore a ser usado para inicializar o KeyManagerFactory subjacente.
elytron.key-manager.alias-filter=Um filtro a ser aplicado aos alias retornados do KeyStore. Pode ser tanto uma lista separada por v\u00EDrgulas de alias a serem retornados ou um dos seguintes formatos ALL\:-alias1\:-alias2, NONE\:+alias1\:+alias2
elytron.trust-manager=Uma defini\u00E7\u00E3o de gerenciador de confian\u00E7a para criar o  TrustManager[], conforme usado para criar um SSLContext.
elytron.trust-manager.add=Adicionar a nova defini\u00E7\u00E3o do gerenciador de confian\u00E7a.
elytron.trust-manager.remove=Remover a defini\u00E7\u00E3o do gerenciador de confian\u00E7a.
elytron.trust-manager.algorithm=O nome do algoritmo a ser usado para criar o TrustManagerFactory subjacente.
elytron.trust-manager.providers=Refer\u00EAncia para obter o Provedor[] a ser usado para criar o TrustManagerFactory subjacente.
elytron.trust-manager.provider-name=O nome do provedor a ser usado para criar o TrustManagerFactory subjacente.
elytron.trust-manager.key-store=Refer\u00EAncia ao KeyStore a ser usado para inicializar o TrustManagerFactory subjacente.
elytron.trust-manager.alias-filter=Um filtro a ser aplicado aos alias retornados do KeyStore. Pode ser tanto uma lista separada por v\u00EDrgulas de alias a serem retornados ou um dos seguintes formatos ALL\:-alias1\:-alias2, NONE\:+alias1\:+alias2
elytron.trust-manager.certificate-revocation-list=Ativa as verifica\u00E7\u00F5es da lista de revoga\u00E7\u00E3o de certificado para um gerenciador de confian\u00E7a.
elytron.trust-manager.certificate-revocation-list.path=O caminho da configura\u00E7\u00E3o a ser usada para inicializar o provedore.
elytron.trust-manager.certificate-revocation-list.relative-to=O caminho base do arquivo de da lista de revoga\u00E7\u00E3o de certificado.
elytron.trust-manager.certificate-revocation-list.maximum-cert-path=O n\u00FAmero m\u00E1ximo de certificados intermedi\u00E1rios n\u00E3o auto-emitidos que podem existir em um caminho de certifica\u00E7\u00E3o.
elytron.trust-manager.reload-certificate-revocation-list=Notificar o gerenciador de confian\u00E7a para recarregar a lista de revoga\u00E7\u00E3o de certificado, se estiver definida.
elytron.client-ssl-context=O SSLContext a ser usado no lado do cliente de uma conex\u00E3o.
elytron.client-ssl-context.add=Adicionar a defini\u00E7\u00E3o do SSLContext.
elytron.client-ssl-context.remove=Remover a defini\u00E7\u00E3o do SSLContext.
elytron.client-ssl-context.cipher-suite-filter=O filtro a ser aplicado para especificar aos pacotes de criptografia ativados.
elytron.client-ssl-context.protocols=Os protocolos ativados.
elytron.client-ssl-context.use-cipher-suites-order=Para honrar a prefer\u00EAncia dos pacotes de criptografia locais.
elytron.client-ssl-context.maximum-session-cache-size=O n\u00FAmero m\u00E1ximo de sess\u00F5es SSL no cache. O valor padr\u00E3o -1 significa que o valor padr\u00E3o JVM \u00E9 usado. O valor zero significa que n\u00E3o h\u00E1 limite.
elytron.client-ssl-context.session-timeout=O tempo limite de sess\u00F5es SSL em segundos. O valor padr\u00E3o -1 significa que o valor padr\u00E3o JVM \u00E9 usado. O valor zero significa que n\u00E3o h\u00E1 limite.
elytron.client-ssl-context.key-manager=Refer\u00EAncia ao gerenciador de chaves a ser usado no SSLContext.
elytron.client-ssl-context.key-refresh=Atualizar o KeyManager usado pelo SSLContext.
elytron.client-ssl-context.trust-manager=Refer\u00EAncia ao gerenciador de confian\u00E7a a ser usado no SSLContext.
elytron.client-ssl-context.provider-name=O nome do provedor a ser usado. Se n\u00E3o for especificado, todos os provedores ser\u00E3o passados para o SSLContext.
elytron.client-ssl-context.providers=O nome dos provedores para obter o Provedor[] a ser usado para carregar o SSLContext.
elytron.client-ssl-context.active-session-count=A contagem de sess\u00F5es ativas atuais.
elytron.client-ssl-context.ssl-session=Uma sess\u00E3o SSL estabelecida atualmente.
elytron.client-ssl-context.ssl-session.application-buffer-size=O tamanho do buffer do aplicativo, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.cipher-suite=O pacote de criptografia selecionado, conforme relato pela SSLSession.
elytron.client-ssl-context.ssl-session.creation-time=O tempo de cria\u00E7\u00E3o, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.last-accessed-time=A hora do \u00FAltimo acesso, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.local-principal=O principal do local, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.packet-buffer-size=O tamanho do buffer no pacote, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.peer-host=O host do par, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.peer-port=A porta do par, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.peer-principal=O principal do par, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.protocol=O protocolo, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.valid=A validade da sess\u00E3o, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.local-certificates=Os certificados do local, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.local-certificates.type=O tipo do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.algorithm=O algoritmo da chave p\u00FAblica.
elytron.client-ssl-context.ssl-session.local-certificates.format=O formato da chave p\u00FAblica.
elytron.client-ssl-context.ssl-session.local-certificates.public-key=A chave p\u00FAblica codificada associada ao certificado.
elytron.client-ssl-context.ssl-session.local-certificates.sha-1-digest=O resumo SHA-1 (impress\u00E3o digital) do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.sha-256-digest=O resumo SHA-256 (impress\u00E3o digital) do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.encoded=O valor codificado do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.subject=A entidade do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.issuer=O emissor do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.not-before=A data e o hor\u00E1rio iniciais em que o certificado \u00E9 v\u00E1lido.
elytron.client-ssl-context.ssl-session.local-certificates.not-after=A data e hora de expira\u00E7\u00E3o do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.serial-number=O n\u00FAmero de s\u00E9rie do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.signature-algorithm=O algoritmo usado para gerar a assinatura dos certificados.
elytron.client-ssl-context.ssl-session.local-certificates.signature=A assinatura do certificado.
elytron.client-ssl-context.ssl-session.local-certificates.version=A vers\u00E3o do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates=Os certificados do par, conforme relatado pela SSLSession.
elytron.client-ssl-context.ssl-session.peer-certificates.type=O tipo do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.algorithm=O algoritmo da chave p\u00FAblica.
elytron.client-ssl-context.ssl-session.peer-certificates.format=O formato da chave p\u00FAblica.
elytron.client-ssl-context.ssl-session.peer-certificates.public-key=A chave p\u00FAblica codificada associada ao certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.sha-1-digest=O resumo SHA-1 (impress\u00E3o digital) do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.sha-256-digest=O resumo SHA-256 (impress\u00E3o digital) do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.encoded=O valor codificado do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.subject=A entidade do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.issuer=O emissor do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.not-before=A data e o hor\u00E1rio iniciais em que o certificado \u00E9 v\u00E1lido.
elytron.client-ssl-context.ssl-session.peer-certificates.not-after=A data e hora de expira\u00E7\u00E3o do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.serial-number=O n\u00FAmero de s\u00E9rie do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.signature-algorithm=O algoritmo usado para gerar a assinatura dos certificados.
elytron.client-ssl-context.ssl-session.peer-certificates.signature=A assinatura do certificado.
elytron.client-ssl-context.ssl-session.peer-certificates.version=A vers\u00E3o do certificado.
elytron.client-ssl-context.ssl-session.invalidate=Invalidar a SSLSession (observa\u00E7\u00E3o\: isso n\u00E3o encerra as conex\u00F5es atuais, apenas impede que conex\u00F5es futuras se juntem ou retomem esta sess\u00E3o).
elytron.server-ssl-context=O SSLContext a ser usado no lado do servidor de uma conex\u00E3o.
elytron.server-ssl-context.add=Adicionar a defini\u00E7\u00E3o do SSLContext.
elytron.server-ssl-context.remove=Remover a defini\u00E7\u00E3o do SSLContext.
elytron.server-ssl-context.security-domain=O  dom\u00EDnio de seguran\u00E7a a ser usado para autentica\u00E7\u00E3o durante o estabelecimento de uma sess\u00E3o SSL.
elytron.server-ssl-context.cipher-suite-filter=O filtro a ser aplicado para especificar aos pacotes de criptografia ativados.
elytron.server-ssl-context.protocols=Os protocolos ativados.
elytron.server-ssl-context.want-client-auth=Para solicitar (mas n\u00E3o exigir) um certificado de cliente no handshake SSL. Se um dom\u00EDnio de seguran\u00E7a for referenciado e suportar a evid\u00EAncia X509, ele ser\u00E1 definido como verdadeiro automaticamente. Ser\u00E1 ignorado quando need-client-auth estiver configurado.
elytron.server-ssl-context.need-client-auth=Para exigir um certificado do cliente no handshake SSL. A conex\u00E3o sem certificado de cliente confi\u00E1vel (consulte trust-manager) ser\u00E1 rejeitada.
elytron.server-ssl-context.authentication-optional=A rejei\u00E7\u00E3o do certificado do cliente pelo dom\u00EDnio de seguran\u00E7a n\u00E3o impedir\u00E1 a conex\u00E3o. Permite uma queda para usar outros mecanismos de autentica\u00E7\u00E3o (como formul\u00E1rio de login) quando o certificado do cliente for rejeitado pelo dom\u00EDnio de seguran\u00E7a. Tem efeito somente quando o dom\u00EDnio de seguran\u00E7a estiver configurado.
elytron.server-ssl-context.use-cipher-suites-order=Para honrar a prefer\u00EAncia dos pacotes de criptografia locais.
elytron.server-ssl-context.maximum-session-cache-size=O n\u00FAmero m\u00E1ximo de sess\u00F5es SSL no cache. O valor padr\u00E3o -1 significa que o valor padr\u00E3o JVM \u00E9 usado. O valor zero significa que n\u00E3o h\u00E1 limite.
elytron.server-ssl-context.session-timeout=O tempo limite de sess\u00F5es SSL em segundos. O valor padr\u00E3o -1 significa que o valor padr\u00E3o JVM \u00E9 usado. O valor zero significa que n\u00E3o h\u00E1 limite.
elytron.server-ssl-context.wrap=As inst\u00E2ncias SSLEngine, SSLSocket e SSLServerSocket retornadas devem ser encapsuladas para proteger contra novas modifica\u00E7\u00F5es?
elytron.server-ssl-context.key-manager=Refer\u00EAncia ao gerenciador de chaves a ser usado no SSLContext.
elytron.server-ssl-context.key-refresh=Atualizar o KeyManager usado pelo SSLContext.
elytron.server-ssl-context.trust-manager=Refer\u00EAncia ao gerenciador de confian\u00E7a a ser usado no SSLContext.
elytron.server-ssl-context.pre-realm-principal-transformer=Um transformador principal a ser aplicado antes de selecionar o realm.
elytron.server-ssl-context.post-realm-principal-transformer=Um transformador principal a ser aplicado depois de selecionar o realm.
elytron.server-ssl-context.final-principal-transformer=Um transformador principal final a ser aplicado para este realm do mecanismo.
elytron.server-ssl-context.realm-mapper=O mapeador do realm a ser usado pela autentica\u00E7\u00E3o SSL.
elytron.server-ssl-context.provider-name=O nome do provedor a ser usado. Se n\u00E3o for especificado, todos os provedores ser\u00E3o passados para o SSLContext.
elytron.server-ssl-context.providers=O nome dos provedores para obter o Provedor[] a ser usado para carregar o SSLContext.
elytron.server-ssl-context.active-session-count=A contagem de sess\u00F5es ativas atuais.
elytron.server-ssl-context.ssl-session=Uma sess\u00E3o SSL estabelecida atualmente.
elytron.server-ssl-context.ssl-session.application-buffer-size=O tamanho do buffer do aplicativo, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.cipher-suite=O pacote de criptografia selecionado, conforme relato pela SSLSession.
elytron.server-ssl-context.ssl-session.creation-time=O tempo de cria\u00E7\u00E3o, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.last-accessed-time=A hora do \u00FAltimo acesso, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.local-principal=O principal do local, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.packet-buffer-size=O tamanho do buffer no pacote, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.peer-host=O host do par, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.peer-port=A porta do par, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.peer-principal=O principal do par, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.protocol=O protocolo, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.valid=A validade da sess\u00E3o, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.local-certificates=Os certificados do local, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.local-certificates.type=O tipo do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.algorithm=O algoritmo da chave p\u00FAblica.
elytron.server-ssl-context.ssl-session.local-certificates.format=O formato da chave p\u00FAblica.
elytron.server-ssl-context.ssl-session.local-certificates.public-key=A chave p\u00FAblica codificada associada ao certificado.
elytron.server-ssl-context.ssl-session.local-certificates.sha-1-digest=O resumo SHA-1 (impress\u00E3o digital) do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.sha-256-digest=O resumo SHA-256 (impress\u00E3o digital) do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.encoded=O valor codificado do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.subject=A entidade do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.issuer=O emissor do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.not-before=A data e o hor\u00E1rio iniciais em que o certificado \u00E9 v\u00E1lido.
elytron.server-ssl-context.ssl-session.local-certificates.not-after=A data e hora de expira\u00E7\u00E3o do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.serial-number=O n\u00FAmero de s\u00E9rie do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.signature-algorithm=O algoritmo usado para gerar a assinatura dos certificados.
elytron.server-ssl-context.ssl-session.local-certificates.signature=A assinatura do certificado.
elytron.server-ssl-context.ssl-session.local-certificates.version=A vers\u00E3o do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates=Os certificados do par, conforme relatado pela SSLSession.
elytron.server-ssl-context.ssl-session.peer-certificates.type=O tipo do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.algorithm=O algoritmo da chave p\u00FAblica.
elytron.server-ssl-context.ssl-session.peer-certificates.format=O formato da chave p\u00FAblica.
elytron.server-ssl-context.ssl-session.peer-certificates.public-key=A chave p\u00FAblica codificada associada ao certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.sha-1-digest=O resumo SHA-1 (impress\u00E3o digital) do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.sha-256-digest=O resumo SHA-256 (impress\u00E3o digital) do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.encoded=O valor codificado do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.subject=A entidade do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.issuer=O emissor do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.not-before=A data e o hor\u00E1rio iniciais em que o certificado \u00E9 v\u00E1lido.
elytron.server-ssl-context.ssl-session.peer-certificates.not-after=A data e hora de expira\u00E7\u00E3o do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.serial-number=O n\u00FAmero de s\u00E9rie do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.signature-algorithm=O algoritmo usado para gerar a assinatura dos certificados.
elytron.server-ssl-context.ssl-session.peer-certificates.signature=A assinatura do certificado.
elytron.server-ssl-context.ssl-session.peer-certificates.version=A vers\u00E3o do certificado.
elytron.server-ssl-context.ssl-session.invalidate=Invalidar a SSLSession (observa\u00E7\u00E3o\: isso n\u00E3o encerra as conex\u00F5es atuais, apenas impede que conex\u00F5es futuras se juntem ou retomem esta sess\u00E3o).
elytron.credential-store=Reposit\u00F3rio de credenciais para manter o alias para informa\u00E7\u00F5es confidenciais, como senhas para servi\u00E7os externos.
elytron.credential-store.name=Nome do reposit\u00F3rio de credenciais.
elytron.credential-store.type=O tipo de reposit\u00F3rio de credenciais, por exemplo, KeyStoreCredentialStore.
elytron.credential-store.credential-reference=Refer\u00EAncia de credencial a ser usada para criar um par\u00E2metro de prote\u00E7\u00E3o.
elytron.credential-store.credential-reference.store=O nome do reposit\u00F3rio de credenciais contendo o alias da credencial.
elytron.credential-store.credential-reference.alias=O alias que denota credencial ou segredo armazenado no reposit\u00F3rio.
elytron.credential-store.credential-reference.type=O tipo de credencial que esta refer\u00EAncia est\u00E1 denotando.
elytron.credential-store.credential-reference.clear-text=O segredo especificado usando texto n\u00E3o criptografado. Verifique como o reposit\u00F3rio de credenciais fornece credenciais/segredos aos servi\u00E7os.
elytron.credential-store.loaded-provider=Informa\u00E7\u00F5es sobre o provedor que carregou a implementa\u00E7\u00E3o deste tipo de reposit\u00F3rio de credenciais.
elytron.credential-store.loaded-provider.name=O nome do carregador do provedor.
elytron.credential-store.loaded-provider.info=A cadeia de caracteres de informa\u00E7\u00F5es sobre o carregador do provedor.
elytron.credential-store.loaded-provider.version=A vers\u00E3o do provedor usado para carregar o reposit\u00F3rio de credenciais.
elytron.credential-store.providers=O nome dos provedores definidos no subsistema para obter os Provedores a fim de buscar um que possa criar o tipo de CredencialStore necess\u00E1rio. Se isso n\u00E3o for especificado, ent\u00E3o a lista global de provedores ser\u00E1 usada.
elytron.credential-store.other-providers=O nome dos provedores definidos no subsistema para obter os Provedores a fim de buscar um que possa criar os objetos JCA necess\u00E1rios no reposit\u00F3rio de credenciais. Isso \u00E9 v\u00E1lido somente para CredentialStore com base em reposit\u00F3rio de chaves. Se isso n\u00E3o for especificado, ent\u00E3o a lista global de provedores ser\u00E1 usada.
elytron.credential-store.provider-name=O nome do provedor a ser usado para instanciar o CredentialStoreSpi. Se o provedor n\u00E3o for especificado, o primeiro provedor encontrado capaz de criar uma inst\u00E2ncia do "tipo" especificado ser\u00E1 usado.
elytron.credential-store.implementation-properties=Mapa das propriedades espec\u00EDficas da implementa\u00E7\u00E3o do reposit\u00F3rio de credenciais.
elytron.credential-store.location=Nome do armazenamento do reposit\u00F3rio de credenciais.
elytron.credential-store.modifiable=Especifica se o reposit\u00F3rio de credenciais \u00E9 modific\u00E1vel.
elytron.credential-store.create=Especifica se o reposit\u00F3rio de credenciais deve criar um armazenamento quando este n\u00E3o existe.
elytron.credential-store.relative-to=Uma refer\u00EAncia a um caminho previamente definido ao qual o nome do arquivo est\u00E1 relacionado.
elytron.credential-store.add=Adicionar outro reposit\u00F3rio de credenciais \u00E0 configura\u00E7\u00E3o.
elytron.credential-store.remove=Remover o reposit\u00F3rio de credenciais da configura\u00E7\u00E3o.
elytron.credential-store.reload=Recarregar o reposit\u00F3rio de credenciais (reinicializa e carrega novos dados, se estiverem presentes).
elytron.credential-store.state=O estado do servi\u00E7o subjacente que representa este reposit\u00F3rio de credenciais no tempo de execu\u00E7\u00E3o.
elytron.credential-store.read-aliases=Ler aliases (entradas) de um reposit\u00F3rio de credenciais.
elytron.credential-store.add-alias=Adicionar um alias ao reposit\u00F3rio de credenciais.
elytron.credential-store.add-alias.alias=O alias do item do reposit\u00F3rio de credenciais a ser adicionado.
elytron.credential-store.add-alias.entry-type=Tipo de uma credencial (entrada) armazenada no reposit\u00F3rio de credenciais.
elytron.credential-store.add-alias.secret-value=Valor secreto, como uma senha.
elytron.credential-store.remove-alias=Remover uma credencial (entrada) armazenada no reposit\u00F3rio de credenciais.
elytron.credential-store.remove-alias.alias=O alias do item do reposit\u00F3rio de credenciais a ser removido.
elytron.credential-store.set-secret=Definir o valor secreto de uma credencial (entrada) armazenada no reposit\u00F3rio de credenciais.
elytron.credential-store.set-secret.alias=O alias do item do reposit\u00F3rio de credenciais a ser configurado.
elytron.credential-store.set-secret.entry-type=Tipo de uma credencial (entrada) armazenada no reposit\u00F3rio de credenciais.
elytron.credential-store.set-secret.secret-value=Valor secreto, como uma senha.
elytron.dir-context=A configura\u00E7\u00E3o para conectar a um servidor de diret\u00F3rio (LDAP).
elytron.dir-context.add=Adicionar a defini\u00E7\u00E3o do DirContext.
elytron.dir-context.remove=Remover a defini\u00E7\u00E3o do DirContext.
elytron.dir-context.url=O URL de conex\u00E3o.
elytron.dir-context.authentication-level=O n\u00EDvel de autentica\u00E7\u00E3o (n\u00EDvel de seguran\u00E7a/mecanismo de autentica\u00E7\u00E3o) a ser usado. Corresponde \u00E0 propriedade de ambiente SECURITY_AUTHENTICATION ("java.naming.security.authentication"). Valores permitidos\: "none", "simple", sasl_mech, onde sasl_mech \u00E9 uma lista separada por espa\u00E7os dos nomes de mecanismo SASL.
elytron.dir-context.authentication-context=O contexto de autentica\u00E7\u00E3o para obter credenciais de login a fim de se conectar ao servidor LDAP. Pode ser omitido se o n\u00EDvel de autentica\u00E7\u00E3o for "nenhum" (an\u00F4nimo).
elytron.dir-context.principal=O principal a ser autenticado e conectado ao servidor LDAP. Pode ser omitido se o n\u00EDvel de autentica\u00E7\u00E3o for "nenhum" (an\u00F4nimo).
elytron.dir-context.credential-reference=A refer\u00EAncia de credencial para autenticar e se conectar ao servidor LDAP. Pode ser omitida se o n\u00EDvel de autentica\u00E7\u00E3o for "nenhum" (an\u00F4nimo).
elytron.dir-context.credential-reference.store=O nome do reposit\u00F3rio de credenciais contendo o alias da credencial.
elytron.dir-context.credential-reference.alias=O alias que denota credencial ou segredo armazenado no reposit\u00F3rio.
elytron.dir-context.credential-reference.type=O tipo de credencial que esta refer\u00EAncia est\u00E1 denotando.
elytron.dir-context.credential-reference.clear-text=O segredo especificado usando texto n\u00E3o criptografado. Verifique como o reposit\u00F3rio de credenciais fornece credenciais/segredos aos servi\u00E7os.
elytron.dir-context.enable-connection-pooling=Indica se o pool de conex\u00F5es est\u00E1 ativado.
elytron.dir-context.module=Nome do m\u00F3dulo que ser\u00E1 usado como base do carregamento da classe.
elytron.dir-context.referral-mode=Se as refer\u00EAncias devem ser seguidas.
elytron.dir-context.ssl-context=O nome do ssl-context usado para proteger a conex\u00E3o do servidor LDAP.
elytron.dir-context.connection-timeout=O tempo limite para se conectar ao servidor LDAP em milissegundos.
elytron.dir-context.read-timeout=O tempo limite de leitura para uma opera\u00E7\u00E3o LDAP em milissegundos.
elytron.dir-context.properties=As propriedades de conex\u00E3o adicionais para o DirContext.
elytron.policy=Uma defini\u00E7\u00E3o que instala um provedor de pol\u00EDticas.
elytron.policy.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para acrescentar um provedor de pol\u00EDticas.
elytron.policy.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para eliminar um provedor de pol\u00EDticas.
elytron.policy.default-policy=O nome de um provedor de pol\u00EDticas padr\u00E3o.
elytron.policy.jacc-policy=Uma defini\u00E7\u00E3o de provedor de pol\u00EDticas que configura JACC e servi\u00E7os relacionados.
elytron.policy.jacc-policy.name=O nome deste provedor.
elytron.policy.jacc-policy.policy=O nome de uma implementa\u00E7\u00E3o java.security.Policy que faz refer\u00EAncia a um provedor de pol\u00EDticas.
elytron.policy.jacc-policy.configuration-factory=O nome de uma implementa\u00E7\u00E3o javax.security.jacc.PolicyConfigurationFactory que faz refer\u00EAncia a um provedor de f\u00E1brica de configura\u00E7\u00E3o de pol\u00EDticas.
elytron.policy.jacc-policy.module=O nome do m\u00F3dulo para carregar o provedor.
elytron.policy.custom-policy=Uma defini\u00E7\u00E3o personalizada do provedor de pol\u00EDticas.
elytron.policy.custom-policy.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o para acrescentar um provedor personalizado.
elytron.policy.custom-policy.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o para eliminar um provedor personalizado.
elytron.policy.custom-policy.name=O nome deste provedor
elytron.policy.custom-policy.class-name=O nome de uma implementa\u00E7\u00E3o java.security.Policy que faz refer\u00EAncia a um provedor de pol\u00EDticas.
elytron.policy.custom-policy.module=O nome do m\u00F3dulo para carregar o provedor.
