# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host=O n\u00F3 root do modelo de gerenciamento host-level.
host.host=Um host
host.host-state=O estado atual do processo de host.
host.runtime-configuration-state=O estado de configura\u00E7\u00E3o persistente atual; starting, ok, reload-required, restart-required, stopping or stopped.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.name=O nome para uso deste controlador de host. Isto deve ser \u00FAnico no domain. Caso n\u00E3o tenha sido determinado, o default ser\u00E1 o valor do per\u00EDodo de rodagem do InetAddress.getLocalHost().getHostName().
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.release-version=A vers\u00E3o de lan\u00E7amento do WildFly Core na qual este controlador de host est\u00E1 executando.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.release-codename=O nome de c\u00F3digo do lan\u00E7amento do WildFly Core que este controlador de host est\u00E1 executando. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.product-name=O nome do produto baseado em WildFly Core que est\u00E1 sendo executado por este controlador de host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.product-version=A vers\u00E3o de lan\u00E7amento do produto baseado em  WildFly Core est\u00E1 sendo executada por este  controlador de host. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.management-major-version=A vers\u00E3o principal da interface do gerenciamento de kernel WildFly Core que \u00E9 provida por este controlador de host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.management-minor-version=A vers\u00E3o de manuten\u00E7\u00E3o da interface de gerenciamento de kernel WildFly Core  que \u00E9 provida por esse controlador de  host.
host.management-micro-version=A vers\u00E3o micro da interface de gerenciamento de kernel WildFly Core que \u00E9 provida por este controlador de host.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.running-mode=O modo de rodagem atual do Controlador do Host. Tanto NORMAL (opera\u00E7\u00F5es normais) ou ADMIN_ONLY. O servidor ADMIN_ONLY iniciar\u00E1 quaisquer interfaces de gerenciamento e aceitar\u00E1 solicita\u00E7\u00F5es de gerenciamento, mas n\u00E3o iniciar\u00E1 servidores. Caso esse controlador de host for o mestre para o domain, isto aceitar\u00E1 conex\u00F5es de entrada dos controladores do host slave.
host.suspend-state=O estado suspenso  do host
host.uuid=A ID exclusiva da inst\u00E2ncia deste servidor. 
host.organization=Identifica\u00E7\u00E3o da atual organiza\u00E7\u00E3o que este controlador de host faz parte. 
host.domain-organization=Identifica\u00E7\u00E3o da atual organiza\u00E7\u00E3o que o domain deste host faz parte. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.management=A configura\u00E7\u00E3o do sistema de gerenciamento do host.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.management.interface=A interface pela qual o socket do host para a comunica\u00E7\u00E3o do gerenciamento deve ser aberta.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.directory-grouping=Descreve como os diret\u00F3rios de grava\u00E7\u00E3o para servidores gerenci\u00E1veis por este controlador do host devem ser organizados. O valor default, 'por servidor', indica cada  um dos diret\u00F3rios de grava\u00E7\u00E3o do servidor deve ser agrupado sob o nome do servidor no diret\u00F3rio domain/servers. Outra op\u00E7\u00E3o, 'por-tipo' indica que cada um dos diret\u00F3rios de grava\u00E7\u00E3o do servidor deve ser agrupado baseando-se no pr\u00F3prio "tipo" (ex.\: "dados", "regostro em log", "tmp") com diret\u00F3rios de um tipo gerado para todos os servidores no diret\u00F3rio do n\u00EDvel do domain para aquele tipo, ex.\: domain/data/servers/server-name.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.management.port=A porta pela qual o socket do host para comunica\u00E7\u00E3o do gerenciamento intra-domain deve ser aberta.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.domain-controller=A configura\u00E7\u00E3o de como o host deve interagir com o Domain Controller
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.domain-controller.local=Configura o Domain Controller local
host.write-local-domain-controller=Configura o host para agir como o Domain Controller
host.write-local-domain-controller.deprecated=Use o write-attribute simple para editar o controlador de dom\u00EDnio. 
host.remove-local-domain-controller=Remove o controlador do domain local
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.domain-controller.remote=Configura\u00E7\u00E3o da conex\u00E3o do Domain Controller Remoto
host.write-remote-domain-controller=Adiciona a configura\u00E7\u00E3o da conex\u00E3o do Controlador de Domain
host.write-remote-domain-controller.deprecated=Use o write-attribute simple para editar o controlador de dom\u00EDnio. 
host.write-remote-domain-controller.host=O endere\u00E7o usado para a conex\u00E3o do Controlador de Domain
host.write-remote-domain-controller.ignore-unused-configuration=Defina para verdadeiro para instruir o controlador do Host mestre para n\u00E3o encaminhar automaticamente configura\u00E7\u00E3o e opera\u00E7\u00F5es para perfis, grupos de vincula\u00E7\u00E3o de soquete e grupos de servidores que n\u00E3o afetam nossos servidores. Se indefinido, o comportamento padr\u00E3o \u00E9 'verdadeiro' a n\u00E3o ser que o processo esteja sido iniciado com o uso do par\u00E2metro de linha de comando  '--backup', neste caso o comportamento padr\u00E3o \u00E9 'falso'. 
host.write-remote-domain-controller.port=A porta usada para a conex\u00E3o do Controlador de Domain
host.write-remote-domain-controller.protocol=O protocolo usado para a conex\u00E3o do Domain Controller
host.write-remote-domain-controller.authentication-context=O contexto de autentica\u00E7\u00E3o a ser usado para a configura\u00E7\u00E3o de seguran\u00E7a de sa\u00EDda
host.write-remote-domain-controller.username=O username para uso deste host quando ele autenticar o Domain Controller mestre. Caso seja indefinido, o nome do host ser\u00E1 usado. A configura\u00E7\u00E3o deste atributo possibilita evitar a configura\u00E7\u00E3o de credenciais separados para cada host num domain.
host.write-remote-domain-controller.username.deprecated=Em vez disso, um authentication-context dever\u00E1 ser referenciado.
host.write-remote-domain-controller.security-realm=Nome do dom\u00EDnio de seguran\u00E7a legado a partir do qual as credenciais do host para autentica\u00E7\u00E3o com o controlador de dom\u00EDnio principal devem ser obtidas.
host.write-remote-domain-controller.security-realm.deprecated=Em vez disso, um authentication-context dever\u00E1 ser referenciado.
host.write-remote-domain-controller.admin-only-policy=O nome do controle da pol\u00EDtica como um o controlador do host escravo iniciou no modo 'admin-only', e sem o uso da op\u00E7\u00E3o de inicializa\u00E7\u00E3o '--cached-dc', deve manejar a aus\u00EAncia de uma c\u00F3pia local da configura\u00E7\u00E3o do domain. 
host.remove-remote-domain-controller=Remove a configura\u00E7\u00E3o da conex\u00E3o do Domain Controller remoto
host.domain-controller.host=O endere\u00E7o usado para a conex\u00E3o do Domain Controller
host.domain-controller.ignore-unused-configuration=Defina para verdadeiro para instruir o controlador do Host mestre para n\u00E3o encaminhar automaticamente configura\u00E7\u00E3o e opera\u00E7\u00F5es para perfis, grupos de vincula\u00E7\u00E3o de soquete e grupos de servidores que n\u00E3o afetam nossos servidores. Se indefinido, o comportamento padr\u00E3o \u00E9 'verdadeiro' a n\u00E3o ser que o processo esteja sido iniciado com o uso do par\u00E2metro de linha de comando  '--backup', neste caso o comportamento padr\u00E3o \u00E9 'falso'. 
host.domain-controller.port=A porta usada para a conex\u00E3o do Domain Controller
host.domain-controller.protocol=O protocolo usado para a conex\u00E3o do Domain Controller
host.domain-controller.authentication-context=O contexto de autentica\u00E7\u00E3o a ser usado para a configura\u00E7\u00E3o de seguran\u00E7a de sa\u00EDda
host.domain-controller.username=O username para uso deste host quando ele autenticar o Domain Controller mestre. Caso seja indefinido, o nome do host ser\u00E1 usado. A configura\u00E7\u00E3o deste atributo possibilita evitar a configura\u00E7\u00E3o de credenciais separados para cada host num domain.
host.domain-controller.username.deprecated=Em vez disso, um authentication-context dever\u00E1 ser referenciado.
host.domain-controller.security-realm=Nome do dom\u00EDnio de seguran\u00E7a legado a partir do qual as credenciais do host para autentica\u00E7\u00E3o com o controlador de dom\u00EDnio principal devem ser obtidas.
host.domain-controller.security-realm.deprecated=Em vez disso, um authentication-context dever\u00E1 ser referenciado.
host.domain-controller.admin-only-policy=O nome do controle da pol\u00EDtica como um controlador do host escravo iniciou no modo 'admin-only', e sem o uso da op\u00E7\u00E3o de inicia\u00E7\u00E3o '--cached-dc', deve manejar a aus\u00EAncia de uma c\u00F3pia local da configura\u00E7\u00E3o do domain. 
host.domain-controller.remove=Remove a configura\u00E7\u00E3o da conex\u00E3o do Controlador do domain remoto
host.namespaces=O mapa do namespace usado no documento de configura\u00E7\u00E3o, onde as teclas s\u00E3o prefixos de namespace e valores s\u00E3o URIs de esquema.
host.schema-locations=O mapa das localiza\u00E7\u00F5es dos esquemas XML usado no documento XML da configura\u00E7\u00E3o, onde as teclas s\u00E3o URIs de esquema e valores s\u00E3o localiza\u00E7\u00F5es onde o esquema pode ser encontrado.
host.server-state=Estado do processo
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.extension=A lista de m\u00F3dulos de extens\u00E3o.
host.subsystem=Subsistemas para serem executados no host. Subsistemas definidos diretamente em um host devem\: a) permitirem a instala\u00E7\u00E3o em um host b) serem inicializados por um m\u00F3dulo de extens\u00E3o no host. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.path=A lista de caminhos de filesystem nomeados.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.interface=A lista das interface de rede nomeadas inteiramente especificadas, dispon\u00EDveis para uso no host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.jvm=A lista das configura\u00E7\u00F5es da M\u00E1quina Virtual Java que pode ser aplicada nos servidores do host. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.system-properties=A lista das propriedades de sistema para configurar em todos os servidores no host.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.core-services=Os servi\u00E7os core fornecidos pelo controlador do host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.system-property=A propriedade de sistema para configurar em todos os servidores no host.
host.core-service=Os servi\u00E7os core fornecidos pelo controlador do host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.server-config=As configura\u00E7\u00F5es host-level para os servidores que podem rodar no host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.server=Os servidores rodando no host.
host.socket-binding-group=O grupo de associa\u00E7\u00E3o de soquete atualmente configurado para utiliza\u00E7\u00E3o no controlador de host. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.shutdown=Encerra o host e seus servidores
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.shutdown.restart=Caso verdadeiro, uma vez encerrado o controlador de host ser\u00E1 reiniciado novamente
host.server.start=Inicia o servidor.
host.server.start.server=O nome do servidor.
host.server.start.server.deprecated=O par\u00E2metro \u00E9 ignorado. Ao inv\u00E9s disto, o nome vem do valor do \u00FAltimo elemento do endere\u00E7o 
host.server.start.blocking=Se \u00E9 que a opera\u00E7\u00E3o deve bloquear e esperar at\u00E9 que o servidor seja inicializado.
host.server.start.start-mode=O modo no qual os servidores dever\u00E3o ser iniciados. Pode ser suspenso ou normal.
host.server.start.reply=O status do servidor seguindo a execu\u00E7\u00E3o dessa opera\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.state=O estado atual do controlador do host; tanto STARTING, RUNNING ou RESTART_REQUIRED
host.server.restart=Reinicia o servidor rodando no momento.
host.server.restart.server=O nome do servidor.
host.server.restart.server.deprecated=O par\u00E2metro \u00E9 ignorado. Ao inv\u00E9s disto, o nome vem do valor do \u00FAltimo elemento do endere\u00E7o 
host.server.restart.blocking=Se \u00E9 que a opera\u00E7\u00E3o deve bloquear e esperar at\u00E9 que o servidor seja reiniciado.
host.server.restart.reply=O status do servidor seguindo a execu\u00E7\u00E3o dessa opera\u00E7\u00E3o.
host.server.restart.start-mode=O modo no qual os servidores dever\u00E3o ser reiniciados. Pode ser suspenso ou normal.
host.server.reload=Recarregar um servidor sendo executado no momento.
host.server.reload.server=O nome do servidor.
host.server.reload.server.deprecated=O par\u00E2metro \u00E9 ignorado. Ao inv\u00E9s disto, o nome vem do valor do \u00FAltimo elemento do endere\u00E7o 
host.server.reload.blocking=Se a opera\u00E7\u00E3o deve bloquear e aguardar at\u00E9 que o servidor seja recarregado. 
host.server.reload.reply=O status do servidor seguindo a execu\u00E7\u00E3o dessa opera\u00E7\u00E3o.
host.server.reload.start-mode=O modo no qual os servidores dever\u00E3o ser recarregados. Pode ser suspenso ou normal.
host.server.stop=Encerra o servidor rodando no momento.
host.server.stop.server=O nome do servidor.
host.server.stop.server.deprecated=O par\u00E2metro \u00E9 ignorado. Ao inv\u00E9s disto, o nome vem do valor do \u00FAltimo elemento do endere\u00E7o 
host.server.stop.blocking=Se \u00E9 que a opera\u00E7\u00E3o deve bloquear e esperar at\u00E9 que o servidor seja interrompido.
host.server.stop.reply=O status do servidor seguindo a execu\u00E7\u00E3o dessa opera\u00E7\u00E3o.
host.server.stop.timeout=Caso este tempo limite estiver definido, haver\u00E1 uma tentativa de encerramento autom\u00E1tico.  Se for definido para zero (o padr\u00E3o), ent\u00E3o o servidor ir\u00E1 desligar imediatamente. Um valor maior que zero significa que o servidor ir\u00E1 aguardar at\u00E9 esta quantidade de segundos para que todas as solicita\u00E7\u00F5es ativas sejam finalizadas. Um valor menor que zero significa que o servidor aguardar\u00E1  indefinidamente at\u00E9 que todas as solicita\u00E7\u00F5es ativas sejam finalizadas. 
host.server.destroy=Destr\u00F3i o processo do servidor. Caso o servidor n\u00E3o estiver no estado interrompido, ele tentar\u00E1 primeiramente interromper o servidor. 
host.server.kill=Interrompe o processo do servidor. Caso o servidor n\u00E3o estiver no estado interrompido, ele tentar\u00E1 primeiramente interromper o servidor. Esta opera\u00E7\u00E3o pode n\u00E3o funcionar em todas as plataformas e ir\u00E1 tentar destruir o processo se n\u00E3o dispon\u00EDvel. 
host.server.suspend=Suspende o servidor,  todas opera\u00E7\u00F5es atuais ser\u00E3o finalizadas e nenhuma nova opera\u00E7\u00E3o ser\u00E1 permitida. 
host.server.suspend.timeout=Tempo limite que uma opera\u00E7\u00E3o suspensa ir\u00E1 aguardar para que a opera\u00E7\u00E3o suspensa seja finalizada antes de retornar.  Se for igual a zero, a opera\u00E7\u00E3o ir\u00E1 retornar imediatamente, -1 significa que ir\u00E1 aguardar indefinidamente. Observe que a opera\u00E7\u00E3o n\u00E3o ser\u00E1 revertida caso o tempo limite for excedido, isto apenas significa que nem todas as solicita\u00E7\u00F5es atuais ser\u00E3o completadas no limite de tempo especificado. 
host.server.resume=Retoma opera\u00E7\u00F5es neste servidor. 
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.master=Se \u00E9 que esse host \u00E9 o host mestre para o domain; ex.\: se \u00E9 que esse processo est\u00E1 agindo como o Controlador do domain.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.resolve-expression-on-domain=A opera\u00E7\u00E3o que aceita uma express\u00E3o como entrada (ou uma sequ\u00EAncia que pode ser analisada numa express\u00E3o) e a resolve em refer\u00EAncia \u00E0s propriedades de sistema e var\u00E1veis de ambiente em todos os servidores gerenci\u00E1veis por esse controlador do host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.resolve-expression-on-domain.expression=A express\u00E3o a ser resolvida.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.resolve-expression-on-domain.reply=A express\u00E3o resolvida, ou o formul\u00E1rio da sequ\u00EAncia do valor de entrada original, caso ele n\u00E3o represente uma express\u00E3o. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env=O ambiente do controlador do host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.process-controller-address=O endere\u00E7o do controlador do processo esse controlador do host est\u00E1 conectado.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.process-controller-port=A porta do controlador do processo que esse controlador de host est\u00E1 conectado.
host.env.host-controller-address=O endere\u00E7o que este controlador de host utiliza para comunica\u00E7\u00E3o com o controlador de processo. N\u00E3o relacionado \u00E0 comunica\u00E7\u00E3o com clientes de gerenciamento.
host.env.host-controller-port=A porta que este controlador de host utiliza para comunica\u00E7\u00E3o com o controlador de processo. N\u00E3o relacionada \u00E0 comunica\u00E7\u00E3o com clientes de gerenciamento. 
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.home-dir=O diret\u00F3rio principal desse controlador de host.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.modules-dir=O diret\u00F3rio onde os modelos s\u00E3o encontrados.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.domain-base-dir=O diret\u00F3rio de base do dom\u00EDnio. 
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.domain-config-dir=O diret\u00F3rio de configura\u00E7\u00E3o do domain.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.host-config-file=O arquivo de configura\u00E7\u00E3o para esse host.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.domain-config-file=O arquivo de configura\u00E7\u00E3o para esse domain.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.domain-content-dir=O diret\u00F3rio onde o conte\u00FAdo do usu\u00E1rio (ex.\: implanta\u00E7\u00F5es) que \u00E9 gerenciado por esse servidor \u00E9 stored.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.domain-data-dir=O diret\u00F3rio de dados.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.domain-log-dir=O diret\u00F3rio onde os arquivos de registro de log s\u00E3o enviados.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.domain-servers-dir=O diret\u00F3rio onde esses servidores iniciados do host realizam o store  nos pr\u00F3prios dados do per\u00EDodo de execu\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.domain-temp-dir=O diret\u00F3rio tempor\u00E1rio.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.default-jvm=O jvm default.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.is-restart=Se \u00E9 que o host foi reiniciado pelo controlador do processo.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.backup-domain-files=Se \u00E9 que o controlador do host deve retornar ao conte\u00FAdo do domain a partir do domain controller mestre. Ele pode ser apenas verdadeiro nos controladores do host slave.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.use-cached-dc=Se este controlador de host deve usar o conte\u00FAdo de dom\u00EDnio em cache (conforme obtido pela inicia\u00E7\u00E3o com --backup) na inicializa\u00E7\u00E3o do host. Pode ser apenas verdadeiro nos controladores do host escravos.
host.env.initial-running-mode=O modo de execu\u00E7\u00E3o inicial do host, quando o processo do controlador de host foi lan\u00E7ado. Tanto NORMAL quanto ADMIN_ONLY.  Um servidor ADMIN_ONLY iniciar\u00E1 quaisquer interfaces de gerenciamento configuradas e aceitar\u00E1 solicita\u00E7\u00F5es de gerenciamento, no entanto, n\u00E3o iniciar\u00E1 servi\u00E7os usados para tratar de solicita\u00E7\u00F5es de usu\u00E1rio final.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.qualified-host-name=O nome do host inteiramente qualificado detectado na inicializa\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.env.host-name=O nome do host local detectado na inicializa\u00E7\u00E3o do servidor.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.reload=Recarrega o Controlador do Host pela finaliza\u00E7\u00E3o de todos os servi\u00E7os e inicializa\u00E7\u00E3o dos mesmos novamente. O pr\u00F3prio JVM n\u00E3o \u00E9 reinicializado. Perceba que isto levar\u00E1 ao processo completo de reinicializa\u00E7\u00E3o para quaisquer processos gerenciados pelo controlador do host.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.reload.admin-only=Se \u00E9 que o Controlador do Host deve iniciar a rodagem em modo ADMIN_ONLY quando for reiniciado. O Controlador do Host ADMIN_ONLY  iniciar\u00E1 quaisquer interfaces de gerenciamento e aceitar\u00E1 as solicita\u00E7\u00F5es de gerenciamento. No entanto, ele n\u00E3o iniciar\u00E1 os servidores ou, caso o esse controlador de host for o mestre para o domain, aceitar\u00E1 as conex\u00F5es de entrada dos controladores do host slave.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
host.reload.restart-servers=Caso verdadeiro os servidores ser\u00E3o recarregados e, caso falso, os servidores ser\u00E3o deixados rodando e reconectar\u00E3o ao Controlador do Host quando novamente iniciados.
host.reload.use-current-domain-config=Apenas possui efeito caso --read-only-domain-config for especificado quando iniciando o controlador. Neste caso, caso este par\u00E2metro for configurado para falso, o controlador recarregado carrega a vers\u00E3o de configura\u00E7\u00E3o original. Caso seja nulo ou verdadeiro, a vers\u00E3o atual de per\u00EDodo de rodagem do modelo ser\u00E1 usada.
host.reload.use-current-host-config=Apenas possui efeito se --read-only-host-config for especificado quando iniciando o controlador. Neste caso, caso o par\u00E2metro for configurado para falso, o controlador recarregado carrega a vers\u00E3o de configura\u00E7\u00E3o original. Caso seja nulo ou verdadeiro, a vers\u00E3o de per\u00EDodo de rodagem atual do modelo ser\u00E1 usada.
host.reload.domain-config=Utilizado para sobrescrever o nome de configura\u00E7\u00E3o do dom\u00EDnio  para o controlador de host recarregado.  Quando se faz altera\u00E7\u00F5es ao modelo ap\u00F3s o recarregamento, as altera\u00E7\u00F5es ser\u00E3o ainda persistentes ao arquivo de configura\u00E7\u00E3o do dom\u00EDnio original  que foi utilizado na primeira inicializa\u00E7\u00E3o do controlador de host.  Este par\u00E2metro \u00E9 resolvido do mesmo modo que  a op\u00E7\u00E3o da linha de comando --domain-config.
host.reload.host-config=Utilizado para sobrescrever o nome de configura\u00E7\u00E3o do host para o controlador de host recarregado.  Quando se faz altera\u00E7\u00F5es ao modelo ap\u00F3s o recarregamento, as altera\u00E7\u00F5es ser\u00E3o ainda persistentes ao arquivo de configura\u00E7\u00E3o do host original  que foi utilizado na primeira inicializa\u00E7\u00E3o do controlador de host.  Este par\u00E2metro \u00E9 resolvido do mesmo modo que  a op\u00E7\u00E3o da linha de comando --host-config.
server-config=Define um servidor no modelo do gerenciamento do host-level.
server-config.add=Adiciona uma nova configura\u00E7\u00E3o ao servidor.
server-config.remove=Remove uma configura\u00E7\u00E3o de servidor existente.
server-config.interface=A lista das interfaces de rede nomeadas e inteiramente especificadas dispon\u00EDveis para uso no servidor.
server-config.jvm=A configura\u00E7\u00E3o da m\u00E1quina virtual Java (jvm) para ser utilizada por este servidor. 
server-config.name=O nome do servidor.
server-config.group=O nome de um grupo no servidor a partir do modelo do domain.
server-config.path=A lista de caminhos de filesystem nomeados.
server-config.priority=Preterido. N\u00E3o usado.
server-config.priority.deprecated=N\u00E3o usado.
server-config.cpu-affinity=Preterido. N\u00E3o usado.
server-config.cpu-affinity.deprecated=N\u00E3o usado.
server-config.socket-binding-group=O grupo socket binding pelo qual este servidor pertence.
server-config.socket-binding-default-interface=A interface padr\u00E3o de grupo para associar soquete neste servidor. 
server-config.socket-binding-port-offset=O deslocamento a ser adicionado aos valores da porta gerados pelo grupo socket binding para esse servidor.
server-config.auto-start=Se \u00E9 que esse servidor deve ser iniciado quando o Controlador do Host for iniciado. 
server-config.status=O status atual do servidor.
server-config.system-property=A lista de propriedades do sistema a ser configurada nesse servidor.
server-config.update-auto-start-with-server-status=Atualizar atributo auto-start com o status do servidor. 
server-config.ssl=Configura\u00E7\u00E3o SSL para quando a inst\u00E2ncia do servidor est\u00E1 reconectando ao seu controlador de host. 
server-config.ssl.loopback=Configura\u00E7\u00E3o SSL para quando a inst\u00E2ncia do servidor est\u00E1 reconectando ao seu controlador de host. 
server-config.ssl.loopback.add=Adiciona a configura\u00E7\u00E3o SSL para o servidor. 
server-config.ssl.loopback.remove=Remove a configura\u00E7\u00E3o SSL do servidor. 
server-config.ssl.loopback.ssl-protocol=O protocolo usado para inicializar o SSL Context, se for especificado 'Default', o padr\u00E3o SSL Context do JVM ser\u00E1 utilizado. 
server-config.ssl.loopback.trust-manager-algorithm=O algoritmo para inicializar o TrustManagerFactory usado para obter o TrustManager[] passou para o SSL Context, se n\u00E3o especificado, o padr\u00E3o JVM ser\u00E1 utilizado como alternativa. 
server-config.ssl.loopback.truststore-type=O tipo de armazenamento de confian\u00E7a
server-config.ssl.loopback.truststore-path=O caminho totalmente qualificado para o armazenamento de confian\u00E7a. 
server-config.ssl.loopback.truststore-password=A senha para abrir o armazenamento de confian\u00E7a. 
server=A inst\u00E2ncia do servidor gerenciada. 
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-server/org/jboss/as/server/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
server.launch-type=A maneira pela qual o processo do servidor foi iniciado. Tanto o "DOMAIN" para um servidor do modo de domain pelo Host Controller, "STANDALONE" para o servidor aut\u00F4nomo iniciado na linha de comando, ou "EMBEDDED" para o servidor aut\u00F4nomo iniciado na linha de comando como parte incorporada de um aplicativo rodando na mesma m\u00E1quina virtual.
server.server-state=O estado atual do controlador de servidor. 
server.runtime-configuration-state=O estado atual da configura\u00E7\u00E3o persistente do servidor; starting, ok, reload-required, restart-required, stopping ou stopped.
host.core.management.native-interface=Configura\u00E7\u00E3o da interface de gerenciamento nativo do servidor
host.core.management.native-interface.deprecated=A configura\u00E7\u00E3o native-interface est\u00E1 preterida e pode ser removida ou movida em vers\u00F5es futuras.
host.core.management.native-interface.add=Adiciona a interface de gerenciamento nativo do servidor.
host.core.management.native-interface.remove=Remove a interface do gerenciamento nativo do servidor
host.core.management.native-interface.interface=A interface da rede pela qual o socket do controlador do host para a comunica\u00E7\u00E3o do gerenciamento nativo deve ser operado.
host.core.management.native-interface.port=A porta pela qual o socket do controlador do host para a comunica\u00E7\u00E3o do gerenciamento nativo deve ser operado.
host.core.management.native-interface.ssl-context=Refer\u00EAncia ao SSLContext a ser usada para esta interface de gerenciamento.
host.core.management.native-interface.security-realm=O dom\u00EDnio de seguran\u00E7a legado a ser usado para a interface de gerenciamento nativa.
host.core.management.native-interface.security-realm.deprecated=A configura\u00E7\u00E3o deve migrar para referenciar as capacidades 'sasl-authentication-factory' e 'ssl-context', conforme requerido.
host.core.management.native-interface.sasl-authentication-factory=A pol\u00EDtica de autentica\u00E7\u00E3o SASL  para usar para proteger essa interface.
host.core.management.native-interface.sasl-protocol=O nome do protocolo a ser passado aos mecanismos SASL usados para a autentica\u00E7\u00E3o.
host.core.management.native-interface.sasl-protocol.deprecated=Apenas para utiliza\u00E7\u00E3o com os dom\u00EDnios de seguran\u00E7a herdados.
host.core.management.native-interface.server-name=O nome do servidor usando na troca Remota inicial e com os mecanismos SASL.
host.core.management.native-interface.server-name.deprecated=Apenas para utiliza\u00E7\u00E3o com os dom\u00EDnios de seguran\u00E7a herdados.
host.core.management.http-interface=Configura\u00E7\u00E3o da interface do gerenciamento HTTP do servidor
host.core.management.http-interface.deprecated=A configura\u00E7\u00E3o http-interface est\u00E1 preterida e pode ser removida ou movida em vers\u00F5es futuras.
host.core.management.http-interface.add=Adiciona a configura\u00E7\u00E3o da interface do gerenciamento HTTP do servidor
host.core.management.http-interface.allowed-origins=Lista separada por v\u00EDrgulas de origens confi\u00E1veis para enviar solicita\u00E7\u00F5es de compartilhamento de recursos de v\u00E1rias origens na API de gerenciamento uma vez que o usu\u00E1rio \u00E9 autenticado. 
host.core.management.http-interface.remove=Adiciona a configura\u00E7\u00E3o da interface do gerenciamento HTTP do servidor
host.core.management.http-interface.interface=A interface da rede pela qual o socket do controlador do host para a comunica\u00E7\u00E3o do gerenciamento HTTP deve ser operado.
host.core.management.http-interface.port=A porta pela qual o socket do controlador do host para a comunica\u00E7\u00E3o do gerenciamento HTTP deve ser operado.
host.core.management.http-interface.secure-interface=A interface de rede na qual o soquete do host para a comunica\u00E7\u00E3o de gerenciamento HTTPS deve ser aberto se uma interface diferente deve ser usada da especificada pelo atributo 'interface'. Se n\u00E3o for especificado, a interface especificada pelo atributo 'interface' ser\u00E1 usada. Se especificado com um valor diferente do atributo 'interface', o redirecionamento de solicita\u00E7\u00F5es HTTPS recebidas no soquete HTTP para o endere\u00E7o HTTPS n\u00E3o ser\u00E1 suportado. Quando definido, pelo menos um dos ssl-context ssl ou security-realm tamb\u00E9m deve ser definido
host.core.management.http-interface.secure-port=A porta na qual o soquete do controlador host para comunica\u00E7\u00E3o de gerenciamento HTTPS deve ser aberto. Quando definido, pelo menos um dos ssl-context ou security-realm tamb\u00E9m deve ser definido.
host.core.management.http-interface.http-authentication-factory=A pol\u00EDtica de autentica\u00E7\u00E3o a ser usada para proteger a interface para solicita\u00E7\u00F5es HTTP normais.
host.core.management.http-interface.ssl-context=Refer\u00EAncia ao SSLContext a ser usada para esta interface de gerenciamento.
host.core.management.http-interface.security-realm=O dom\u00EDnio de seguran\u00E7a legado a ser usado para a interface de gerenciamento HTTP.
host.core.management.http-interface.security-realm.deprecated=A configura\u00E7\u00E3o deve migrar para referenciar as capacidades  'http-authentication-factory', 'sasl-authentication-factory' e 'ssl-context', conforme requerido. 
host.core.management.http-interface.console-enabled=O aviso indicando que o consolo admin est\u00E1 ativado
host.core.management.http-interface.http-upgrade-enabled=O aviso que indica que a atualiza\u00E7\u00E3o de HTTP est\u00E1 ativa, permitindo que solicita\u00E7\u00F5es HTTP  sejam atualizadas para conex\u00F5es remotas nativas. 
host.core.management.http-interface.http-upgrade-enabled.deprecated=Em seu lugar, use http-upgrade.enabled
host.core.management.http-interface.http-upgrade=Configura\u00E7\u00E3o espec\u00EDfica de atualiza\u00E7\u00E3o HTTP 
host.core.management.http-interface.http-upgrade.enabled=Sinalizador que indica que a atualiza\u00E7\u00E3o HTTP est\u00E1 habilitada, que permite que solicita\u00E7\u00F5es HTTP sejam promovidas para conex\u00F5es remotas nativas
host.core.management.http-interface.http-upgrade.sasl-authentication-factory=A pol\u00EDtica de autentica\u00E7\u00E3o SASL do lado do servidor a ser utilizada para proteger a interface onde a conex\u00E3o \u00E9 ap\u00F3s uma atualiza\u00E7\u00E3o HTTP.
host.core.management.http-interface.sasl-protocol=O nome do protocolo a ser passado aos mecanismos SASL usados para a autentica\u00E7\u00E3o.
host.core.management.http-interface.sasl-protocol.deprecated=Apenas para utiliza\u00E7\u00E3o com os dom\u00EDnios de seguran\u00E7a herdados.
host.core.management.http-interface.server-name=O nome do servidor usando na troca Remota inicial e com os mecanismos SASL.
host.core.management.http-interface.server-name.deprecated=Apenas para utiliza\u00E7\u00E3o com os dom\u00EDnios de seguran\u00E7a herdados.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
ignored-resources=Nomes dos recursos filho diretos das solicita\u00E7\u00F5es do recurso de domain root pela qual esse Controlador do Host deve ignorar. Apenas relevante no Controlador do Host slave. A configura\u00E7\u00E3o de tais "recursos ignorados" pode permitir um Controlador de Host de uma vers\u00E3o anterior operar com um slave a Controlador de Host mestre executando numa libera\u00E7\u00E3o mais recente, permitindo o slave ignorar por\u00E7\u00F5es de configura\u00E7\u00E3o que a pr\u00F3pria vers\u00E3o de software n\u00E3o pode compreender. Essa estrat\u00E9gia pode apenas ser bem sucedida caso os servidores gerenciados pelo Controlador do Host slave n\u00E3o referenciar qualquer configura\u00E7\u00E3o ignorada.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
ignored-resource-type=Identifica o tipo de recurso (ex.\: 'perfil' ou 'socket-binding-group') em que certas inst\u00E2ncias devem ser ignoradas.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
ignored-resource-type.add=Adiciona o tipo de recurso de certas inst\u00E2ncias em que devem ser ignoradas.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
ignored-resource-type.remove=Remove o tipo de recurso a partir do conjunto pelo qual certas inst\u00E2ncias devem ser ignoradas.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
ignored-resource-type.names=A lista de nomes de inst\u00E2ncias espec\u00EDficas desse tipo de recurso que devem ser ignoradas. A inclus\u00E3o de '*' na lista significa que todos os recursos do tipo devem ser ignorados.
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-host-controller/org/jboss/as/host/controller/descriptions/LocalDescriptions, author ldelima@redhat.com
ignored-resource-type.wildcard=O booliano que caso 'verdadeiro' indica que todos os recursos do tipo devem ser ignorados.
jvm=A configura\u00E7\u00E3o JVM para os processos / servidores gerenciados.
jvm.add=Adiciona uma nova configura\u00E7\u00E3o JVM.
jvm.remove=Remove uma configura\u00E7\u00E3o JVM existente.
jvm.name=O nome da configura\u00E7\u00E3o JVM.
jvm.heap-size=O tamanho de pilha inicial alocado pelo JVM.
jvm.max-heap-size=O tamanho da pilha m\u00E1ximo que pode ser alocado pelo JVM.
jvm.permgen-size=O tamanho de gera\u00E7\u00E3o permanente inicial.
jvm.permgen-size.deprecated=A JVM n\u00E3o fornece mais um espa\u00E7o separado para Gera\u00E7\u00E3o Permanente. 
jvm.max-permgen-size=O tamanho m\u00E1ximo de gera\u00E7\u00E3o permanente.
jvm.max-permgen-size.deprecated=A JVM n\u00E3o fornece mais um espa\u00E7o separado para Gera\u00E7\u00E3o Permanente. 
jvm.stack-size=As configura\u00E7\u00F5es de tamanho de pilha JVM.
jvm.agent-lib=A biblioteca do agente JVM.
jvm.agent-path=O caminho do agente JVM.
jvm.java-agent=O agente java.
jvm.jvm-options=As op\u00E7\u00F5es JVM.
jvm.add-jvm-option=Adiciona uma op\u00E7\u00E3o jvm.
jvm.add-jvm-option.jvm-option=A op\u00E7\u00E3o JVM.
jvm.remove-jvm-option=Remove a op\u00E7\u00E3o jvm.
jvm.remove-jvm-option.jvm-option=A op\u00E7\u00E3o JVM.
jvm.environment-variables=As vari\u00E1veis do ambiente JVM.
jvm.launch-command=Comando prefixado para JVM no lan\u00E7amento. 
jvm.java-home=A p\u00E1gina inicial do java
jvm.type=O tipo JVM pode ser tanto SUN ou IBM
jvm.debug-enabled=O valor booliano indicando se \u00E9 que a depura\u00E7\u00E3o est\u00E1 ativada.
jvm.debug-options=As op\u00E7\u00F5es de depura\u00E7\u00E3o.
jvm.env-classpath-ignored=Ignora a classpath do ambiente.
jvm.environment-variable.add=Adiciona uma vari\u00E1vel do ambiente jvm.
jvm.environment-variable.remove=Remove uma vari\u00E1vel do ambiente jvm.
jvm.environment-variable.name=O nome da vari\u00E1vel do ambiente jvm.
jvm.environment-variable.value=O valor da vari\u00E1vel do ambiente jvm.
discovery-options=Uma lista de op\u00E7\u00F5es da descoberta do domain controller.
discovery-options.discovery-options=A lista ordenada das op\u00E7\u00F5es de descoberta do domain controller.
discovery-options.discovery-options.deprecated=O atributo ainda preservado por motivos de compatibilidade, agora atributos de op\u00E7\u00F5es devem ser usados como alternativa. 
discovery-options.discovery-option=Uma lista de op\u00E7\u00F5es da descoberta do domain controller.
discovery-option=Op\u00E7\u00E3o de descoberta do domain controller.
discovery-option.name=O nome para esta op\u00E7\u00E3o de descoberta do domain controller.
discovery-option.code=O nome da classe inteiramente qualificado para a implementa\u00E7\u00E3o do DiscoveryOption.
discovery-option.module=O m\u00F3dulo a partir do qual carregar a implementa\u00E7\u00E3o do DiscoveryOption. Se n\u00E3o for fornecido, a implementa\u00E7\u00E3o do DiscoveryOption deve estar dispon\u00EDvel a partir do m\u00F3dulo do pr\u00F3prio controlador de host. 
discovery-option.properties=As propriedades das propriedades de op\u00E7\u00E3o de descoberta do domain controller.
discovery-option.add=Adiciona a configura\u00E7\u00E3o a op\u00E7\u00E3o de descoberta do domain controller.
discovery-option.remove=Remove a configura\u00E7\u00E3o para a op\u00E7\u00E3o de descoberta do domain controller.
discovery-options.static-discovery=Uma lista das op\u00E7\u00F5es de descoberta do domain controller est\u00E1tico.
static-discovery=A op\u00E7\u00E3o da descoberta do domain controller est\u00E1tico.
static-discovery.name=O nome para esta op\u00E7\u00E3o da descoberta do domain controller est\u00E1tico.
static-discovery.host=O nome do host do domain controller remoto.
static-discovery.port=O n\u00FAmero da porta do domain controller remoto.
static-discovery.protocol=O protocolo do controlador de dom\u00EDnio remoto.
static-discovery.add=Adiciona a configura\u00E7\u00E3o a op\u00E7\u00E3o de descoberta do domain controller est\u00E1tico.
static-discovery.remove=Remove a configura\u00E7\u00E3o para a op\u00E7\u00E3o de descoberta do domain controller est\u00E1tico.
discovery-options.options=A lista ordenada das op\u00E7\u00F5es de descoberta do domain controller.
discovery-options.options.name=O nome para esta op\u00E7\u00E3o de descoberta do domain controller.
discovery-options.options.code=O nome da classe inteiramente qualificado para a implementa\u00E7\u00E3o do DiscoveryOption.
discovery-options.options.module=O m\u00F3dulo para carregar a implementa\u00E7\u00E3o DiscoveryOption.
discovery-options.options.properties=As propriedades das propriedades de op\u00E7\u00E3o de descoberta do domain controller.
discovery-options.options.custom-discovery=Op\u00E7\u00E3o de descoberta do domain controller.
discovery-options.options.static-discovery=A op\u00E7\u00E3o da descoberta do domain controller est\u00E1tico.
discovery-options.options.host=O nome do host do domain controller remoto.
discovery-options.options.port=O n\u00FAmero da porta do domain controller remoto.
discovery-options.options.protocol=O protocolo do controlador de dom\u00EDnio remoto.
