domain=O n\u00F3 root do modelo de gerenciamento do domain-level.
domain.name=O nome dado a este domain.
domain.extension=A lista de m\u00F3dulos de extens\u00E3o.
domain.path=A lista dos caminhos do filesystem nomeado. Os caminhos podem ou n\u00E3o ser inteiramente especificados. (ex.\: inclui os caminhos atuais.)
domain.core-service=A configura\u00E7\u00E3o dos servi\u00E7os core fornecida pelos hosts e servidores do domain gerenciado.
domain.profile=Uma lista de perfis dispon\u00EDveis para uso no domain
domain.interface=A lista de interfaces nomeadas dispon\u00EDveis para uso no domain. As interfaces podem ou n\u00E3o ser inteiramente especificadas (ex.\: incluem o crit\u00E9rio de como determinar o pr\u00F3prio endere\u00E7o IP.)
domain.socket-binding-group=A lista de grupos de socket binding dispon\u00EDveis para uso no domain
domain.system-property=A lista das propriedades de sistema para configurar todos os servidores no domain.
domain.deployment=A lista de implanta\u00E7\u00F5es dispon\u00EDveis para uso no domain
domain.deployment-overlay=A lista de sobreposi\u00E7\u00F5es de implanta\u00E7\u00E3o para uso do servidor.
domain.server-group=A lista de grupos de servidores dispon\u00EDveis para uso no domain
domain.host-exclude=Uma lista de configura\u00E7\u00F5es de recursos que deveria ser oculta pelo Domain Controller para certos Host Controllers escravos. 
domain.local-host-name=O nome do controlador host de rodagem local.
domain.host=Os controladores do host rodando no domain
domain.domain-organization=Identifica\u00E7\u00E3o da atual organiza\u00E7\u00E3o que este domain faz parte. 
domain.process-type=O tipo de processo representado pelo recurso root. Tanto o "Domain Controller" ou o "Controlador de Host".
domain.release-version=A vers\u00E3o do lan\u00E7amento de WildFly Core que est\u00E1 sendo executada pelo controlador  host que est\u00E1 agindo como o controlador de dom\u00EDnio.
domain.release-codename=O codename da vers\u00E3o de  WildFly Core que est\u00E1 sendo executada pelo controlador host que est\u00E1 agindo como o controlador de dom\u00EDnio.
domain.management-client-content=Planos de revers\u00E3o definidos para este domain.
domain.product-name=O nome do produto baseado em WildFly Core que est\u00E1 sendo executado pelo controlador de host que est\u00E1 agindo como o controlador de dom\u00EDnio.
domain.product-version=A vers\u00E3o do WildFly Core que est\u00E1 sendo executada pelo controlador  host que est\u00E1 agindo como o controlador de dom\u00EDnio.
domain.management-major-version=A vers\u00E3o principal da interface de gerenciamento do kernel do WildFly Core \u00E9 fornecida pelo controlador host que est\u00E1 atuando como o controlador de dom\u00EDnio.
domain.management-minor-version=A vers\u00E3o de manuten\u00E7\u00E3o da interface de gerenciamento do kernel do WildFly Core que \u00E9 fornecida pelo controlador host que est\u00E1 atuando como o controlador de dom\u00EDnio.
domain.management-micro-version=A vers\u00E3o de  manuten\u00E7\u00E3o micro da interface de gerenciamento do kernel do WildFly Core que \u00E9 fornecida pelo controlador host que est\u00E1 atuando como o controlador de dom\u00EDnio.
domain.deployment.remove=Remove a implanta\u00E7\u00E3o da lista do conte\u00FAdo dispon\u00EDvel para uso atrav\u00E9s do domain. A implanta\u00E7\u00E3o n\u00E3o pode ser mapeada em quaisquer grupos do servidor.
domain.namespaces=O mapa do namespace usado no documento de configura\u00E7\u00E3o, onde as teclas s\u00E3o prefixos de namespace e valores s\u00E3o URIs de esquema.
domain.schema-locations=O mapa das localiza\u00E7\u00F5es dos esquemas XML usado no documento XML da configura\u00E7\u00E3o, onde as teclas s\u00E3o URIs de esquema e valores s\u00E3o localiza\u00E7\u00F5es onde o esquema pode ser encontrado.
domain.launch-type=A maneira pela qual o processo do servidor foi iniciado. Tanto o "DOMAIN" para um servidor do modo de domain pelo Host Controller, "STANDALONE" para o servidor aut\u00F4nomo iniciado na linha de comando, ou "EMBEDDED" para o servidor aut\u00F4nomo iniciado na linha de comando como parte incorporada de um aplicativo rodando na mesma m\u00E1quina virtual.
domain.list-unclean-host-unregistrations=Retorna uma lista de nomes de host que n\u00E3o cancela o registro corretamente. Isto pode indicar um problema com os hosts listados. 
domain.reload-servers=Recarrega todos os servidores atualmente executando no domain. 
domain.reload-servers.blocking=Aguarda at\u00E9 que servidores estejam totalmente iniciados antes de retornar a opera\u00E7\u00E3o. 
domain.reload-servers.timeout=O tempo-limite do desligamento autom\u00E1tico. Se for igual a zero, o desligamento autom\u00E1tico n\u00E3o ir\u00E1 fazer uma tentativa, caso seja -1 ent\u00E3o o servidor ir\u00E1 aguardar o desligamento autom\u00E1tico indefinidamente. 
domain.reload-servers.start-mode=O modo no qual os servidores dever\u00E3o ser recarregados. Pode ser suspenso ou normal.
domain.restart-servers=Reinicia todos os servidores atuais rodando no domain.
domain.restart-servers.blocking=Aguarde at\u00E9 que os servidores estejam totalmente iniciados antes de retornar a opera\u00E7\u00E3o. 
domain.restart-servers.timeout=O tempo-limite do desligamento autom\u00E1tico. Se for igual a zero, o desligamento autom\u00E1tico n\u00E3o ir\u00E1 fazer uma tentativa, caso seja -1 ent\u00E3o o servidor ir\u00E1 aguardar o desligamento autom\u00E1tico indefinidamente. 
domain.restart-servers.start-mode=O modo no qual os servidores dever\u00E3o ser reiniciados. Pode ser suspenso ou normal.
domain.start-servers=Inicia todos os servidores configurados no domain que n\u00E3o est\u00E1 rodando atualmente.
domain.start-servers.blocking=Aguarda at\u00E9 que servidores estejam totalmente iniciados antes de retornar a opera\u00E7\u00E3o. 
domain.start-servers.start-mode=O modo no qual os servidores dever\u00E3o come\u00E7ar a ser executados. Pode ser suspenso ou normal.
domain.stop-servers=Interrompe todos os servidores rodando no domain.
domain.stop-servers.blocking=Aguarde at\u00E9 que os servidores estejam totalmente iniciados antes de retornar a opera\u00E7\u00E3o. 
domain.stop-servers.timeout=O tempo-limite do desligamento autom\u00E1tico. Se for igual a zero, o desligamento autom\u00E1tico n\u00E3o ir\u00E1 fazer uma tentativa, caso seja -1 ent\u00E3o o servidor ir\u00E1 aguardar o desligamento autom\u00E1tico indefinidamente. 
domain.resume-servers=Retoma o processo em todos os servidores no domain
domain.suspend-servers=Suspende a todos os servidores no domain, todas opera\u00E7\u00F5es atuais ir\u00E3o ser finalizadas e nenhuma nova opera\u00E7\u00E3o ser\u00E1 permitida. 
domain.suspend-servers.timeout=Tempo limite em segundos. Se for igual a zero, a opera\u00E7\u00E3o ir\u00E1 retornar imediatamente, -1 significa que ir\u00E1 aguardar indefinidamente. Observe que a opera\u00E7\u00E3o n\u00E3o ser\u00E1 revertida caso o tempo limite for excedido, isto apenas significa que nem todas as solicita\u00E7\u00F5es atuais ser\u00E3o completadas no limite de tempo especificado. 
profile=Um conjunto nomeador das configura\u00E7\u00F5es do subsistema.
profile.name=O nome do perfil
profile.add=Adiciona um novo 'perfil'
profile.add.includes=O valor do atributo 'inclui' o novo perfil
profile.describe=Os resultados dos subsistemas do perfil como um lista de opera\u00E7\u00F5es que podem ser executadas para criar o mesmo modelo
profile.remove=Remove um 'perfil'
profile.remove.name=O valor do atributo 'nome' do perfil
profile.includes=Uma lista de nomes de perfis para incluir neste perfil. Substitui\u00E7\u00E3o de subsistemas n\u00E3o tem suporte. 
profile.include.profile=O nome do perfil inclu\u00EDdo
profile.includes.add=Adiciona uma lista de perfis inclu\u00EDdos
profile.includes.add.include=O nome do perfil inclu\u00EDdo
profile.includes.remove=Remove um perfil da lista de perfis inclu\u00EDdos
profile.includes.remove.include=O nome do perfil inclu\u00EDdo
profile.subsystem=Os subsistemas que fazem o perfil.
profile.clone=Clonar este perfil para um novo. O clone \u00E9 uma c\u00F3pia de todas as configura\u00E7\u00F5es deste perfil e subsistemas. 
profile.clone.to-profile=O nome do novo perfil a ser criado. 
server-group=A configura\u00E7\u00E3o do grupo do servidor.
server-group.add=Adiciona um novo grupo de servidor.
server-group.add.jvm=O nome jvm.
server-group.remove=Remove um novo grupo de servidor existente.
server-group.profile=O nome do perfil.
server-group.jvm=O jvm nomeado.
server-group.socket-binding-group=O grupo socket binding default usado para os servidores associados com esse grupo.
server-group.socket-binding-default-interface=A interface padr\u00E3o de grupo de vincular soquete  para este servidor. 
server-group.socket-binding-port-offset=O deslocamento default a ser adicionado aos valores da porta gerados pelo grupo socket binding.
server-group.management-subsystem-endpoint=Configure para verdadeiro para obter servidores pertencentes ao grupo de servidor de reconex\u00E3o ao controlador do host usando o ponto de extremidade a partir do pr\u00F3prio subsistema remoto. O subsistema deve estar presente para esse trabalho.
server-group.deployment=A lista de implanta\u00E7\u00F5es dispon\u00EDveis para uso no grupo de servidor.
server-group.system-property=A lista das propriedades de sistema para configurar todos os servidores nesse server-group.
server-group.deployment.remove=Remove a implanta\u00E7\u00E3o da lista do conte\u00FAdo dispon\u00EDvel para uso nos servidores do grupo. Caso a implanta\u00E7\u00E3o esteja sendo implantada no per\u00EDodo de rodagem, esta ser\u00E1 a primeira a ser desimplantada.
server-group.reload-servers=Recarrega todos os servidores que pertencem ao grupo de servidores atualmente executando no domain. 
server-group.reload-servers.blocking=Aguarde at\u00E9 que os servidores estejam totalmente iniciados antes de retornar a opera\u00E7\u00E3o. 
server-group.reload-servers.timeout=O tempo-limite do desligamento autom\u00E1tico. Se for igual a zero, o desligamento autom\u00E1tico n\u00E3o ir\u00E1 fazer uma tentativa, caso seja -1 ent\u00E3o o servidor ir\u00E1 aguardar o desligamento autom\u00E1tico indefinidamente. 
server-group.reload-servers.start-mode=O modo no qual os servidores dever\u00E3o come\u00E7ar a ser recarregados. Pode ser suspenso ou normal.
server-group.restart-servers=Reinicia todos os servidores pertencentes ao grupo de servidor atual rodando no domain.
server-group.restart-servers.blocking=Aguarde at\u00E9 que os servidores estejam totalmente iniciados antes de retornar a opera\u00E7\u00E3o. 
server-group.restart-servers.timeout=O tempo-limite do desligamento autom\u00E1tico. Se for igual a zero, o desligamento autom\u00E1tico n\u00E3o ir\u00E1 fazer uma tentativa, caso seja -1 ent\u00E3o o servidor ir\u00E1 aguardar o desligamento autom\u00E1tico indefinidamente. 
server-group.restart-servers.start-mode=O modo no qual os servidores dever\u00E3o ser reiniciados. Pode ser suspenso ou normal.
server-group.start-servers=Inicia todos os servidores configurados pertencentes ao grupo de servidor no Domain que n\u00E3o est\u00E1 rodando.
server-group.start-servers.blocking=Aguarde at\u00E9 que os servidores estejam totalmente iniciados antes de retornar a opera\u00E7\u00E3o. 
server-group.start-servers.start-mode=O modo no qual os servidores dever\u00E3o come\u00E7ar a ser executados. Pode ser suspenso ou normal.
server-group.stop-servers=Interrompe todos os servidores pertencentes ao grupo do servidor rodando no Domain.
server-group.stop-servers.blocking=Aguarde at\u00E9 que os servidores estejam totalmente parados antes de retornar a opera\u00E7\u00E3o. 
server-group.stop-servers.timeout=O tempo-limite do desligamento autom\u00E1tico. Se for igual a zero, o desligamento autom\u00E1tico n\u00E3o ir\u00E1 fazer uma tentativa, caso seja -1 ent\u00E3o o servidor ir\u00E1 aguardar o desligamento autom\u00E1tico indefinidamente. 
server-group.suspend-servers=Suspende opera\u00E7\u00F5es em todos os servidores no grupo de servidores. Ser\u00E1 permitido que todas as opera\u00E7\u00F5es atuais sejam finalizadas e novas opera\u00E7\u00F5es ser\u00E3o rejeitadas.  
server-group.suspend-servers.timeout=Tempo limite em segundos. Se for igual a zero a opera\u00E7\u00E3o ir\u00E1 retornar imediatamente, -1 significa que ir\u00E1 aguardar indefinidamente. Observe que a opera\u00E7\u00E3o n\u00E3o ser\u00E1 revertida caso o tempo limite for excedido. isto s\u00F3 significa  que nem todas as solicita\u00E7\u00F5es ser\u00E3o completadas no limite de tempo especificado. 
server-group.resume-servers=Retoma opera\u00E7\u00F5es em todos os servidores no grupo de servidores. 
server-group.deployment-overlay=Conex\u00F5es entre uma sobreposi\u00E7\u00E3o de implanta\u00E7\u00E3o definida e implanta\u00E7\u00F5es neste grupo de servidor
server-group.deployment-overlay.add=Adiciona o link a uma sobreposi\u00E7\u00E3o da implanta\u00E7\u00E3o
server-group.deployment-overlay.redeploy-links=Reimplanta as implanta\u00E7\u00F5es afetadas por esta sobreposi\u00E7\u00E3o
server-group.deployment-overlay.redeploy-links.deployments=Lista dos nomes dos tempos de execu\u00E7\u00E3o de implanta\u00E7\u00E3o a serem reimplantados. Se a lista estiver vazia ou "indefinida", todas as implanta\u00E7\u00F5es afetadas ser\u00E3o reimplantadas.
server-group.deployment-overlay.remove=Remove o link para a sobreposi\u00E7\u00E3o da implanta\u00E7\u00E3o
server-group.deployment-overlay.deployment=A implanta\u00E7\u00E3o que esta sobreposi\u00E7\u00E3o \u00E9 aplicada
server-group.deployment-overlay.deployment.add=Adiciona o link entre uma implanta\u00E7\u00E3o e esta sobreposi\u00E7\u00E3o
server-group.deployment-overlay.deployment.remove=Remove o link entre a implanta\u00E7\u00E3o e esta sobreposi\u00E7\u00E3o
server-group.deployment-overlay.deployment.remove.redeploy-affected=Se estiver definida como "verdadeira", reimplantar\u00E1 as implanta\u00E7\u00F5es afetadas por esta sobreposi\u00E7\u00E3o ap\u00F3s a remo\u00E7\u00E3o. 
server-group.deployment-overlay.deployment.regular-expression=Caso este nome de implanta\u00E7\u00E3o deve ser tratado como uma express\u00E3o regular
host-exclude=Configura\u00E7\u00E3o de recursos que devem ser ocultos pelo Domain Controller do Host Controller escravo que est\u00E1 executando uma vers\u00E3o espec\u00EDfica. 
host-exclude.add=Adiciona uma configura\u00E7\u00E3o host-ignore. A adi\u00E7\u00E3o n\u00E3o afeta quaisquer hosts registrados atualmente. 
host-exclude.remove=Remove uma configura\u00E7\u00E3o host-ignore. A remo\u00E7\u00E3o n\u00E3o afeta quaisquer hosts registrados atualmente. 
host-exclude.management-major-version=A vers\u00E3o principal da API de gerenciamento do kernel que tem suporte dos escravos deve ser afetada por esta configura\u00E7\u00E3o. 
host-exclude.management-minor-version=A vers\u00E3o secund\u00E1ria da API de gerenciamento do kernel que tem suporte dos escravos deve ser afetada por esta configura\u00E7\u00E3o. 
host-exclude.management-micro-version=A micro vers\u00E3o da API de gerenciamento do kernel que tem suporte dos escravos que deve ser afetada por esta configura\u00E7\u00E3o. Se n\u00E3o for definida, esta configura\u00E7\u00E3o aplica-se a todos os lan\u00E7amentos de vers\u00E3o principal/manuten\u00E7\u00E3o, excluindo quaisquer que apresentem uma configura\u00E7\u00E3o diferente com uma micro vers\u00E3o tamb\u00E9m especificada.  
host-exclude.host-release=Um identificador abreviado para um reconhecido EAP ou  uma distribui\u00E7\u00E3o de software baseado em Wildfly Core    que um Host Controller escravo esta executando que deve ser afetado por esta configura\u00E7\u00E3o. Utilizado como uma alternativa mais simples para especificar as vers\u00F5es de API do gerenciamento de kernel.
host-exclude.excluded-extensions=Uma lista de nomes de extens\u00F5es que os recursos para os quais (/extension\=X) devem ser ocultos para os hosts de destino. 
host-exclude.active-server-groups=Uma lista de nomes de grupos de servidores que os recursos est\u00E3o associados que deve ser oculta dos hosts de destino.  Estes s\u00E3o os grupos utilizados pelos servidores dos hosts. O grupo de servidores e perfil relacionado, grupo de socket binding e implementa\u00E7\u00E3o de recursos n\u00E3o ser\u00E3o ocultos; todos os outros ser\u00E3o ocultos. 
host-exclude.active-socket-binding-groups=Uma lista de nomes de grupos de socket binding  especificando todos os grupos de socket binding  que s\u00E3o utilizados pelos servidores executando nos host de destino.  Somente utilizado se estiver determinado 'active-server-groups'; caso contr\u00E1rio ignorado. Precisa ser definido somente se os grupos socket binding  especificados na configura\u00E7\u00E3o dos grupos de servidores listados no 'active-server-groups' n\u00E3o for o conjunto completo de grupos socket binding utilizados nos servidores  (ou seja, um outro grupo socket binding  est\u00E3o especificados nos recursos de 'server config' do hosts de destino). 
rollout-plans=Informa\u00E7\u00E3o de storage a respeito de um conjunto de planos de distribui\u00E7\u00E3o de atualiza\u00E7\u00E3o do gerenciamento \u00FAtil para o gerenciamento de clientes que est\u00E3o stored no reposit\u00F3rio do conte\u00FAdo do Domain. Os recursos filho sob esse recurso fornecem acesso aos planos para gerenciamento de clientes, permitindo que clientes usem planos referenciando-os pelo nome, evitando a necessidade de recri\u00E1-los para cada uso.
rollout-plans.hash=O hash de todos os planos de distribui\u00E7\u00E3o stored. Usado internamente pelos controladores de host para localizar o conte\u00FAdo do plano de distribui\u00E7\u00E3o.
rollout-plans.add=Adiciona a capacidade de store os planos de distribui\u00E7\u00E3o nomeado.
rollout-plans.remove=Remove a capacidade de store os planos de distribui\u00E7\u00E3o nomeados.
rollout-plan=O plano de distribui\u00E7\u00E3o stored.
rollout-plan.hash=O hash do conte\u00FAdo do plano de distribui\u00E7\u00E3o.
rollout-plan.content=O conte\u00FAdo do plano de distribui\u00E7\u00E3o, no formul\u00E1rio do JBoss DMR.
rollout-plan.add=Adiciona um plano de distribui\u00E7\u00E3o ao store persistente.
rollout-plan.remove=Remove o plano de distribui\u00E7\u00E3o a partir do store persistente.
rollout-plan.store=Atualiza o conte\u00FAdo de um plano de distribui\u00E7\u00E3o persistente existente, ap\u00F3s checagem de que o par\u00E2metro 'hash' fornecido coincide com o hash do plano de distribui\u00E7\u00E3o atual. Isto falha caso os hashes n\u00E3o coincidam. O uso dessa opera\u00E7\u00E3o ao inv\u00E9s da opera\u00E7\u00E3o 'write-attribute' para o atributo 'content' garante que a atualiza\u00E7\u00E3o n\u00E3o ir\u00E1 conflitar com uma atualiza\u00E7\u00E3o anterior desconhecida ao chamador.
rollout-plan.store.hash=O valor em que o chamador acredita estar o hash do conte\u00FAdo do plano de distribui\u00E7\u00E3o que est\u00E1 sendo substitu\u00EDdo.
rollout-plan.store.content=O conte\u00FAdo do plano de distribui\u00E7\u00E3o atualizado, na formul\u00E1rio do JBoss DMR.
domain.resolve-expression-on-domain=A opera\u00E7\u00E3o que aceita uma express\u00E3o como entrada (ou uma sequ\u00EAncia que pode ser analisada numa express\u00E3o) e a resolve nas propriedades do sistema local e vari\u00E1veis do ambiente em todos os servidores no domain.
domain.resolve-expression-on-domain.expression=A express\u00E3o a ser resolvida.
domain.resolve-expression-on-domain.reply=A express\u00E3o resolvida, ou o formul\u00E1rio da sequ\u00EAncia do valor de entrada original, caso n\u00E3o tenha representado uma express\u00E3o.
host-connection=Informa\u00E7\u00E3o sobre o estado da conex\u00E3o de um host controllers escravo.  
host-connection.connected=Mesmo que o host controller esteja conectado ou n\u00E3o. 
host-connection.events=Os eventos de host escravos. 
host-connection.events.address=O endere\u00E7o do host escravo se dispon\u00EDvel 
host-connection.events.timestamp=O hor\u00E1rio do evento. 
host-connection.events.type=O estado da conex\u00E3o do host controller. 
host-connection.prune-expired=Suprimir as entradas de evento do host expiradas. 
host-connection.prune-disconnected=Suprimir informa\u00E7\u00E3o sobre todos os host desconectados.  
