domain=\u30C9\u30E1\u30A4\u30F3\u30EC\u30D9\u30EB\u306E\u7BA1\u7406\u30E2\u30C7\u30EB\u306E\u30EB\u30FC\u30C8\u30CE\u30FC\u30C9\u3002
domain.name=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306B\u4E0E\u3048\u3089\u308C\u305F\u540D\u524D\u3002
domain.extension=\u62E1\u5F35\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7\u3002
domain.path=\u540D\u524D\u4ED8\u304D\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u306E\u4E00\u89A7\u3002\u30D1\u30B9\u304C\u5B8C\u5168\u306B\u6307\u5B9A\u3055\u308C\u308B\u5834\u5408\u3068\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059 (\u5B9F\u969B\u306E\u30D1\u30B9\u304C\u542B\u307E\u308C\u308B\u5834\u5408\u306A\u3069)\u3002
domain.core-service=\u7BA1\u7406\u5BFE\u8C61\u30C9\u30E1\u30A4\u30F3\u306E\u30DB\u30B9\u30C8\u304A\u3088\u3073\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u308B\u30B3\u30A2\u30B5\u30FC\u30D3\u30B9\u306E\u8A2D\u5B9A\u3002
domain.profile=\u30C9\u30E1\u30A4\u30F3\u3067\u5229\u7528\u53EF\u80FD\u306A\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u4E00\u89A7
domain.interface=\u30C9\u30E1\u30A4\u30F3\u3067\u5229\u7528\u53EF\u80FD\u306A\u540D\u524D\u4ED8\u304D\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u4E00\u89A7\u3002\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306F\u5B8C\u5168\u306B\u6307\u5B9A\u3055\u308C\u308B\u5834\u5408\u3068\u3055\u308C\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059 (IP \u30A2\u30C9\u30EC\u30B9\u3092\u5224\u65AD\u3059\u308B\u57FA\u6E96\u304C\u542B\u307E\u308C\u308B\u5834\u5408\u306A\u3069)\u3002
domain.socket-binding-group=\u30C9\u30E1\u30A4\u30F3\u3067\u4F7F\u7528\u3067\u304D\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u4E00\u89A7
domain.system-property=\u30C9\u30E1\u30A4\u30F3\u306E\u5168\u30B5\u30FC\u30D0\u30FC\u3067\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u4E00\u89A7\u3002
domain.deployment=\u30C9\u30E1\u30A4\u30F3\u3067\u4F7F\u7528\u3067\u304D\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u4E00\u89A7
domain.deployment-overlay=\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u53EF\u80FD\u306A\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30AA\u30FC\u30D0\u30FC\u30EC\u30A4\u306E\u4E00\u89A7
domain.server-group=\u30C9\u30E1\u30A4\u30F3\u3067\u4F7F\u7528\u3067\u304D\u308B\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u4E00\u89A7
domain.host-exclude=\u7279\u5B9A\u306E\u30B9\u30EC\u30FC\u30D6\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u8A8D\u8B58\u3057\u306A\u3044\u3088\u3046\u306B\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u96A0\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308B\u30EA\u30BD\u30FC\u30B9\u8A2D\u5B9A\u306E\u30EA\u30B9\u30C8\u3002
domain.local-host-name=\u30ED\u30FC\u30AB\u30EB\u3067\u7A3C\u50CD\u3057\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u540D\u524D\u3002
domain.host=\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u4E2D\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC
domain.domain-organization=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u304C\u4E00\u90E8\u3068\u306A\u3063\u3066\u3044\u308B\u73FE\u5728\u306E\u7D44\u7E54\u306E ID\u3002
domain.process-type=\u3053\u306E\u30EB\u30FC\u30C8\u30EA\u30BD\u30FC\u30B9\u306B\u3088\u3063\u3066\u8868\u3055\u308C\u308B\u30D7\u30ED\u30BB\u30B9\u306E\u578B\u3002"Domain Controller" \u307E\u305F\u306F "Host Controller" \u306B\u306A\u308A\u307E\u3059\u3002
domain.release-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u52D5\u4F5C\u3057\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u308B JBoss Application Server \u30EA\u30EA\u30FC\u30B9\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
domain.release-codename=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u52D5\u4F5C\u3057\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u308B JBoss Application Server \u30EA\u30EA\u30FC\u30B9\u306E\u30B3\u30FC\u30C9\u540D\u3002
domain.management-client-content=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306B\u5BFE\u3057\u3066\u5B9A\u7FA9\u3055\u308C\u305F\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3002
domain.product-name=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u52D5\u4F5C\u3057\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u308B JBoss AS \u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u540D\u3002
domain.product-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u52D5\u4F5C\u3057\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u308B JBoss AS \u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u30EA\u30EA\u30FC\u30B9\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
domain.management-major-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u52D5\u4F5C\u3057\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30E1\u30B8\u30E3\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
domain.management-minor-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u52D5\u4F5C\u3059\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30DE\u30A4\u30CA\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
domain.management-micro-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u52D5\u4F5C\u3059\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63D0\u4F9B\u3059\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30DE\u30A4\u30AF\u30ED\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
domain.deployment.remove=\u30C9\u30E1\u30A4\u30F3\u5168\u4F53\u3067\u5229\u7528\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u4E00\u89A7\u304B\u3089\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u524A\u9664\u3057\u307E\u3059\u3002\u73FE\u5728\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306F\u3069\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u3082\u30DE\u30C3\u30D4\u30F3\u30B0\u3067\u304D\u307E\u305B\u3093\u3002
domain.namespaces=\u8A2D\u5B9A XML \u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3067\u4F7F\u7528\u3055\u308C\u308B\u540D\u524D\u7A7A\u9593\u306E\u30DE\u30C3\u30D7\u3002\u30AD\u30FC\u306F\u540D\u524D\u7A7A\u9593\u306E\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9\u3067\u3001\u5024\u306F\u30B9\u30AD\u30FC\u30DE URI \u306B\u306A\u308A\u307E\u3059\u3002
domain.schema-locations=\u8A2D\u5B9A XML \u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3067\u4F7F\u7528\u3055\u308C\u308B XML \u30B9\u30AD\u30FC\u30DE\u306E\u5834\u6240\u306E\u30DE\u30C3\u30D7\u3002\u30AD\u30FC\u306F\u30B9\u30AD\u30FC\u30DE URI \u3067\u3001\u5024\u306F\u30B9\u30AD\u30FC\u30DE\u306E\u3042\u308B\u5834\u6240\u306B\u306A\u308A\u307E\u3059\u3002
domain.launch-type=\u30B5\u30FC\u30D0\u30FC\u30D7\u30ED\u30BB\u30B9\u304C\u8D77\u52D5\u3055\u308C\u305F\u65B9\u6CD5\u3002"DOMAIN" \u306F\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u8D77\u52D5\u3055\u308C\u308B\u30C9\u30E1\u30A4\u30F3\u30E2\u30FC\u30C9\u30B5\u30FC\u30D0\u30FC\u3001"STANDALONE" \u306F\u30B3\u30DE\u30F3\u30C9\u30E9\u30A4\u30F3\u3088\u308A\u8D77\u52D5\u3055\u308C\u308B\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30F3\u30B5\u30FC\u30D0\u30FC\u3001"EMBEDDED" \u306F\u540C\u3058\u4EEE\u60F3\u30DE\u30B7\u30F3\u3067\u7A3C\u50CD\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u7D44\u307F\u8FBC\u307F\u90E8\u5206\u3068\u3057\u3066\u8D77\u52D5\u3055\u308C\u308B\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30F3\u30B5\u30FC\u30D0\u30FC\u306B\u306A\u308A\u307E\u3059\u3002
domain.list-unclean-host-unregistrations=\u6B63\u5E38\u306B\u767B\u9332\u89E3\u9664\u3055\u308C\u306A\u304B\u3063\u305F\u30DB\u30B9\u30C8\u540D\u306E\u30EA\u30B9\u30C8\u3092\u8FD4\u3057\u307E\u3059\u3002\u30EA\u30B9\u30C8\u3055\u308C\u305F\u30DB\u30B9\u30C8\u306B\u554F\u984C\u304C\u3042\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
domain.reload-servers=\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u30EA\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
domain.reload-servers.blocking=\u30B5\u30FC\u30D0\u30FC\u304C\u5B8C\u5168\u306B\u8D77\u52D5\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u305F\u5F8C\u3001\u64CD\u4F5C\u304B\u3089\u623B\u308A\u307E\u3059\u3002
domain.reload-servers.timeout=\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002\u30BC\u30ED\u306E\u5834\u5408\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u8A66\u884C\u3055\u308C\u307E\u305B\u3093\u3002-1 \u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u884C\u308F\u308C\u308B\u307E\u3067\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002
domain.restart-servers=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u518D\u8D77\u52D5\u3057\u307E\u3059\u3002
domain.restart-servers.blocking=\u30B5\u30FC\u30D0\u30FC\u304C\u5B8C\u5168\u306B\u8D77\u52D5\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u305F\u5F8C\u3001\u64CD\u4F5C\u304B\u3089\u623B\u308A\u307E\u3059\u3002
domain.restart-servers.timeout=\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002\u30BC\u30ED\u306E\u5834\u5408\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u8A66\u884C\u3055\u308C\u307E\u305B\u3093\u3002-1 \u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u884C\u308F\u308C\u308B\u307E\u3067\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002
domain.start-servers=\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u3057\u3066\u3044\u306A\u3044\u8A2D\u5B9A\u6E08\u307F\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u8D77\u52D5\u3057\u307E\u3059\u3002
domain.start-servers.blocking=\u30B5\u30FC\u30D0\u30FC\u304C\u5B8C\u5168\u306B\u8D77\u52D5\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u305F\u5F8C\u3001\u64CD\u4F5C\u304B\u3089\u623B\u308A\u307E\u3059\u3002
domain.stop-servers=\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u505C\u6B62\u3057\u307E\u3059\u3002
domain.stop-servers.blocking=\u30B5\u30FC\u30D0\u30FC\u304C\u505C\u6B62\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u305F\u5F8C\u3001\u64CD\u4F5C\u304B\u3089\u623B\u308A\u307E\u3059\u3002
domain.stop-servers.timeout=\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002\u30BC\u30ED\u306E\u5834\u5408\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u8A66\u884C\u3055\u308C\u307E\u305B\u3093\u3002-1 \u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u884C\u308F\u308C\u308B\u307E\u3067\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002
domain.resume-servers=\u30C9\u30E1\u30A4\u30F3\u306E\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u51E6\u7406\u3092\u518D\u958B\u3057\u307E\u3059\u3002
domain.suspend-servers=\u30C9\u30E1\u30A4\u30F3\u306E\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u4E00\u6642\u505C\u6B62\u3057\u307E\u3059\u3002\u73FE\u5728\u306E\u64CD\u4F5C\u306F\u3059\u3079\u3066\u5B8C\u4E86\u3057\u307E\u3059\u3002\u65B0\u3057\u3044\u64CD\u4F5C\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
domain.suspend-servers.timeout=\u79D2\u5358\u4F4D\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002\u30BC\u30ED\u306E\u5834\u5408\u306F\u76F4\u3061\u306B\u64CD\u4F5C\u306B\u623B\u308A\u307E\u3059\u3002-1 \u306E\u5834\u5408\u306F\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u904E\u304E\u3066\u3082\u64CD\u4F5C\u306F\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305A\u3001\u6307\u5B9A\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u671F\u9593\u306B\u73FE\u5728\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u3059\u3079\u3066\u5B8C\u4E86\u3059\u308B\u308F\u3051\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
profile=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u8A2D\u5B9A\u306E\u540D\u524D\u4ED8\u304D\u30BB\u30C3\u30C8\u3002
profile.name=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D
profile.add=\u65B0\u898F 'profile' \u306E\u8FFD\u52A0
profile.add.includes=\u65B0\u898F\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E 'includes' \u5C5E\u6027\u5024
profile.describe=\u540C\u3058\u30E2\u30C7\u30EB\u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u5B9F\u884C\u3067\u304D\u308B\u64CD\u4F5C\u306E\u4E00\u89A7\u3068\u3057\u3066\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u51FA\u529B\u3057\u307E\u3059
profile.remove='profile' \u306E\u524A\u9664
profile.remove.name=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E 'name' \u5C5E\u6027\u5024
profile.includes=\u3053\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306B\u542B\u307E\u308C\u308B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D\u306E\u30EA\u30B9\u30C8\u3002\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3059\u308B\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002
profile.include.profile=\u542B\u307E\u308C\u308B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D
profile.includes.add=\u542B\u307E\u308C\u308B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u4E00\u89A7\u3078\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0
profile.includes.add.include=\u542B\u307E\u308C\u308B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D
profile.includes.remove=\u542B\u307E\u308C\u308B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u4E00\u89A7\u3088\u308A\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664
profile.includes.remove.include=\u542B\u307E\u308C\u308B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D
profile.subsystem=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u69CB\u6210\u3059\u308B\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
profile.clone=\u3053\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u65B0\u3057\u3044\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306B\u30AF\u30ED\u30FC\u30F3\u3057\u307E\u3059\u3002\u30AF\u30ED\u30FC\u30F3\u306F\u3053\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u8A2D\u5B9A\u304A\u3088\u3073\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3059\u3079\u3066\u306E\u30B3\u30D4\u30FC\u3067\u3059\u3002
profile.clone.to-profile=\u4F5C\u6210\u3059\u308B\u65B0\u3057\u3044\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D\u3002
server-group=\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u8A2D\u5B9A
server-group.add=\u65B0\u898F\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0
server-group.add.jvm=jvm \u540D
server-group.remove=\u65E2\u5B58\u306E\u65B0\u898F\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u3092\u524A\u9664
server-group.profile=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u540D
server-group.jvm=\u540D\u524D\u4ED8\u304D jvm
server-group.socket-binding-group=\u3053\u306E\u30B0\u30EB\u30FC\u30D7\u306B\u95A2\u9023\u3059\u308B\u30B5\u30FC\u30D0\u30FC\u306B\u4F7F\u7528\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u3002
server-group.socket-binding-default-interface=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002
server-group.socket-binding-port-offset=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306B\u3088\u3063\u3066\u4ED8\u4E0E\u3055\u308C\u308B\u30DD\u30FC\u30C8\u5024\u306B\u8FFD\u52A0\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AA\u30D5\u30BB\u30C3\u30C8\u3002
server-group.management-subsystem-endpoint=true \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30EA\u30E2\u30FC\u30C8\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u4F7F\u7528\u3057\u3066\u3001\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3078\u63A5\u7D9A\u3059\u308B\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u30B5\u30FC\u30D0\u30FC\u304C\u5C5E\u3059\u308B\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u306B\u306F\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304C\u5B58\u5728\u3057\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
server-group.deployment=\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u3067\u4F7F\u7528\u3067\u304D\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u4E00\u89A7
server-group.system-property=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u306B\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u4E00\u89A7\u3002
server-group.deployment.remove=\u30B0\u30EB\u30FC\u30D7\u306E\u30B5\u30FC\u30D0\u30FC\u3067\u4F7F\u7528\u3067\u304D\u308B\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u4E00\u89A7\u304B\u3089\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u524A\u9664\u3057\u307E\u3059\u3002\u73FE\u5728\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u6700\u521D\u306B\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u3059\u3002
server-group.reload-servers=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u3057\u3066\u3044\u308B\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u5C5E\u3059\u308B\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u30EA\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
server-group.reload-servers.blocking=\u30B5\u30FC\u30D0\u30FC\u304C\u5B8C\u5168\u306B\u8D77\u52D5\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u305F\u5F8C\u3001\u64CD\u4F5C\u304B\u3089\u623B\u308A\u307E\u3059\u3002
server-group.reload-servers.timeout=\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002\u30BC\u30ED\u306E\u5834\u5408\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u8A66\u884C\u3055\u308C\u307E\u305B\u3093\u3002-1 \u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u884C\u308F\u308C\u308B\u307E\u3067\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002
server-group.restart-servers=\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u5C5E\u3059\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u3092\u518D\u8D77\u52D5\u3057\u307E\u3059\u3002
server-group.restart-servers.blocking=\u30B5\u30FC\u30D0\u30FC\u304C\u5B8C\u5168\u306B\u8D77\u52D5\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u305F\u5F8C\u3001\u64CD\u4F5C\u304B\u3089\u623B\u308A\u307E\u3059\u3002
server-group.restart-servers.timeout=\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002\u30BC\u30ED\u306E\u5834\u5408\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u8A66\u884C\u3055\u308C\u307E\u305B\u3093\u3002-1 \u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u884C\u308F\u308C\u308B\u307E\u3067\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002
server-group.start-servers=\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u3057\u3066\u3044\u306A\u3044\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u5C5E\u3059\u308B\u8A2D\u5B9A\u6E08\u307F\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u8D77\u52D5\u3057\u307E\u3059\u3002
server-group.start-servers.blocking=\u30B5\u30FC\u30D0\u30FC\u304C\u5B8C\u5168\u306B\u8D77\u52D5\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u305F\u5F8C\u3001\u64CD\u4F5C\u304B\u3089\u623B\u308A\u307E\u3059\u3002
server-group.stop-servers=\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u5C5E\u3059\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u3092\u505C\u6B62\u3057\u307E\u3059\u3002
server-group.stop-servers.blocking=\u30B5\u30FC\u30D0\u30FC\u304C\u5B8C\u5168\u306B\u505C\u6B62\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3057\u305F\u5F8C\u3001\u64CD\u4F5C\u304B\u3089\u623B\u308A\u307E\u3059\u3002
server-group.stop-servers.timeout=\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002\u30BC\u30ED\u306E\u5834\u5408\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u8A66\u884C\u3055\u308C\u307E\u305B\u3093\u3002-1 \u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u6B63\u5E38\u306A\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u884C\u308F\u308C\u308B\u307E\u3067\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002
server-group.suspend-servers=\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u64CD\u4F5C\u3092\u4E00\u6642\u505C\u6B62\u3057\u307E\u3059\u3002\u73FE\u5728\u306E\u3059\u3079\u3066\u306E\u64CD\u4F5C\u306F\u5B8C\u4E86\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u3001\u65B0\u3057\u3044\u64CD\u4F5C\u306F\u62D2\u5426\u3055\u308C\u307E\u3059\u3002
server-group.suspend-servers.timeout=\u79D2\u5358\u4F4D\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3002\u30BC\u30ED\u306E\u5834\u5408\u306F\u76F4\u3061\u306B\u64CD\u4F5C\u306B\u623B\u308A\u307E\u3059\u3002-1 \u306E\u5834\u5408\u306F\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3057\u307E\u3059\u3002\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u904E\u304E\u3066\u3082\u64CD\u4F5C\u306F\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305A\u3001\u6307\u5B9A\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u671F\u9593\u306B\u73FE\u5728\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u3059\u3079\u3066\u5B8C\u4E86\u3059\u308B\u308F\u3051\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
server-group.resume-servers=\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u4E0A\u306E\u64CD\u4F5C\u3092\u518D\u958B\u3057\u307E\u3059\u3002
server-group.deployment-overlay=\u5B9A\u7FA9\u6E08\u307F\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30AA\u30FC\u30D0\u30FC\u30EC\u30A4\u3068\u3001\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3068\u306E\u9593\u3092\u30EA\u30F3\u30AF\u3057\u307E\u3059
server-group.deployment-overlay.add=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30AA\u30FC\u30D0\u30FC\u30EC\u30A4\u3078\u30EA\u30F3\u30AF\u3092\u8FFD\u52A0
server-group.deployment-overlay.remove=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30AA\u30FC\u30D0\u30FC\u30EC\u30A4\u3078\u306E\u30EA\u30F3\u30AF\u3092\u524A\u9664
server-group.deployment-overlay.deployment=\u3053\u306E\u30AA\u30FC\u30D0\u30FC\u30EC\u30A4\u304C\u9069\u7528\u3055\u308C\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8
server-group.deployment-overlay.deployment.add=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3068\u3053\u306E\u30AA\u30FC\u30D0\u30FC\u30EC\u30A4\u306E\u9593\u306B\u30EA\u30F3\u30AF\u3092\u8FFD\u52A0
server-group.deployment-overlay.deployment.remove=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3068\u3053\u306E\u30AA\u30FC\u30D0\u30FC\u30EC\u30A4\u3068\u306E\u9593\u306E\u30EA\u30F3\u30AF\u3092\u524A\u9664
server-group.deployment-overlay.deployment.regular-expression=\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u540D\u3092\u6B63\u898F\u8868\u73FE\u3068\u3057\u3066\u6271\u3046\u3079\u304D\u304B
host-exclude=\u7279\u5B9A\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u30B9\u30EC\u30FC\u30D6\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u8A8D\u8B58\u3057\u306A\u3044\u3088\u3046\u306B\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u96A0\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308B\u30EA\u30BD\u30FC\u30B9\u306E\u8A2D\u5B9A\u3002
host-exclude.add=host-ignore \u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002\u3053\u306E\u8FFD\u52A0\u306F\u73FE\u5728\u767B\u9332\u3055\u308C\u3066\u3044\u308B\u30DB\u30B9\u30C8\u306B\u306F\u5F71\u97FF\u3057\u307E\u305B\u3093\u3002
host-exclude.remove=host-ignore \u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002\u3053\u306E\u524A\u9664\u306F\u73FE\u5728\u767B\u9332\u3055\u308C\u3066\u3044\u308B\u30DB\u30B9\u30C8\u306B\u306F\u5F71\u97FF\u3057\u307E\u305B\u3093\u3002
host-exclude.management-major-version=\u3053\u306E\u8A2D\u5B9A\u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u30B9\u30EC\u30FC\u30D6\u306B\u3088\u3063\u3066\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u30AB\u30FC\u30CD\u30EB\u7BA1\u7406 API \u306E\u30E1\u30B8\u30E3\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
host-exclude.management-minor-version=\u3053\u306E\u8A2D\u5B9A\u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u30B9\u30EC\u30FC\u30D6\u306B\u3088\u3063\u3066\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u30AB\u30FC\u30CD\u30EB\u7BA1\u7406 API \u306E\u30DE\u30A4\u30CA\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
host-exclude.management-micro-version=\u3053\u306E\u8A2D\u5B9A\u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u30B9\u30EC\u30FC\u30D6\u306B\u3088\u3063\u3066\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u30AB\u30FC\u30CD\u30EB\u7BA1\u7406 API \u306E\u30DE\u30A4\u30AF\u30ED\u30D0\u30FC\u30B8\u30E7\u30F3\u3002\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u3068\u3001\u30DE\u30A4\u30AF\u30ED\u30D0\u30FC\u30B8\u30E7\u30F3\u3082\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u7570\u306A\u308B\u8A2D\u5B9A\u304C\u3042\u308B\u5834\u5408\u3092\u9664\u304D\u3001\u3053\u306E\u8A2D\u5B9A\u306F\u6307\u5B9A\u306E\u30E1\u30B8\u30E3\u30FC/\u30DE\u30A4\u30CA\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u306E\u3059\u3079\u3066\u306E\u30EA\u30EA\u30FC\u30B9\u3078\u9069\u7528\u3055\u308C\u307E\u3059\u3002
host-exclude.host-release=\u3053\u306E\u8A2D\u5B9A\u306E\u5F71\u97FF\u3092\u53D7\u3051\u3001\u30B9\u30EC\u30FC\u30D6\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u5B9F\u884C\u3059\u308B\u65E2\u77E5\u306E EAP \u307E\u305F\u306F WildFly Core \u30D9\u30FC\u30B9\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u30C7\u30A3\u30B9\u30C8\u30EA\u30D3\u30E5\u30FC\u30B7\u30E7\u30F3\u306E\u77ED\u7E2E\u5F62\u306E\u8B58\u5225\u5B50\u3002\u30AB\u30FC\u30CD\u30EB\u7BA1\u7406 API \u30D0\u30FC\u30B8\u30E7\u30F3\u3092\u6307\u5B9A\u3059\u308B\u4EE3\u308F\u308A\u306B\u4F7F\u7528\u3057\u307E\u3059\u3002
host-exclude.excluded-extensions=\u30BF\u30FC\u30B2\u30C3\u30C8\u30DB\u30B9\u30C8\u304C\u8A8D\u8B58\u3057\u306A\u3044\u3088\u3046\u306B\u30EA\u30BD\u30FC\u30B9\u3092\u96A0\u3059\u5FC5\u8981\u304C\u3042\u308B\u62E1\u5F35\u540D (/extension\=X) \u306E\u30EA\u30B9\u30C8\u3002
host-exclude.active-server-groups=\u30BF\u30FC\u30B2\u30C3\u30C8\u30DB\u30B9\u30C8\u304C\u8A8D\u8B58\u3057\u306A\u3044\u3088\u3046\u306B\u95A2\u9023\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u3092\u96A0\u3059\u5FC5\u8981\u304C\u3042\u308B\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u540D\u306E\u30EA\u30B9\u30C8\u3002
host-exclude.active-socket-binding-groups=\u30BF\u30FC\u30B2\u30C3\u30C8\u30DB\u30B9\u30C8\u4E0A\u3067\u7A3C\u50CD\u3057\u3066\u3044\u308B\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u3059\u3079\u3066\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u3092\u6307\u5B9A\u3059\u308B socket-binding-group \u540D\u306E\u30EA\u30B9\u30C8\u3002'active-server-groups' \u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u4F7F\u7528\u3055\u308C\u3001\u305D\u308C\u4EE5\u5916\u306E\u5834\u5408\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002'active-server-groups' \u306B\u30EA\u30B9\u30C8\u3055\u308C\u305F\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u8A2D\u5B9A\u306B\u6307\u5B9A\u3055\u308C\u305F\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u304C\u3001\u30B5\u30FC\u30D0\u30FC\u3067\u4F7F\u7528\u3055\u308C\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u5B8C\u5168\u30BB\u30C3\u30C8\u3067\u306A\u3044\u5834\u5408\u306E\u307F\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059 (\u4F8B\: \u4ED6\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u4E00\u90E8\u304C\u30BF\u30FC\u30B2\u30C3\u30C8\u30DB\u30B9\u30C8\u306E 'server-config' \u30EA\u30BD\u30FC\u30B9\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B)\u3002
rollout-plans=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4\u30EA\u30DD\u30B8\u30C8\u30EA\u306B\u683C\u7D0D\u3055\u308C\u3066\u3044\u308B\u7BA1\u7406\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3068\u3063\u3066\u4FBF\u5229\u306A\u540D\u524D\u4ED8\u304D\u7BA1\u7406\u66F4\u65B0\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306B\u95A2\u3059\u308B\u30B9\u30C8\u30EC\u30FC\u30B8\u60C5\u5831\u3002\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306E\u5B50\u30EA\u30BD\u30FC\u30B9\u306B\u3088\u308A\u3001\u7BA1\u7406\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u3053\u308C\u3089\u306E\u30D7\u30E9\u30F3\u3078\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u3059\u3002\u305D\u306E\u305F\u3081\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u540D\u524D\u3067\u53C2\u7167\u3057\u3066\u30D7\u30E9\u30F3\u3092\u4F7F\u7528\u3067\u304D\u308B\u305F\u3081\u3001\u4F7F\u7528\u3054\u3068\u306B\u30D7\u30E9\u30F3\u3092\u518D\u4F5C\u6210\u3059\u308B\u5FC5\u8981\u304C\u306A\u304F\u306A\u308A\u307E\u3059\u3002
rollout-plans.hash=\u4FDD\u5B58\u3055\u308C\u305F\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3059\u3079\u3066\u306E\u30CF\u30C3\u30B7\u30E5\u3002\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u898B\u3064\u3051\u308B\u305F\u3081\u3001\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u3063\u3066\u5185\u90E8\u3067\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
rollout-plans.add=\u540D\u524D\u4ED8\u304D\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3092\u4FDD\u5B58\u3059\u308B\u6A5F\u80FD\u3092\u8FFD\u52A0\u3002
rollout-plans.remove=\u540D\u524D\u4ED8\u304D\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3092\u4FDD\u5B58\u3059\u308B\u6A5F\u80FD\u3092\u524A\u9664\u3002
rollout-plan=\u4FDD\u5B58\u3055\u308C\u305F\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3002
rollout-plan.hash=\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u30CF\u30C3\u30B7\u30E5\u3002
rollout-plan.content=JBoss DMR \u5F62\u5F0F\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4
rollout-plan.add=\u6C38\u7D9A\u30B9\u30C8\u30A2\u3078\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3092\u8FFD\u52A0
rollout-plan.remove=\u6C38\u7D9A\u30B9\u30C8\u30A2\u304B\u3089\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3092\u524A\u9664
rollout-plan.store=\u63D0\u4F9B\u3055\u308C\u305F 'hash' \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C\u73FE\u5728\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306E\u30CF\u30C3\u30B7\u30E5\u3068\u4E00\u81F4\u3059\u308B\u3053\u3068\u3092\u6700\u521D\u306B\u78BA\u8A8D\u3057\u305F\u5F8C\u3001\u65E2\u5B58\u306E\u6C38\u7D9A\u5316\u3055\u308C\u305F\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306E\u5185\u5BB9\u3092\u66F4\u65B0\u3057\u307E\u3059\u3002\u30CF\u30C3\u30B7\u30E5\u304C\u4E00\u81F4\u3057\u306A\u3044\u5834\u5408\u306F\u5931\u6557\u3057\u307E\u3059\u3002'content' \u5C5E\u6027\u306E 'write-attribute' \u64CD\u4F5C\u306E\u4EE3\u308F\u308A\u306B\u3053\u306E\u64CD\u4F5C\u3092\u4F7F\u3046\u3053\u3068\u3067\u3001\u547C\u3073\u51FA\u3057\u5143\u304C\u8A8D\u8B58\u3057\u3066\u3044\u306A\u3044\u4EE5\u524D\u306E\u66F4\u65B0\u3068\u6700\u65B0\u306E\u66F4\u65B0\u304C\u7AF6\u5408\u3057\u306A\u3044\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
rollout-plan.store.hash=\u7F6E\u304D\u63DB\u3048\u3089\u308C\u308B\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u30CF\u30C3\u30B7\u30E5\u3067\u3042\u308B\u3053\u3068\u3092\u547C\u3073\u51FA\u3057\u5143\u304C\u60F3\u5B9A\u3059\u308B\u5024\u3002
rollout-plan.store.content=JBoss DMR \u5F62\u5F0F\u306E\u66F4\u65B0\u6E08\u307F\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4
domain.resolve-expression-on-domain=\u5F0F\u3092\u5165\u529B (\u307E\u305F\u306F\u5F0F\u3078\u89E3\u6790\u3067\u304D\u308B\u6587\u5B57\u5217) \u3068\u3057\u3066\u8A31\u53EF\u3057\u3001\u30C9\u30E1\u30A4\u30F3\u306E\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u30ED\u30FC\u30AB\u30EB\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3068\u74B0\u5883\u5909\u6570\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3059\u308B\u64CD\u4F5C\u3002
domain.resolve-expression-on-domain.expression=\u89E3\u6C7A\u3059\u308B\u5F0F\u3002
domain.resolve-expression-on-domain.reply=\u89E3\u6C7A\u6E08\u307F\u306E\u5F0F\u3001\u307E\u305F\u306F\u5F0F\u3092\u8868\u73FE\u3057\u306A\u304B\u3063\u305F\u5834\u5408\u306F\u5143\u306E\u5165\u529B\u306E\u6587\u5B57\u5217\u5F62\u5F0F\u3002
host-connection=\u30B9\u30EC\u30FC\u30D6\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u63A5\u7D9A\u72B6\u614B\u306B\u95A2\u3059\u308B\u60C5\u5831\u3002
host-connection.connected=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63A5\u7D9A\u3055\u308C\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u3002
host-connection.events=\u30B9\u30EC\u30FC\u30D6\u30DB\u30B9\u30C8\u306E\u30A4\u30D9\u30F3\u30C8\u3002
host-connection.events.address=\u5229\u7528\u3067\u304D\u308B\u5834\u5408\u306F\u30B9\u30EC\u30FC\u30D6\u30DB\u30B9\u30C8\u30A2\u30C9\u30EC\u30B9\u3002
host-connection.events.timestamp=\u30A4\u30D9\u30F3\u30C8\u306E\u6642\u9593\u3002
host-connection.events.type=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u63A5\u7D9A\u306E\u72B6\u614B\u3002
host-connection.prune-expired=\u671F\u9650\u5207\u308C\u306E\u30DB\u30B9\u30C8\u30A4\u30D9\u30F3\u30C8\u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u6392\u9664\u3002
host-connection.prune-disconnected=\u63A5\u7D9A\u304C\u5207\u65AD\u3055\u308C\u305F\u3059\u3079\u3066\u306E\u30DB\u30B9\u30C8\u306B\u95A2\u3059\u308B\u60C5\u5831\u3092\u6392\u9664\u3002
