domain=El nodo ra\u00EDz del modelo de administraci\u00F3n a nivel del dominio.
domain.name=El nombre asignado a \u00E9ste dominio.
domain.extension=Una lista de m\u00F3dulos de extensi\u00F3n.
domain.path=Una lista de rutas nombradas del sistema de archivos. Puede que las rutas se especifiquen de manera completa o no (es decir, incluyendo las rutas reales).
domain.core-service=Configuraci\u00F3n de los servicios centrales proporcionados por los hosts del dominio administrado y los servidores.
domain.profile=Una lista de perfiles disponibles para uso en el dominio
domain.interface=Una lista de interfaces de red nombradas disponibles en el dominio. Puede que las interfaces se especifiquen de manera completa o no (es decir, incluir el criterio sobre c\u00F3mo determinar su direcci\u00F3n IP).
domain.socket-binding-group=Una lista de grupos de enlace de sockets disponibles para uso en el dominio
domain.system-property=Una lista de propiedades del sistema para establecer en todos los servidores en el dominio.
domain.deployment=Una lista de implementaciones disponibles para uso en el dominio
domain.deployment-overlay=Una lista de capas de implementaci\u00F3n disponibles para uso por parte del servidor.
domain.server-group=Una lista de grupos de servidores disponibles en el dominio
domain.host-exclude=Una lista de las configuraciones de recursos que deben ser ocultadas por el controlador de dominio desde algunos controladores de host esclavos.
domain.local-host-name=El nombre del controlador host ejecutando localmente.
domain.host=Los controladores host ejecutando actualmente en el dominio
domain.domain-organization=Identificaci\u00F3n de la organizaci\u00F3n actual de la cual hace parte este dominio.
domain.process-type=El tipo de proceso representado por este recurso ra\u00EDz. Ya sea "controlador de dominio" o "controlador host".
domain.release-version=La versi\u00F3n del lanzamiento WildFly Core ejecutada por el controlador, que act\u00FAa como el controlador del dominio.
domain.release-codename=La versi\u00F3n del lanzamiento WildFly Core ejecutada por el controlador, que act\u00FAa como el controlador del dominio.
domain.management-client-content=Planes de despliegue definidos para este dominio.
domain.product-name=El nombre del producto WildFly Core ejecutado por el controlador de host, que act\u00FAa como el controlador del dominio.
domain.product-version=La versi\u00F3n del producto WildFly Core ejecutada por el controlador de host , que act\u00FAa como el controlador del dominio.
domain.management-major-version=La versi\u00F3n mayor de la interfaz administrativa del kernel WildFly Core, provista por el controlador de host, que act\u00FAa como el controlador del dominio.
domain.management-minor-version=La versi\u00F3n menor de la interfaz administrativa del kernel WildFly Core, provista por el controlador de host, que act\u00FAa como el controlador del dominio.
domain.management-micro-version=La micro versi\u00F3n de la interfaz administrativa del kernel WildFly Core, provista por el controlador de host, que act\u00FAa como el controlador del dominio.
domain.deployment.remove=Borra una implementaci\u00F3n de la lista de contenido disponible a trav\u00E9s del dominio. Actualmente la implementaci\u00F3n no se puede mapear a ning\u00FAn grupo del servidor.
domain.namespaces=Mapa de espacios de nombres utilizados en el documento XML de configuraci\u00F3n, en donde las llaves son prefijos de espacios de nombre  y los valores son URIs de esquemas.
domain.schema-locations=Mapa de la ubicaci\u00F3n de los esquemas XML utilizados en el documento XML de configuraci\u00F3n, en donde las llaves son URIs de esquema y los valores son lugares en donde se pueda encontrar el esquema.
domain.launch-type=La forma en que se lanz\u00F3 el proceso del servidor. Ya sea "DOMAIN" para un servidor de dominio lanzado por un controlador de host, "STANDALONE" para un servidor aut\u00F3nomo lanzado desde la l\u00EDnea de comandos o "EMBEDDED" para un servidor aut\u00F3nomo  lanzado como parte incorporada de una aplicaci\u00F3n que se ejecuta en la misma m\u00E1quina virtual .
domain.list-unclean-host-unregistrations=Retorna una lista de los nombres de hosts, cuyo registro no fue cancelado correctamente. Esto pudo haberse debido a un problema con los hosts listados.
domain.reload-servers=Recarga todos los servidores que se est\u00E1n ejecutando en el dominio.
domain.reload-servers.blocking=Espera hasta que el inicio de los servidores haya completado antes de retornar de la operaci\u00F3n.
domain.reload-servers.timeout=El tiempo de espera de apagado normal. Si es un cero, entonces no se intentar\u00E1 el apagado normal, si es un 1, entonces el servidor esperar\u00E1 a que se produzca el apagado normal indefinidamente.
domain.reload-servers.start-mode=El modo en el que los servidores se deben recargar puede ser suspendido o normal.
domain.restart-servers=Reinicia todos los servidores ejecutando actualmente en el dominio.
domain.restart-servers.blocking=Espera hasta que el inicio de los servidores haya completado antes de retornar de la operaci\u00F3n.
domain.restart-servers.timeout=El tiempo de espera de apagado normal. Si es un cero, entonces no se intentar\u00E1 el apagado normal, si es un 1, entonces el servidor esperar\u00E1 a que se produzca el apagado normal indefinidamente.
domain.restart-servers.start-mode=El modo en el que los servidores se deben reiniciar puede ser suspendido o normal.
domain.start-servers=Inicia todos los servidores configurados en el dominio que no est\u00E1n ejecutando actualmente.
domain.start-servers.blocking=Espera hasta que el inicio de los servidores haya completado antes de retornar de la operaci\u00F3n.
domain.start-servers.start-mode=El modo en el que los servidores se deben comenzar a ejecutar puede ser suspendido o normal.
domain.stop-servers=Detiene todos los servidores ejecutando actualmente en el dominio.
domain.stop-servers.blocking=Espera hasta que los servidores hayan parado antes de retornar de la operaci\u00F3n.
domain.stop-servers.timeout=El tiempo de espera de apagado normal. Si es un cero, entonces no se intentar\u00E1 el apagado normal, si es un 1, entonces el servidor esperar\u00E1 a que se produzca el apagado normal indefinidamente.
domain.resume-servers=Reanuda el procesamiento en todos los servidores en el dominio
domain.suspend-servers=Suspende todos los servidores en el dominio, todas las operaciones actuales finalizar\u00E1n y no se permitir\u00E1n nuevas operaciones.
domain.suspend-servers.timeout=Tiempo de espera en segundos. Si es cero entonces la operaci\u00F3n retornar\u00E1 inmediatamente, -1 significa que esperar\u00E1 indefinidamente. Note que la operaci\u00F3n no se deshar\u00E1 si el tiempo de espera sobrepasa, esto solo significa que no todas las peticiones actuales se completaron en el tiempo de espera especificado.
profile=Un grupo nombrado de configuraciones del sub-sistema.
profile.name=El nombre del perfil
profile.add=Agregar un nuevo 'profile'
profile.add.includes=El valor del nuevo atributo 'includes' del perfil
profile.describe=Presenta como salida los sub-sistemas del perfil como una lista de operaciones que se pueden ejecutar para crear el mismo modelo
profile.remove=Borrar un 'profile'
profile.remove.name=El valor del atributo 'name' del perfil
profile.includes=Una lista de los nombres de perfiles a incluir en este perfil. La sobrescritura de los subsistemas no tiene soporte.
profile.include.profile=El nombre del perfil inclu\u00EDdo
profile.includes.add=Agregar un perfil a la lista de los perfiles inclu\u00EDdos
profile.includes.add.include=El nombre del perfil inclu\u00EDdo
profile.includes.remove=Borrar un perfil de la lista de perfiles inclu\u00EDdos
profile.includes.remove.include=El nombre del perfil inclu\u00EDdo
profile.subsystem=Los sub-sistemas que componen el perfil.
profile.clone=Clona esta perfil. El clon es una copia de toda la configuraci\u00F3n del perfil y subsistemas.
profile.clone.to-profile=El nombre del nuevo perfil a ser creado.
server-group=La configuraci\u00F3n del grupo de servidores.
server-group.add=Agregar un nuevo grupo de servidores.
server-group.add.jvm=El nombre de la mvj.
server-group.remove=Borra un nuevo grupo de servidores existente.
server-group.profile=El nombre del perfil.
server-group.jvm=La mvj nombrada.
server-group.socket-binding-group=El grupo de enlace de sockets predeterminado utilizado para los servidores asociados con este grupo.
server-group.socket-binding-default-interface=El grupo de enlaces de sockets predeterminado para este servidor.
server-group.socket-binding-port-offset=La compensaci\u00F3n predeterminada a agregar a los valores de puerto dados por el grupo de enlace de sockets. 
server-group.management-subsystem-endpoint=Configurado como 'true' para que los servidores que pertenecen al grupo de servidores se reconecten al controlador host  mediante el punto de acceso de su sub-sistema remoto. El sub-sistema debe estar presente para que esto funcione.
server-group.deployment=Una lista de implementaciones disponibles en el grupo de servidores.
server-group.system-property=Una lista de propiedades del sistema para establecer en este grupo de servidores.
server-group.deployment.remove=Borra una implementaci\u00F3n de la lista de contenido disponible en los servidores en el grupo. Si la implementaci\u00F3n actualmente se implementa en el tiempo de ejecuci\u00F3n primero se borrar\u00E1 la implementaci\u00F3n.
server-group.reload-servers=Recarga todos los servidores que pertenecen al grupo de servidores actualmente ejecutando en el dominio.
server-group.reload-servers.blocking=Espera hasta que el inicio de los servidores haya completado antes de retornar de la operaci\u00F3n.
server-group.reload-servers.timeout=El tiempo de espera de apagado normal. Si es un cero, entonces no se intentar\u00E1 el apagado normal, si es un 1, entonces el servidor esperar\u00E1 a que se produzca el apagado normal indefinidamente.
server-group.reload-servers.start-mode=El modo en el que los servidores se deben comenzar a ejecutar puede ser suspendido o normal.
server-group.restart-servers=Reinicia todos los servidores que pertenecen al grupo de servidores actualmente ejecutando en el dominio.
server-group.restart-servers.blocking=Espera hasta que el inicio de los servidores haya completado antes de retornar de la operaci\u00F3n.
server-group.restart-servers.timeout=El tiempo de espera de apagado normal. Si es un cero, entonces no se intentar\u00E1 el apagado normal, si es un 1, entonces el servidor esperar\u00E1 a que se produzca el apagado normal indefinidamente.
server-group.restart-servers.start-mode=El modo en el que los servidores se deben reiniciar puede ser suspendido o normal.
server-group.start-servers=Inicia todos los servidores configurados que pertenecen al grupo de servidores en el dominio que no se est\u00E1n ejecutando actualmente.
server-group.start-servers.blocking=Espera hasta que el inicio de los servidores haya completado antes de retornar de la operaci\u00F3n.
server-group.start-servers.start-mode=El modo en el que los servidores se deben comenzar a ejecutar puede ser suspendido o normal.
server-group.stop-servers=Detiene todos los servidores que pertenecen al grupo de servidores actualmente ejecutando en el dominio.
server-group.stop-servers.blocking=Espera hasta que los servidores hayan parado completamente antes de retornar de la operaci\u00F3n.
server-group.stop-servers.timeout=El tiempo de espera de apagado normal. Si es un cero, entonces no se intentar\u00E1 el apagado normal, si es un 1, entonces el servidor esperar\u00E1 a que se produzca el apagado normal indefinidamente.
server-group.suspend-servers=Suspende operaciones en todos los servidores en el grupo de servidores, Todas las operaciones actuales finalizar\u00E1n y no se permitir\u00E1n nuevas operaciones.
server-group.suspend-servers.timeout=Tiempo de espera en segundos. Si es cero entonces la operaci\u00F3n retornar\u00E1 inmediatamente, -1 significa que esperar\u00E1 indefinidamente. Note que la operaci\u00F3n no se deshar\u00E1 si el tiempo de espera sobrepasa, esto solo significa que no todas las peticiones actuales se completaron en el tiempo de espera especificado.
server-group.resume-servers=Reanuda las operaciones en el grupo de servidores
server-group.deployment-overlay=Enlaces entre una capa de implementaci\u00F3n definida y las implementaciones en este grupo de servidores
server-group.deployment-overlay.add=Agrega un enlace a una capa de implementaci\u00F3n 
server-group.deployment-overlay.redeploy-links=Vuelve a realizar las implementaciones afectadas por esta superposici\u00F3n
server-group.deployment-overlay.redeploy-links.deployments=Lista de nombres de tiempos de ejecuci\u00F3n de implementaci\u00F3n que deben reimplementarse. Si esta lista se encuentra vac\u00EDa o 'indefinida', se reimplementar\u00E1n todas las implementaciones afectadas.
server-group.deployment-overlay.remove=Borra un enlace a una capa de implementaci\u00F3n 
server-group.deployment-overlay.deployment=Una implementaci\u00F3n a la cual se le aplica esta capa
server-group.deployment-overlay.deployment.add=Agrega un enlace entre una implementaci\u00F3n y esta capa
server-group.deployment-overlay.deployment.remove=Borra un enlace entre una implementaci\u00F3n y esta capa
server-group.deployment-overlay.deployment.remove.redeploy-affected=Si se establece como 'verdadero', vuelva a realizar las implementaciones afectadas por esta superposici\u00F3n despu\u00E9s de la eliminaci\u00F3n.
server-group.deployment-overlay.deployment.regular-expression=Si el nombre de la implementaci\u00F3n se debe tratar como una expresi\u00F3n regular
host-exclude=Configuraciones de recursos que deben ser ocultadas por el controlador de dominio desde algunos controladores de host esclavos que est\u00E9n ejecut\u00E1ndose en una versi\u00F3n espec\u00EDfica.
host-exclude.add=Agrega la configuraci\u00F3n host-ignore. La adici\u00F3n no afecta ninguno de los hosts actualmente registrados.
host-exclude.remove=Retira una configuraci\u00F3n host-ignore. La remoci\u00F3n no afecta a ning\u00FAn host registrado.
host-exclude.management-major-version=La versi\u00F3n mayor de la API de administraci\u00F3n de kernel que tiene soporte de esclavos, que deber\u00EDan afectarse  por esta configuraci\u00F3n.
host-exclude.management-minor-version=La versi\u00F3n menor de la API de administraci\u00F3n de kernel que tiene soporte de esclavos, que deber\u00EDan afectarse  por esta configuraci\u00F3n.
host-exclude.management-micro-version=La microversi\u00F3n de la API de administraci\u00F3n de kernel que tiene soporte de esclavos, que deber\u00EDan afectarse  por esta configuraci\u00F3n. Si no est\u00E1 definida, esta configuraci\u00F3n aplica a todos los lanzamientos de la versi\u00F3n mayor o menor, excluyendo cualquiera que est\u00E9  presente para una configuraci\u00F3n diferente con una microversi\u00F3n tambi\u00E9n especificada. 
host-exclude.host-release=Un identificador abreviado para una EAP o WildFly Core conocido basado en distribuci\u00F3n de software  ejecutado por un controlador de host esclavo mediante esta configuraci\u00F3n. Es una alternativa m\u00E1s sencilla para especificar las versiones API de administraci\u00F3n de kernel.
host-exclude.excluded-extensions=Una lista de nombres de extensi\u00F3n cuyos recursos (/extension\=X)  deben ocultar de los hosts de destino.
host-exclude.active-server-groups=Una lista de nombres de grupo de servidores que los recursos asociados deben ocultar de los hosts de destino. Estos son los grupos utilizados por los servidores de hosts. El server-group y el perfil  relacionado, el socket-binding-group y los recursos de implementaci\u00F3n no ser\u00E1n ocultados; todos los dem\u00E1s s\u00ED lo ser\u00E1n.
host-exclude.active-socket-binding-groups=Una lista de nombres de socket-binding-group que especifica todos los enlaces de sockets utilizados por servidores que se ejecutan en los hosts de destino. \u00DAnicamente se utiliza si 'active-server-groups' est\u00E1 configurado;  de lo contrario, se ignora. Solamente necesita establecerse si los grupos de enlaces de sockets especificados en la configuraci\u00F3n de los grupos de servidores listados en 'active-server-groups' no son el set completo de grupo de enlaces de sockets utilizado en los recursos 'server-config' de los hosts de destino).
rollout-plans=Informaci\u00F3n de almacenamiento sobre un grupo de planes de implementaci\u00F3n de actualizaci\u00F3n de administraci\u00F3n nombrados para los clientes de administraci\u00F3n que se almacenan en el repositorio de contenido del dominio. Los recursos hijos bajo este recurso proporcionan acceso a estos planes para los clientes de administraci\u00F3n permiti\u00E9ndoles usar los planes al hacer referencia a ellos por nombre, evitando as\u00ED la necesidad de recrearlos para cada uso.
rollout-plans.hash=El hash de todos los planes de implementaci\u00F3n almacenados. Utilizados internamente por los controladores host para ubicar el contenido del plan de despliegue.
rollout-plans.add=Agrega la funcionalidad para almacenar planes de implementaci\u00F3n nombrados.
rollout-plans.remove=Borra la funcionalidad para almacenar planes de implementaci\u00F3n nombrados.
rollout-plan=Un plan de despliegue almacenado.
rollout-plan.hash=El hash del contenido del plan de despliegue.
rollout-plan.content=El contenido del plan de despliegue en forma JBoss DMR.
rollout-plan.add=Agrega un plan de despliegue al almacenamiento persistente.
rollout-plan.remove=Borra un plan de despliegue del almacenamiento persistente.
rollout-plan.store=Actualiza el contenido de un plan de despliegue persistido ya existente despu\u00E9s de chequear primero que los par\u00E1metros 'hash' proporcionados coincidan con el hash del plan de despliegue actual. Falla si los hashes no coinciden. El utilizar esta operaci\u00F3n en lugar de la operaci\u00F3n 'write-attribute' para el atributo 'content' proporciona una garant\u00EDa de que la actualizaci\u00F3n no crear\u00E1 conflicto con una actualizaci\u00F3n anterior desconocida para el que realiza la llamada.
rollout-plan.store.hash=El valor que el que realiza la llamada cree que es el hash de contenido del plan de despliegue que se est\u00E1 reemplazando.
rollout-plan.store.content=El contenido actualizado del plan de despliegue en forma JBoss DMR.
domain.resolve-expression-on-domain=Operaci\u00F3n que acepta una expresi\u00F3n como entrada (o una cadena que se puede analizar sint\u00E1cticamente en una expresi\u00F3n) y la resuelve frente a las propiedades locales del sistema y variables del entorno en todos los servidores en el dominio.
domain.resolve-expression-on-domain.expression=La expresi\u00F3n a resolver.
domain.resolve-expression-on-domain.reply=La expresi\u00F3n resuelta o la cadena forman el valor de la entrada original si no representaba una expresi\u00F3n.
host-connection=Informaci\u00F3n sobre el estado de una conexi\u00F3n de un controlador de host esclavo 
host-connection.connected=Si el controlador de host est\u00E1 conectado o no.
host-connection.events=Los eventos de host esclavo.
host-connection.events.address=La direcci\u00F3n del host esclavo, si est\u00E1 disponible.
host-connection.events.timestamp=La hora del evento.
host-connection.events.type=El estado de la conexi\u00F3n del host-controller
host-connection.prune-expired=Recortar las entradas de los eventos de hosts expirados. 
host-connection.prune-disconnected=Recortar la informaci\u00F3n sobre todos los hosts desconectados.
