domain=Der Root-Knoten des Management-Modells auf der Domain-Ebene.
domain.name=Der Name der dieser Domain gegeben wurde.
domain.extension=Eine Liste von Erweiterungsmodulen.
domain.path=Eine Liste benannter Dateisystem-Pfade. Die Pfade k\u00F6nnen vollst\u00E4ndig festgelegt sein oder nicht (d.h. die tats\u00E4chlichen Pfade beinhalten).
domain.core-service=Konfiguration der von den gemanagten Domain Hosts und Servern bereitgestellten Kerndienste.
domain.profile=Eine Liste von in der Domain verf\u00FCgbaren Profilen
domain.interface=Eine Liste von in der Domain verf\u00FCgbaren benannten Netzwerk-Interface. Die Interfaces k\u00F6nnen vollst\u00E4ndig festgelegt sein oder nicht (d.h. die Kriterien zur Bestimmung der IP-Adresse beinhalten).
domain.socket-binding-group=Eine Liste von in der Domain verf\u00FCgbaren Socket-Binding-Gruppen
domain.system-property=Eine Liste von an allen Servern in der Domain einzustellenden System-Properties. 
domain.deployment=Eine Liste von in der Domain verf\u00FCgbaren Deployments
domain.deployment-overlay=Eine Liste der f\u00FCr den Server verf\u00FCgbaren Deployment-Overlays
domain.server-group=Eine Liste von in der Domain verf\u00FCgbaren Servergruppen
domain.host-exclude=Eine List mit Konfigurationen von Ressourcen, die der Domain-Controller vor bestimmten Slave-Host-Controllern verbergen sollte.
domain.local-host-name=Der Name des lokal laufenden Host-Controllers.
domain.host=Aktuell in der Domain laufende Host-Controller
domain.domain-organization=Hinweis auf die aktuelle Organisation, zu der diese Domain geh\u00F6rt.
domain.process-type=Der Prozesstyp, der von dieser Root-Ressource repr\u00E4sentiert wird. Entweder "Domain Controller" oder "Host Controller".
domain.release-version=Die Version der WildFly Core Release, die auf dem Host-Controller l\u00E4uft, der als Domain-Controller fungiert.
domain.release-codename=Der Codename der WildFly Core Release, die auf dem Host-Controller l\u00E4uft, der als Domain-Controller fungiert.
domain.management-client-content=F\u00FCr diese Domain definierte Rollout-Pl\u00E4ne.
domain.product-name=Der Name des WildFly Core basierten Produkts, das auf dem Host-Controller l\u00E4uft, der als Domain-Controller fungiert.
domain.product-version=Die Version der WildFly Core basierten Produkt-Release, das auf dem Host-Controller l\u00E4uft, der als Domain-Controller fungiert.
domain.management-major-version=Die Hauptversion des WildFly Core Management-Interface, das vom Host-Controller, der als Domain-Controller fungiert, bereitgestellt wird.
domain.management-minor-version=Die Nebenversion des WildFly Core Management-Interface, das vom Host-Controller, der als Domain-Controller fungiert, bereitgestellt wird.
domain.management-micro-version=Die Micro-Version des WildFly Core Management-Interface, das vom Host-Controller, der als Domain-Controller fungiert, bereitgestellt wird.
domain.deployment.remove=Entfernen eines Deployments von der Liste der in der Domain verf\u00FCgbaren Inhalte. Das Deployment darf derzeit nicht zu Servergruppen zugewiesen sein.
domain.namespaces=Map von im Konfigurations-XML-Dokument verwendeten Namespaces, wobei Schl\u00FCssel Namespace-Pr\u00E4fixe und Werte Schema-URIs sind.
domain.schema-locations=Map von im Konfigurations-XML-Dokument verwendeten Speicherorten, wobei Schl\u00FCssel Schema-URIs und Werte die Speicherorte sind, an denen sich die Schema befindet.
domain.launch-type=Die Art, auf die der Server-Prozess gestartet wurde. Entweder "DOMAIN" f\u00FCr einen Server im Domain-Modus, gestartet von einem Host Controller, "STANDALONE" f\u00FCr einen eigenst\u00E4ndigen Server, gestartet von der Befehlszeile, oder "EMBEDDED" f\u00FCr einen eigenst\u00E4ndigen Server, gestartet als eingebetteter Teil einer Applikation, die in derselben virtuellen Maschine l\u00E4uft.
domain.list-unclean-host-unregistrations=Gibt eine Liste mit Hostnamen aus, die nicht ordnungsgem\u00E4\u00DF de-registriert wurden. Dies kann auf ein Problem mit den aufgef\u00FChrten Hosts hinweisen.
domain.reload-servers=L\u00E4dt alle aktuell in der Domain laufenden Server neu.
domain.reload-servers.blocking=Warten, bis alle Server vollst\u00E4ndig neu gestartet sind, bevor von der Operation zur\u00FCckgekehrt werden soll.
domain.reload-servers.timeout=Der Timeout f\u00FCr ordnungsgem\u00E4\u00DFes Herunterfahren. Falls Null, wird ein ordnungsgem\u00E4\u00DFes Herunterfahren nicht versucht; falls -1, wartet der Server unbegrenzt auf das ordnungsgem\u00E4\u00DFe Herunterfahren.
domain.reload-servers.start-mode=Der Modus, in dem die Server neu geladen werden sollen; kann entweder "suspend" (anhalten) oder "normal" sein.
domain.restart-servers=Startet alle aktuell in der Domain laufenden Server neu.
domain.restart-servers.blocking=Warten, bis alle Server vollst\u00E4ndig neu gestartet sind, bevor von der Operation zur\u00FCckgekehrt werden soll.
domain.restart-servers.timeout=Der Timeout f\u00FCr ordnungsgem\u00E4\u00DFes Herunterfahren. Falls Null, wird ein ordnungsgem\u00E4\u00DFes Herunterfahren nicht versucht; falls -1, wartet der Server unbegrenzt auf das ordnungsgem\u00E4\u00DFe Herunterfahren.
domain.restart-servers.start-mode=Der Modus, in dem die Server neu gestartet werden sollen; kann entweder "suspend" (anhalten) oder "normal" sein.
domain.start-servers=Startet alle konfigurierten Server in der Domain, die zum aktuellen Zeitpunkt nicht laufen. 
domain.start-servers.blocking=Warten, bis alle Server vollst\u00E4ndig neu gestartet sind, bevor von der Operation zur\u00FCckgekehrt werden soll.
domain.start-servers.start-mode=Der Startmodus, in dem die Server ausgef\u00FChrt werden sollen; kann entweder "suspend" (anhalten) oder "normal" sein.
domain.stop-servers=Stoppt alle aktuell in der Domain laufenden Server.
domain.stop-servers.blocking=Warten, bis alle Server vollst\u00E4ndig gestoppt sind, bevor von der Operation zur\u00FCckgekehrt werden soll.
domain.stop-servers.timeout=Der Timeout f\u00FCr ordnungsgem\u00E4\u00DFes Herunterfahren. Falls Null, wird ein ordnungsgem\u00E4\u00DFes Herunterfahren nicht versucht; falls -1, wartet der Server unbegrenzt auf das ordnungsgem\u00E4\u00DFe Herunterfahren.
domain.resume-servers=Mit der Verarbeitung auf allen Servern in der Domain fortfahren
domain.suspend-servers=H\u00E4lt alle Server in der Domain an, alle aktuellen Operationen werden abgeschlossen und keine neuen Operationen werden zugelassen.
domain.suspend-servers.timeout=Timeout in Sekunden. Ist dies Null, so erfolgt eine sofortige Wiedergabe der Operation, -1 bedeutet, dass unendlich lange gewartet wird. Beachten Sie, dass die Operation nicht zur\u00FCckgesetzt wird, wenn der Timeout \u00FCberschritten wird, es bedeutet lediglich, dass nicht alle aktuellen Anfragen im festgelegten Timeout beendet wurden.
profile=Ein benannter Satz von Untersystem Konfigurationen.
profile.name=Der Name des Profils
profile.add=Ein neues 'profile' hinzuf\u00FCgen
profile.add.includes=Der Wert des 'includes'-Attributs des neuen Profils
profile.describe=Gibt die Untersysteme des Profils als eine Liste von Operationen aus, die zur Erstellung desselben Modells ausgef\u00FChrt werden kann
profile.remove=Entfernt ein 'profile'
profile.remove.name=Der Wert des 'name'-Attributs des Profils
profile.includes=Eine Liste mit Namen von Profilen, die in diesem Profil einbezogen werden sollen. Das au\u00DFer Kraft setzen von Untersystemen wird nicht unterst\u00FCtzt.
profile.include.profile=Der Name des eingeschlossenen Profils
profile.includes.add=Der Liste eingeschlossener Profile ein Profil hinzuf\u00FCgen
profile.includes.add.include=Der Name des eingeschlossenen Profils
profile.includes.remove=Ein Profil aus der Liste eingeschlossener Profile entfernen
profile.includes.remove.include=Der Name des eingeschlossenen Profils
profile.subsystem=Die Untersysteme, aus denen das Profil besteht.
profile.clone=Klont dieses Profil in ein neues Profil. Der Klon ist eine Kopie aller Konfigurationen und Untersysteme dieses Profils.
profile.clone.to-profile=Der Name des neu zu erstellenden Profils.
server-group=Die Servergruppen-Konfiguration.
server-group.add=Hinzuf\u00FCgen einer neuen Servergruppe.
server-group.add.jvm=Der jvm-Name.
server-group.remove=Entfernen einer bestehenden Servergruppe.
server-group.profile=Der Profilname.
server-group.jvm=Die benannte jvm.
server-group.socket-binding-group=Die standardm\u00E4\u00DFig verwendete Socket-Binding-Gruppe f\u00FCr mit dieser Gruppe assoziierten Server. 
server-group.socket-binding-default-interface=Das standardm\u00E4\u00DFige Interface der Socket-Binding-Gruppe f\u00FCr diesen Server.
server-group.socket-binding-port-offset=Der Standard-Offset, der auf die Port-Werte aufgeschlagen wird, die von der Socket-Binding-Gruppe angegeben sind.
server-group.management-subsystem-endpoint=Setzen Sie dies auf 'true', damit die Server in der Servergruppe sich mit dem Host-Controller r\u00FCckverbinden unter Verwendung des Endpunkts von ihrem Remoting-Untersystem. Damit dies funktionieren kann, muss dieses Untersystem vorhanden sein.
server-group.deployment=Eine Liste von in der Servergruppe verf\u00FCgbaren Deployments.
server-group.system-property=Eine Liste von an allen Servern in dieser Servergruppe  einzustellenden Systemeigenschaften. 
server-group.deployment.remove=Entfernen eines Deployments von der Liste der auf Servern in der Gruppe verf\u00FCgbaren Inhalte. Falls das Deployment derzeit in Laufzeitsystemen bereitgestellt wird, wird diese Bereitstellung zun\u00E4chst zur\u00FCckgenommen.
server-group.reload-servers=L\u00E4dt alle Server neu, die zu der Servergruppe geh\u00F6ren, die aktuell in der Domain laufen.
server-group.reload-servers.blocking=Warten, bis alle Server vollst\u00E4ndig neu gestartet sind, bevor von der Operation zur\u00FCckgekehrt werden soll.
server-group.reload-servers.timeout=Der Timeout f\u00FCr ordnungsgem\u00E4\u00DFes Herunterfahren. Falls Null, wird ein ordnungsgem\u00E4\u00DFes Herunterfahren nicht versucht; falls -1, wartet der Server unbegrenzt auf das ordnungsgem\u00E4\u00DFe Herunterfahren.
server-group.reload-servers.start-mode=Der Startmodus, in dem die Server neu geladen werden sollen; kann entweder "suspend" (anhalten) oder "normal" sein.
server-group.restart-servers=Startet alle Server neu, die zu der Servergruppe geh\u00F6ren, die aktuell in der Domain laufen.
server-group.restart-servers.blocking=Warten, bis alle Server vollst\u00E4ndig neu gestartet sind, bevor von der Operation zur\u00FCckgekehrt werden soll.
server-group.restart-servers.timeout=Der Timeout f\u00FCr ordnungsgem\u00E4\u00DFes Herunterfahren. Falls Null, wird ein ordnungsgem\u00E4\u00DFes Herunterfahren nicht versucht; falls -1, wartet der Server unbegrenzt auf das ordnungsgem\u00E4\u00DFe Herunterfahren.
server-group.restart-servers.start-mode=Der Modus, in dem die Server neu gestartet werden sollen; kann entweder "suspend" (anhalten) oder "normal" sein.
server-group.start-servers=Startet alle konfigurierten Server in der Domain, die zu der Servergruppe geh\u00F6ren, die zum aktuellen Zeitpunkt nicht laufen. 
server-group.start-servers.blocking=Warten, bis alle Server vollst\u00E4ndig neu gestartet sind, bevor von der Operation zur\u00FCckgekehrt werden soll.
server-group.start-servers.start-mode=Der Startmodus, in dem die Server ausgef\u00FChrt werden sollen; kann entweder "suspend" (anhalten) oder "normal" sein.
server-group.stop-servers=Stoppt alle Server, die zu der Servergruppe geh\u00F6ren, die aktuell in der Domain laufen.
server-group.stop-servers.blocking=Warten, bis alle Server vollst\u00E4ndig gestoppt sind, bevor von der Operation zur\u00FCckgekehrt werden soll.
server-group.stop-servers.timeout=Der Timeout f\u00FCr ordnungsgem\u00E4\u00DFes Herunterfahren. Falls Null, wird ein ordnungsgem\u00E4\u00DFes Herunterfahren nicht versucht; falls -1, wartet der Server unbegrenzt auf das ordnungsgem\u00E4\u00DFe Herunterfahren.
server-group.suspend-servers=H\u00E4lt Operationen auf allen Servern in der Servergruppe an. Alle aktuellen Operationen d\u00FCrfen abschlie\u00DFen, und neue Operationen werden abgelehnt.
server-group.suspend-servers.timeout=Timeout in Sekunden. Ist dies Null, so erfolgt eine sofortige Wiedergabe der Operation, -1 bedeutet, dass unendlich lange gewartet wird. Beachten Sie, dass die Operation nicht zur\u00FCckgesetzt wird, wenn der Timeout \u00FCberschritten wird, es bedeutet lediglich, dass nicht alle aktuellen Anfragen im festgelegten Timeout beendet wurden.
server-group.resume-servers=F\u00FChrt die Operationen auf allen Servern in der Servergruppe fort
server-group.deployment-overlay=Linkt zwischen einem definierten Deployment-Overlay und Deployments in dieser Servergruppe
server-group.deployment-overlay.add=F\u00FCgt einem Deployment-Overlay ein Link hinzu
server-group.deployment-overlay.redeploy-links=Stellt die von diesem Overlay betroffenen Deployments erneut bereit.
server-group.deployment-overlay.redeploy-links.deployments=Liste der Deployment-Laufzeitnamen, die erneut bereitgestellt werden sollen. Wenn diese Liste leer oder "nicht definiert" ist, werden alle betroffenen Deployments erneut bereitgestellt.
server-group.deployment-overlay.remove=Entfernt ein Link aus einem Deployment-Overlay
server-group.deployment-overlay.deployment=Ein Deployment, an dem ein Overlay angewendet wird
server-group.deployment-overlay.deployment.add=F\u00FCgt ein Link zwischen einem Deployment und diesem Overlay hinzu
server-group.deployment-overlay.deployment.remove=Entfernt ein Link zwischen einem Deployment und diesem Overlay hinzu
server-group.deployment-overlay.deployment.remove.redeploy-affected=Bei Festlegung auf "true" werden alle von diesem Overlay betroffenen Deployments nach dem Entfernen erneut bereitgestellt.
server-group.deployment-overlay.deployment.regular-expression=Ob der Deployment-Name wie ein regul\u00E4rer Ausdruck behandelt werden soll
host-exclude=Konfiguration von Ressourcen, die der Domain-Controller vor einem Slave-Host-Controller verbergen sollte, der eine bestimmte Version ausf\u00FChrt.
host-exclude.add=F\u00FCgt eine host-ignore Konfiguration hinzu. Dies hat keine Auswirkungen auf derzeit registrierte Hosts.
host-exclude.remove=Entfernt eine host-ignore Konfiguration. Dies hat keine Auswirkungen auf derzeit registrierte Hosts.
host-exclude.management-major-version=Die Hauptversion der Kernel-Management-API, die von Slaves unterst\u00FCtzt wird, die von dieser Konfiguration betroffen sein sollten.
host-exclude.management-minor-version=Die Nebenversion der Kernel-Management-API, die von Slaves unterst\u00FCtzt wird, die von dieser Konfiguration betroffen sein sollten.
host-exclude.management-micro-version=Die Mikroversion der Kernel-Management-API, die von Slaves unterst\u00FCtzt wird, die von dieser Konfiguration betroffen sein sollten. Falls nicht definiert, gilt diese Konfiguration f\u00FCr alle Releases der angegebenen Haupt- und Nebenversion, au\u00DFer f\u00FCr jene, f\u00FCr die eine andere Konfiguration mit einer ebenfalls angegeben Mikroversion vorhanden ist.
host-exclude.host-release=Eine Kurz-ID f\u00FCr eine bekannte EAP oder WildFly Core basierte Software-Distribution, die von einem Slave-Host-Controller ausgef\u00FChrt wird und von dieser Konfiguration betroffen sein sollte. Verwendet als einfache Alternative zur Angabe der Kernel-Management-API-Versionen.
host-exclude.excluded-extensions=Eine Liste mit Erweiterungsnamen, deren Ressourcen (/extension\=X) vor den Ziel-Hosts verborgen sein sollen.
host-exclude.active-server-groups=Eine Liste mit Servergruppen-Namen, deren zugeh\u00F6rige Ressourcen vor den Ziel-Hosts verborgen sein sollten. Dies sind die Gruppen, die von den Host-Servern verwendet werden. Die server-group und das zugeh\u00F6rige Profil, sowie socket-binding-group und Deployment-Ressourcen werden nicht verborgen; alles andere wird verborgen.
host-exclude.active-socket-binding-groups=Eine Liste mit socket-binding-group Namen, die alle Socket-Binding-Gruppen angibt, die von den Servern auf den Ziel-Hosts verwendet werden. Dies wird nur verwendet, falls "active-server-groups" eingestellt ist, andernfalls wird es ignoriert. Dies muss nur eingestellt werden, falls es sich bei den Socket-Binding-Gruppen in der Konfiguration der Server-Gruppen, die in "active-server-groups" aufgef\u00FChrt sind, nicht um die vollst\u00E4ndige Liste der Socket-Binding-Gruppen handelt, die auf den Servern verwendet werden (d.h. weitere Socket-Binding-Gruppen sind in den "server-config" Ressourcen des Ziel-Hosts konfiguriert.)
rollout-plans=Speicher Information f\u00FCr eine Reihe von benannten Management-Aktualisierungs-Einf\u00FChrungspl\u00E4nen, n\u00FCtzlich f\u00FCr Management-Kunden, die in der Domain Content Repository gespeichert sind. Die untergeordneten Ressourcen unter dieser Ressource bieten Zugriff auf diese Pl\u00E4ne f\u00FCr Management-Kunden, so dass Kunden diese Pl\u00E4ne durch Verweis auf ihre Namen benutzen k\u00F6nnen und die Notwendigkeit vermeiden, sie f\u00FCr jeden Einsatz neu zu erstellen.
rollout-plans.hash=Der Hash aller gespeicherten Rollout-Pl\u00E4ne. Wird intern von den Host-Controllern zum Auffinden von Rollout-Plan-Inhalten verwendet.
rollout-plans.add=F\u00FCgt die Capability zum Speichern benannter Rollout-Pl\u00E4ne hinzu.
rollout-plans.remove=Entfernt die F\u00E4higkeit, benannte Rollout-Pl\u00E4ne zu speichern.
rollout-plan=Ein gespeicherter Rollout-Plan.
rollout-plan.hash=Der Hash der Rollout-Plan Inhalte.
rollout-plan.content=Die Inhalte des Rollout-Plans in JBoss DMR-Form.
rollout-plan.add=F\u00FCgt dem persistenten Speicher einen Rollout-Plan hinzu.
rollout-plan.remove=Entfernt einen Rollout-Plan aus dem persistenten Speicher.
rollout-plan.store=Aktualisiert die Inhalte eines bestehenden, persistierten Rollout-Plans, nachdem zuerst gepr\u00FCft wurde, ob der bereitgestellte  'hash'-Parameter mit dem aktuellen Rollout-Plan-Hash \u00FCbereinstimmt. Sch\u00E4gt fehl, wenn die Hashes nicht \u00FCbereinstimmen. Die Verwendung dieser Operation statt der  'write-attribute'-Operation f\u00FCr das 'content'-Attribute ist eine Garantie daf\u00FCr, dass die Aktualisierung nicht im Konflikt mit einer fr\u00FCheren, dem Aufrufer unbekannten Aktualisierung steht.
rollout-plan.store.hash=Der Wert, von dem der Aufrufer glaubt, dass er dem Hash des zu ersetzenden Rollout-Plan-Contents entspricht.
rollout-plan.store.content=Die aktualisierten Inhalte des Rollout-Plans in JBoss DMR-Form.
domain.resolve-expression-on-domain=Operation, die einen Ausdruck als Eingabe akzeptiert (oder einen String, der in einen Ausdruck umgewandelt werden kann) und diesen anhand der lokalen Systemeigenschaften und Umgebungsvariablen auf allen Servern in der Domain aufl\u00F6st.
domain.resolve-expression-on-domain.expression=Der aufzul\u00F6sende Ausdruck.
domain.resolve-expression-on-domain.reply=Der aufgel\u00F6ste Ausdruck oder die String-Form des urspr\u00FCnglichen Eingabewerts, falls dieser keinen Ausdruck repr\u00E4sentierte. 
host-connection=Informationen \u00FCber den Verbindungsstatus eines Slave-Host-Controllers.
host-connection.connected=Ob der Host-Controller verbunden ist.
host-connection.events=Die Slave-Host-Ereignisse.
host-connection.events.address=Die Slave-Host-Adresse, falls verf\u00FCgbar.
host-connection.events.timestamp=Die Zeit des Ereignisses.
host-connection.events.type=Der Status der Host-Controller-Verbindung.
host-connection.prune-expired=Abgelaufene Host-Ereigniseintr\u00E4ge l\u00F6schen.
host-connection.prune-disconnected=Informationen \u00FCber alle nicht verbundenen Hosts l\u00F6schen.
