duplicateRealmInjection=No se puede inyectar el mismo \u00E1mbito '%s' en un \u00FAnico dominio de seguridad.
operationAddressMissingKey=La operaci\u00F3n no conten\u00EDa una direcci\u00F3n con valor para '%s'.
unableToStartService=No se pudo iniciar el servicio
unableToAccessKeyStore=No se puede acceder al almac\u00E9n de llaves para completar la b\u00FAsqueda solicitada.
requiredServiceNotUp=El servicio '%s' solicitado no est\u00E1 FUNCIONANDO, actualmente es '%s'.
invalidOperationName=Nombre de operaci\u00F3n inv\u00E1lido '%s' se esperaba uno de '%s'
unableToCompleteOperation=Imposible completar la operaci\u00F3n. '%s'
cantSaveWithoutFile=No se pudo guardar el almac\u00E9n de llaves - El archivo '%s' del almac\u00E9n de llaves no existe.
noSuitableProvider=No se encontr\u00F3 un proveedor adecuado para el tipo '%s'
defaultRealmNotReferenced=El default-realm '%s' no se encuentra en la lista de \u00E1mbitos [%s] a los que este dominio hace referencia.
unableToLoadPropertiesFiles=No se pudieron cargar los archivos de propiedades requeridos para iniciar el \u00E1mbito respaldado por el archivo de propiedades\: Archivo de usuarios\: '%s' Archivo de grupos\: '%s'
componentNotConfigurable=La implementaci\u00F3n del componente personalizado '%s' no implementa 'org.wildfly.extension.elytron.Configurable'; no obstante, se ha provisto la configuraci\u00F3n.
invalidRegularExpression=La expresi\u00F3n regular suministrada '%s' es inv\u00E1lida.
propertyFilesDoesNotExist=El archivo de propiedades al que se hace referencia en properties-realm no existe\: %s
unableToCreateManagerFactory=No se logr\u00F3 crear %s para el algoritmo '%s'. 
noTypeFound=No se encontr\u00F3 '%s' en el valor inyectado.
unableToReLoadPropertiesFiles=No se pudieron volver a cargar los archivos de propiedades requeridos por el \u00E1mbito respaldado por el archivo de propiedades.
exceptionWhileCreatingPermission=Excepci\u00F3n al crear el objeto del permiso para el mapeo del permiso. Verifique [class-name], [target-name] (nombre del permiso) y [action] de [%s].
keyStoreFileNotExists=El archivo del almac\u00E9n de llaves '%s' no existe y es requerido.
keyStoreFileNotExistsButIgnored=El archivo del almac\u00E9n de llaves '%s' no existe. Se utiliza en blanco.
certificateNotValid=El certificado [%s] en el almac\u00E9n de llaves no es v\u00E1lido
propertyFileIsInvalid=El archivo de propiedad al que se hace referencia es inv\u00E1lido\: %s
unableToObtainOidForX500Attribute=No se logr\u00F3 obtener OID para el atributo X.500 '%s'
x500AttributeMustBeDefined=El atributo X.500 se debe definir por nombre o por OID
invalidURL=No se logr\u00F3 analizar la URL '%s'
realmDoesNotSupportCache=El \u00E1mbito '%s' no soporta el cach\u00E9.
unableToAccessCRL=No se logr\u00F3 acceder al archivo CRL.
unableToReloadCRL=No se logr\u00F3 volver a cargar el archivo CRL.
unableToAccessEntryFromKeyStore=No se logr\u00F3 acceder a la entrada [%s] del almac\u00E9n de llaves [%s].
jdbcRealmOnlySingleKeyMapperAllowed=Una consulta principal solo puede tener un \u00FAnico mapeador de llaves
unableToLoadModule=No se puede cargar el m\u00F3dulo %s 
realmRefererencedTwice=Se ha hecho referencia en dos oportunidades al \u00E1mbito de seguridad '%s' en el mismo dominio de seguridad.
invalidTypeInjected=El valor inyectado no es del tipo '%s'.
credentialStoreEntryTypeNotSupported=El almac\u00E9n de credenciales '%s' no soporta el tipo de entrada '%s' del almac\u00E9n de credenciales dado 
keyStorePasswordCannotBeResolved=No se puede resolver la contrase\u00F1a para key-store "%s"
credentialStoreProtectionParameterCannotBeResolved=El par\u00E1metro de protecci\u00F3n "%s" del almac\u00E9n de credenciales no se puede resolver
credentialAlreadyExists=El alias de credenciales "%s" del tipo de credenciales "%s" ya existe en el almac\u00E9n
providerLoaderCannotSupplyProvider=El cargador del proveedor "%s" no puede suministrar el proveedor del almac\u00E9n de credenciales del tipo "%s"
credentialCannotBeResolved=No se puede resolver la credencial
dirContextPasswordCannotBeResolved=No se puede resolver la contrase\u00F1a para dir-context
credentialDoesNotExist=El alias de credenciales "%s" del tipo de credenciales "%s" no existe en el almac\u00E9n
identityAlreadyExists=Ya existe la identidad con el nombre  [%s].
couldNotCreateIdentity=No se pudo crear la identidad con el nombre [%s].
identityNotFound=No se encontr\u00F3 la identidad con el nombre  [%s].
couldNotDeleteIdentity=No se pudo eliminar la identidad con el nombre [%s].
identityNotAuthorized=No se autoriz\u00F3 la identidad con el nombre  [%s].
couldNotReadIdentity.2=No se pudo leer la identidad [%s] del dominio de seguridad [%s].
couldNotReadIdentity.1=No se pudo leer la identidad con el nombre [%s].
couldNotObtainAuthorizationIdentity=No se pudo obtener la identidad de autorizaci\u00F3n.
couldNotAddAttribute=No se logr\u00F3 agregar el atributo.
couldNotRemoveAttribute=No se logr\u00F3 eliminar el atributo.
couldNotCreatePassword=No se pudo crear la contrase\u00F1a.
unexpectedPasswordType=Tipo de contrase\u00F1a inesperado
patternRequiresCaptureGroup=El patr\u00F3n [%s] requiere un grupo de captura
invalidDefinition=Definici\u00F3n [%s] inv\u00E1lida. Solo una de '%s' o '%s' se puede establecer en un Objeto en la lista de filtros.
unableToPerformOutflow=No se puede realizar la salida autom\u00E1tica para '%s'
serverNotKnown=Se desconoce el servidor '%s'
invalidCipherSuiteFilter=Valor inv\u00E1lido para cipher-suite-filter. %s
# translation auto-copied from project JBoss AS, version 7.1.x, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LoggingMessages.i18n, author angela.garcia
invalidSize=Tama\u00F1o inv\u00E1lido %s
suffixContainsMillis=El sufijo (%s) no puede contener segundos o milisegundos.
invalidSuffix=El sufijo (%s) es inv\u00E1lido. Un sufijo debe tener un formato de fecha v\u00E1lido.
cannotRemoveDefaultPolicy=No se puede eliminar el proveedor de pol\u00EDticas predeterminado [%s]
failedToSetPolicy=Error al establecer la pol\u00EDtica [%s]
cannotFindPolicyProvider=No se pudo encontrar el proveedor de pol\u00EDticas con el nombre [%s]
failedToRegisterPolicyHandlers=Error al registrar los manejadores de contextos de pol\u00EDticas
failedToCreatePolicy=Error al crear la pol\u00EDtica [%s]
