io=Sous-syst\u00E8me d'entr\u00E9e et sortie
io.add=Sous-syst\u00E8me d'ajouts d'op\u00E9ration
io.remove=Sous-syst\u00E8me de suppressions d'op\u00E9ration
io.worker=D\u00E9finit les employ\u00E9s
io.worker.add=Ajoute un nouvel employ\u00E9
io.worker.remove=Supprime l'employ\u00E9
io.worker.task-max-threads=Indique le nombre de fils maximum pour le pool de fils des t\u00E2ches de l'employ\u00E9. Si non d\u00E9fini, la valeur par d\u00E9faut calcul\u00E9e par la formule cpuCount * 16 sera utilis\u00E9e, tant que la propri\u00E9t\u00E9 MaxFileDescriptorCount jmx autorise ce nombre, sinon, le calcul prend en compte le maximum pour l'ajuster en fonction.
io.worker.stack-size=La taille de la pile (en octets) \u00E0 tenter d'utiliser pour les fils d'employ\u00E9s.
io.worker.io-threads=Sp\u00E9cifier le nombre de fils d'entr\u00E9e et sorties \u00E0 cr\u00E9er pour l'employ\u00E9. Si aucune valeur n'est sp\u00E9cifi\u00E9e, une valeur par d\u00E9faut sera choisie et calcul\u00E9e par la formule cpuCount * 2
io.worker.task-keepalive=Sp\u00E9cifier le nombre de millisecondes pendant lesquelles laisser les fils non principaux de t\u00E2ches actives.
io.buffer-pool=D\u00E9finir le pool de m\u00E9moire tampon
io.buffer-pool.add=Ajout d'un nouveau pool de m\u00E9moire tampon
io.buffer-pool.remove=Supprime le pool de la m\u00E9moire tampon
io.buffer-pool.buffers-per-slice=Nombre de tampons par tranche. Si non d\u00E9fini, la valeur optimale est calcul\u00E9e en se basant sur les ressources RAM disponibles sur votre syst\u00E8me.
io.buffer-pool.buffer-size=Taille en octets de chaque tranche de tampon. Si non d\u00E9finie, la valeur optimale est calcul\u00E9e en se basant sur les ressources RAM disponibles sur votre syst\u00E8me.
io.buffer-pool.direct-buffers=Est-ce que le pool du tampon utilise des tampons directs\u00A0? Certaines plateformes ne prennent pas en charge les tampons directs
io.worker.core-pool-size=Nombre minimum de threads \u00E0 conserver dans le java.util.concurrent.ThreadPoolExecutor sous-jacent, m\u00EAme s'ils sont inactifs. Les threads au-del\u00E0 de cette limite seront arr\u00EAt\u00E9s au moment sp\u00E9cifi\u00E9 par l'attribut task-keepalive.
io.worker.max-pool-size=Nombre maximum de threads \u00E0 autoriser dans le pool de threads. En fonction de l'impl\u00E9mentation, lorsque cette limite est atteinte, il se peut que les t\u00E2ches qui ne peuvent pas \u00EAtre mises en file d'attente soient rejet\u00E9es.
io.worker.shutdown-requested=Si d\u00E9fini sur True, la fermeture du serveur \u00E0 \u00E9t\u00E9 demand\u00E9e.
io.worker.queue-size=Une estimation du nombre de t\u00E2ches dans la file d'attente de worker.
io.worker.io-thread-count=Nombre de theads E/S
io.worker.server=Ressource de runtime qui d\u00E9crit les serveurs d'\u00E9couteurs utilisant ce worker
io.worker.outbound-bind-address=D\u00E9finit les adresses de liaison \u00E0 utiliser lors de la connexion \u00E0 des destinations sp\u00E9cifi\u00E9es.
io.worker.server.connection-count=Estimation du nombre actuel de connexions
io.worker.server.connection-limit-low-water-mark=Si le nombre de connexions a atteint la limite sup\u00E9rieure pr\u00E9c\u00E9demment, les connexions sont \u00E0 nouveau accept\u00E9es d\u00E8s que le nombre repasse sous cette limite.
io.worker.server.connection-limit-high-water-mark=Si le nombre de connexions atteint cette limite, aucune nouvelle connexion n'est accept\u00E9e tant que  le nombre ne repasse pas sous la limite inf\u00E9rieure.
io.outbound-bind-address=D\u00E9finit une adresse de liaison \u00E0 utiliser lors de la connexion \u00E0 une destination sp\u00E9cifi\u00E9e.
io.outbound-bind-address.add=Ajouter une nouvelle configuration d'adresse de liaison.
io.outbound-bind-address.remove=Supprimer une configuration d'adresse de liaison.
io.outbound-bind-address.match=Plage d'adresses de destination \u00E0 faire correspondre.
io.outbound-bind-address.bind-address=Adresse avec laquelle effectuer une liaison lorsque l'adresse de destination correspond
io.outbound-bind-address.bind-port=Num\u00E9ro de port avec lequel effectuer une liaison lorsque l'adresse de destination correspond
