io=Subsistema de entrada e sa\u00EDda
io.add=Opera\u00E7\u00E3o adiciona subsistema 
io.remove=Opera\u00E7\u00E3o remove subsistema
io.worker=Define trabalhadores
io.worker.add=Adiciona um novo trabalhador 
io.worker.remove=Remove trabalhador
io.worker.task-max-threads=Especifique o n\u00FAmero m\u00E1ximo de threads para o pool de threads de tarefas do operador. Se n\u00E3o estiver definido, ser\u00E1 utilizado o valor padr\u00E3o, que \u00E9 calculado pela f\u00F3rmula cpuCount * 16, desde que a propriedade jmx  MaxFileDescriptorCount permita esse n\u00FAmero. Caso contr\u00E1rio, o c\u00E1lculo levar\u00E1 em conta o n\u00FAmero m\u00E1ximo para ajust\u00E1-lo.
io.worker.stack-size=O tamanho da pilha (em bytes) para tentar utilizar para threads de trabalhadores. 
io.worker.io-threads=Especificar o n\u00FAmero de  threads de entrada e sa\u00EDda para serem criados para o trabalhador. Caso n\u00E3o definido, ser\u00E1 utilizado um padr\u00E3o, que \u00E9 calculado pela f\u00F3rmula cpuCount * 2
io.worker.task-keepalive=Especificar o n\u00FAmero de mil\u00E9simos de segundos para manter threads de tarefas n\u00E3o essenciais vivas. 
io.buffer-pool=Definir o pool de buffer 
io.buffer-pool.add=Adiciona novo pool de buffer
io.buffer-pool.remove=Remove o pool de buffer 
io.buffer-pool.buffers-per-slice=Quantos buffers por fatia,  caso n\u00E3o definido o valor ideal  \u00E9 calculado baseado nos recursos RAM dispon\u00EDveis no seu sistema. 
io.buffer-pool.buffer-size=O tamanho de cada fatia de buffer em bytes, caso n\u00E3o definido o valor ideal \u00E9 calculado baseado nos recursos RAM dispon\u00EDveis no seu sistema. 
io.buffer-pool.direct-buffers=O pool de buffer utiliza buffers diretos, algumas plataformas n\u00E3o suportam buffers diretos. 
io.worker.core-pool-size=N\u00FAmero m\u00EDnimo de threads a serem mantidas no java.util.concurrent.ThreadPoolExecutor subjacente mesmo que estejam ociosas. Threads al\u00E9m desse limite ser\u00E3o encerradas no tempo especificado pelo atributo task-keepalive. 
io.worker.max-pool-size=N\u00FAmero m\u00E1ximo de threads permitidas no pool de threads. Dependendo da implementa\u00E7\u00E3o, quando o limite for atingido, as tarefas que n\u00E3o puderem ser enfileiradas poder\u00E3o ser ejetadas.
io.worker.shutdown-requested=Foi solicitado o desligamento do pool.
io.worker.queue-size=Um n\u00FAmero estimado de tarefas na fila do operador.
io.worker.io-thread-count=Contagem de threads E/S
io.worker.server=Recurso de tempo de execu\u00E7\u00E3o que descreve os servidores ouvindo que usam este operador
io.worker.outbound-bind-address=Define os endere\u00E7os de associa\u00E7\u00E3o a serem usados durante a conex\u00E3o com destinos especificados
io.worker.server.connection-count=Estimativa de contagem da conex\u00E3o atual
io.worker.server.connection-limit-low-water-mark=Se a contagem da conex\u00E3o atingiu a marca d'\u00E1gua alta anteriormente, as conex\u00F5es ser\u00E3o aceitas novamente quando essa contagem diminuir.
io.worker.server.connection-limit-high-water-mark=Se a contagem da conex\u00E3o atingir este n\u00FAmero, novas conex\u00F5es n\u00E3o ser\u00E3o aceitas at\u00E9 que a contagem diminua para abaixo da marca d'\u00E1gua inferior.
io.outbound-bind-address=Define um endere\u00E7o de associa\u00E7\u00E3o a ser usado durante a conex\u00E3o com o destino especificado
io.outbound-bind-address.add=Adicionar uma nova configura\u00E7\u00E3o do endere\u00E7o de associa\u00E7\u00E3o
io.outbound-bind-address.remove=Remover uma configura\u00E7\u00E3o do endere\u00E7o de associa\u00E7\u00E3o
io.outbound-bind-address.match=O intervalo de endere\u00E7os de destino a ser correspondido
io.outbound-bind-address.bind-address=O endere\u00E7o a ser associado quando o endere\u00E7o de destino corresponder
io.outbound-bind-address.bind-port=O n\u00FAmero de porta a ser associado quando o endere\u00E7o de destino corresponder
