io=IO \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
io.add=\u64CD\u4F5C\u306B\u3088\u308A\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u8FFD\u52A0
io.remove=\u64CD\u4F5C\u306B\u3088\u308A\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u524A\u9664
io.worker=\u30EF\u30FC\u30AB\u30FC\u306E\u5B9A\u7FA9
io.worker.add=\u65B0\u3057\u3044\u30EF\u30FC\u30AB\u30FC\u306E\u8FFD\u52A0
io.worker.remove=\u30EF\u30FC\u30AB\u30FC\u306E\u524A\u9664
io.worker.task-max-threads=\u30EF\u30FC\u30AB\u30FC\u30BF\u30B9\u30AF\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B9\u30EC\u30C3\u30C9\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u300CcpuCount * 16\u300D\u3067\u7B97\u51FA\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u304C MaxFileDescriptorCount jmx \u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306B\u3088\u3063\u3066\u8A31\u53EF\u3055\u308C\u308B\u5024\u3067\u3042\u308C\u3070\u3001\u305D\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u7B97\u51FA\u3055\u308C\u305F\u5024\u304C\u8A31\u53EF\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3001\u6700\u5927\u5024\u3092\u8003\u616E\u3057\u3066\u5024\u304C\u8ABF\u6574\u3055\u308C\u307E\u3059\u3002
io.worker.stack-size=\u30EF\u30FC\u30AB\u30FC\u30B9\u30EC\u30C3\u30C9\u3078\u306E\u4F7F\u7528\u3092\u8A66\u307F\u308B\u30B9\u30BF\u30C3\u30AF\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002
io.worker.io-threads=\u30EF\u30FC\u30AB\u30FC\u306B\u5BFE\u3057\u3066\u4F5C\u6210\u3059\u308B I/O \u30B9\u30EC\u30C3\u30C9\u306E\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u300CcpuCount * 2\u300D\u3067\u7B97\u51FA\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u304C\u9078\u629E\u3055\u308C\u307E\u3059\u3002
io.worker.task-keepalive=\u30B3\u30A2\u4EE5\u5916\u306E\u30BF\u30B9\u30AF\u30B9\u30EC\u30C3\u30C9\u3092\u7DAD\u6301\u3059\u308B\u6642\u9593 (\u30DF\u30EA\u79D2\u5358\u4F4D) \u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
io.buffer-pool=\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB\u306E\u5B9A\u7FA9
io.buffer-pool.add=\u65B0\u3057\u3044\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB\u306E\u8FFD\u52A0
io.buffer-pool.remove=\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB\u306E\u524A\u9664
io.buffer-pool.buffers-per-slice=\u30B9\u30E9\u30A4\u30B9\u3054\u3068\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u6570\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u6700\u9069\u306A\u5024\u306F\u30B7\u30B9\u30C6\u30E0\u3067\u4F7F\u7528\u53EF\u80FD\u306A RAM \u30EA\u30BD\u30FC\u30B9\u3092\u57FA\u306B\u7B97\u51FA\u3055\u308C\u307E\u3059\u3002
io.buffer-pool.buffer-size=\u5404\u30D0\u30C3\u30D5\u30A1\u30FC\u30B9\u30E9\u30A4\u30B9\u306E\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8\u5358\u4F4D)\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u6700\u9069\u306A\u5024\u306F\u30B7\u30B9\u30C6\u30E0\u3067\u4F7F\u7528\u53EF\u80FD\u306A RAM \u30EA\u30BD\u30FC\u30B9\u3092\u57FA\u306B\u7B97\u51FA\u3055\u308C\u307E\u3059\u3002
io.buffer-pool.direct-buffers=\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB\u304C\u76F4\u63A5\u30D0\u30C3\u30D5\u30A1\u30FC\u3092\u4F7F\u7528\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u76F4\u63A5\u30D0\u30C3\u30D5\u30A1\u30FC\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u306A\u3044\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u304C\u3042\u308A\u307E\u3059\u3002
io.worker.core-pool-size=\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3042\u3063\u3066\u3082\u57FA\u76E4\u306E java.util.concurrent.ThreadPoolExecutor \u306B\u4FDD\u6301\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5927\u6570\u3002\u3053\u306E\u5236\u9650\u3092\u8D85\u3048\u308B\u30B9\u30EC\u30C3\u30C9\u306F\u3001task-keepalive \u5C5E\u6027\u306B\u3088\u3063\u3066\u6307\u5B9A\u3055\u308C\u305F\u671F\u9593\u3067\u7D42\u4E86\u3057\u307E\u3059\u3002
io.worker.max-pool-size=\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306B\u8A31\u53EF\u3055\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5927\u6570\u3002\u5B9F\u88C5\u306B\u3088\u3063\u3066\u306F\u3001\u3053\u306E\u5236\u9650\u306B\u9054\u3057\u305F\u5834\u5408\u306B\u30AD\u30E5\u30FC\u306B\u7F6E\u304F\u3053\u3068\u304C\u3067\u304D\u306A\u3044\u30BF\u30B9\u30AF\u304C\u62D2\u5426\u3055\u308C\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
io.worker.shutdown-requested=True \u306F\u3001\u30D7\u30FC\u30EB\u306E\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u307E\u3057\u305F\u3002
io.worker.queue-size=\u30EF\u30FC\u30AB\u30FC\u30AD\u30E5\u30FC\u5185\u306E\u63A8\u5B9A\u30BF\u30B9\u30AF\u6570
io.worker.io-thread-count=I/O \u30B9\u30EC\u30C3\u30C9\u30AB\u30A6\u30F3\u30C8
io.worker.server=\u3053\u306E\u30EF\u30FC\u30AB\u30FC\u3092\u5229\u7528\u3059\u308B\u30EA\u30B9\u30CB\u30F3\u30B0\u30B5\u30FC\u30D0\u30FC\u3092\u8A18\u8FF0\u3057\u305F\u30E9\u30F3\u30BF\u30A4\u30E0\u30EA\u30BD\u30FC\u30B9
io.worker.outbound-bind-address=\u6307\u5B9A\u306E\u5B9B\u5148\u3078\u306E\u63A5\u7D9A\u6642\u306B\u4F7F\u7528\u3059\u308B\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9\u3092\u5B9A\u7FA9\u3057\u307E\u3059
io.worker.server.connection-count=\u73FE\u5728\u306E\u6982\u7B97\u63A5\u7D9A\u6570
io.worker.server.connection-limit-low-water-mark=\u4EE5\u524D\u306B\u63A5\u7D9A\u6570\u304C high-water-mark \u306B\u9054\u3057\u305F\u5834\u5408\u3001\u63A5\u7D9A\u6570\u304C\u3053\u306E\u6570\u672A\u6E80\u306B\u306A\u308B\u3068\u63A5\u7D9A\u306F\u518D\u5EA6\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002
io.worker.server.connection-limit-high-water-mark=\u63A5\u7D9A\u6570\u304C\u3053\u306E\u6570\u306B\u9054\u3057\u305F\u5834\u5408\u3001\u63A5\u7D9A\u6570\u304C low-water-mark \u672A\u6E80\u306B\u306A\u3089\u306A\u3044\u3068\u65B0\u3057\u3044\u63A5\u7D9A\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
io.outbound-bind-address=\u6307\u5B9A\u306E\u5B9B\u5148\u3078\u306E\u63A5\u7D9A\u6642\u306B\u4F7F\u7528\u3059\u308B\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9\u3092\u5B9A\u7FA9\u3057\u307E\u3059
io.outbound-bind-address.add=\u65B0\u3057\u3044\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u3092\u8FFD\u52A0
io.outbound-bind-address.remove=\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u3092\u524A\u9664
io.outbound-bind-address.match=\u4E00\u81F4\u3059\u308B\u5B9B\u5148\u30A2\u30C9\u30EC\u30B9\u7BC4\u56F2
io.outbound-bind-address.bind-address=\u5B9B\u5148\u30A2\u30C9\u30EC\u30B9\u3068\u4E00\u81F4\u3059\u308B\u3068\u304D\u306B\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30A2\u30C9\u30EC\u30B9
io.outbound-bind-address.bind-port=\u5B9B\u5148\u30A2\u30C9\u30EC\u30B9\u3068\u4E00\u81F4\u3059\u308B\u3068\u304D\u306B\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30DD\u30FC\u30C8\u756A\u53F7
