io=Subsistema de ES
io.add=La operaci\u00F3n agrega el subsistema.
io.remove=La operaci\u00F3n retira el subsistema.
io.worker=Define Workers
io.worker.add=Agrega un nuevo Worker
io.worker.remove=Borra el Worker
io.worker.task-max-threads=Especifique la cantidad m\u00E1xima de hilos para el pool de hilos de la tarea del trabajador. Si no se configura, se utiliza el valor predeterminado, el cual se calcula mediante la f\u00F3rmula cpuCount * 16, siempre y cuando la propiedad MaxFileDescriptorCount jmx permita esta cantidad. De lo contrario, el c\u00E1lculo considera m\u00E1x. para ajustarlo como corresponde.
io.worker.stack-size=El tama\u00F1o de la pila (en bytes) para intentar usar hilos para Worker.
io.worker.io-threads=Especifica el n\u00FAmero m\u00E1ximo de hilos de E/S a crear para el Worker. Si no se especifica,  se utilizar\u00E1 el valor predeterminado, el cual  es calculado por cpuCount * 16.
io.worker.task-keepalive=Especifica el n\u00FAmero de milisegundos para mantener los hilos de tareas non-core vivos. 
io.buffer-pool=Defines el grupo de b\u00FAfer
io.buffer-pool.add=Agrega un nuevo grupo de b\u00FAfer
io.buffer-pool.remove=Borra un grupo de b\u00FAferes
io.buffer-pool.buffers-per-slice=N\u00FAmero de b\u00FAferes por tajada, si no se especifica el valor \u00F3ptimo se calcula con base en recursos RAM disponibles en su sistema.
io.buffer-pool.buffer-size=El tama\u00F1o en bytes de cada tajada de b\u00FAfer, si no se especifica el valor \u00F3ptimo el valor \u00F3ptimo se calcula con base en los recursos de RAM disponibles en su sistema.
io.buffer-pool.direct-buffers=\u00BFEl grupo de b\u00FAferes utiliza b\u00FAferes directos? Algunas plataformas no soportan los b\u00FAferes directos.
io.worker.core-pool-size=Cantidad m\u00EDnima de hilos para mantener en java.util.concurrent.ThreadPoolExecutor subyacente, inclusive si se encuentran inactivos. Los hilos que superen este l\u00EDmite ser\u00E1n eliminados con el tiempo, seg\u00FAn lo especificado por el atributo task-keepalive.
io.worker.max-pool-size=La cantidad m\u00E1xima de hilos permitidos en el pool de hilos. Conforme la implementaci\u00F3n, cuando se alcanza este l\u00EDmite, podr\u00E1n rechazarse las tareas que no se pueden colocar en cola.
io.worker.shutdown-requested=Es verdadero que se solicit\u00F3 el apagado del pool
io.worker.queue-size=Un estimado del n\u00FAmero de tareas en la cola del trabajador.
io.worker.io-thread-count=Conteo de hilos de E/S
io.worker.server=El recurso del tiempo de ejecuci\u00F3n que describe los servidores oyentes que utilizan este trabajador
io.worker.outbound-bind-address=Define las direcciones de enlace a usar al conectarse a ubicaciones especificadas
io.worker.server.connection-count=Estimado del conteo actual de conexiones
io.worker.server.connection-limit-low-water-mark=Si el conteo de conexiones ha alcanzado previamente la marca de nivel m\u00E1ximo de agua, una vez que vuelva a caer por debajo de este conteo, se volver\u00E1 a aceptar las conexiones.
io.worker.server.connection-limit-high-water-mark=Si el conteo de conexiones alcanza este n\u00FAmero, no se aceptar\u00E1n nuevas conexiones hasta que el conteo caiga por debajo de la marca de nivel m\u00EDnimo de agua.
io.outbound-bind-address=Define las direcciones de enlace a usar al conectarse a la ubicaci\u00F3n especificada
io.outbound-bind-address.add=Agregue una nueva configuraci\u00F3n de la direcci\u00F3n de enlace.
io.outbound-bind-address.remove=Elimine la configuraci\u00F3n de la direcci\u00F3n de enlace
io.outbound-bind-address.match=El rango de direcciones de destino para hacer coincidir
io.outbound-bind-address.bind-address=La direcci\u00F3n a la cual enlazarse cuando coincide la direcci\u00F3n de destino.
io.outbound-bind-address.bind-port=El n\u00FAmero del puerto al cual se debe enlazar cuando coincide la direcci\u00F3n de destino. 
